<?php
header('Content-Type: text/html; charset=UTF-8');
/********** IP ************ */
function GetRealIp()
{
    if (!empty($_SERVER['HTTP_CLIENT_IP']))
        //check ip from share internet
        $ip = $_SERVER['HTTP_CLIENT_IP'];
    elseif (!empty($_SERVER['HTTP_X_FORWARDED_FOR']))
        //to check ip is pass from proxy
        $ip = $_SERVER['HTTP_X_FORWARDED_FOR'];
    else
        $ip = $_SERVER['REMOTE_ADDR'];
    return $ip;
}
function sanitizeString($var)
{
    $var = strip_tags($var);
    $var = htmlentities($var);
    $var = stripslashes($var);
    return mysql_real_escape_string($var);
}
/********** Encode ************ */
function encode($pure_string, $encryption_key) {
        $iv_size = mcrypt_get_iv_size(MCRYPT_BLOWFISH, MCRYPT_MODE_ECB);
        $iv = mcrypt_create_iv($iv_size, MCRYPT_RAND);
        $encrypted_string = mcrypt_encrypt(MCRYPT_BLOWFISH, md5(base64_encode(trim($encryption_key))), utf8_encode(trim($pure_string)), MCRYPT_MODE_ECB, $iv);
        return base64_encode($encrypted_string);
}
/********** Decode ************ */
     function decode($encrypted_string, $encryption_key) {
        $iv_size = mcrypt_get_iv_size(MCRYPT_BLOWFISH, MCRYPT_MODE_ECB);
        $iv = mcrypt_create_iv($iv_size, MCRYPT_RAND);
        $decrypted_string = mcrypt_decrypt(MCRYPT_BLOWFISH, md5(base64_encode(trim($encryption_key))),base64_decode(trim($encrypted_string)), MCRYPT_MODE_ECB, $iv);
        return $decrypted_string;
    }
/********** Encode ************ */
function encodePassword($pure_string,$string)
{  
    $Segment1 = substr($pure_string, 0 , 2).substr($string, 2 , 4).substr($pure_string, 4 , 2);
    $Segment2 = substr($pure_string, 2 , 2).substr($string, 0 , 4).substr($pure_string, 4 , 2);
    return $hasPass =  md5($Segment1) . base64_encode($pure_string).md5($Segment2);
}
/********** Decode ************ */
function decodePassword($encrypted_string)
{
    $encrypted_string=substr_replace($encrypted_string, "", -32);
	$hashReal=substr($encrypted_string, 32);
	return base64_decode($hashReal); 
}
function checkUser($tablename,$user,$password)
{
	 //$hashPass = base64_encode($password);
	 $hashPass=encodePassword($password,$user);
     $loginResult = mysql_query("SELECT * FROM $tablename WHERE user_name = '$user' AND password = '$hashPass'");
     //$loginResult=mysql_query("select *,DECODE(password,'xlsdj') pass from $tablename where user_name='$user' AND password=ENCODE($password,'xlsdj')");
     //$loginResult=mysql_query("select * from $tablename where user_name='$user' AND password=ENCODE($password,'xlsdj')");
	 //$loginResult = mysql_query("SELECT * FROM $tablename WHERE user_name = '$user' AND password = '$password'");
     if(mysql_num_rows($loginResult) > 0)
	 {
       //هاsessionست کردن
	   $_SESSION['mt_user_id'] = mysql_result($loginResult, 0, 'user_id');
       $_SESSION['mt_userName'] = mysql_result($loginResult, 0, 'user_name');
	   $_SESSION['mt_first_name'] = mysql_result($loginResult, 0, 'first_name');
	   $_SESSION['mt_last_name'] = mysql_result($loginResult, 0, 'last_name');
       $_SESSION['mt_code_ostan'] = mysql_result($loginResult, 0, 'code_ostan');
       $_SESSION['mt_role'] = mysql_result($loginResult, 0, 'role_id');
       $_SESSION['mt_all_ostan'] = mysql_result($loginResult, 0, 'chkallostan');
	   $_SESSION['mt_first_login'] = mysql_result($loginResult, 0, 'first_login');
	   $_SESSION['mt_show_anbar'] = mysql_result($loginResult, 0, 'chkshowanbar');
	   //فقط سردخانه های فعال
	   IF($_SESSION['mt_show_anbar']==0) $showCondition=" AND activate=1";
	   $q_anbar="SELECT user_ostan_anbar.code_anbar FROM user_ostan_anbar INNER JOIN list_sardkhane ON user_ostan_anbar.code_ostan=list_sardkhane.code_ostan AND user_ostan_anbar.code_anbar=list_sardkhane.code_anbar WHERE user_id='" . $_SESSION['mt_user_id'] . "' AND user_ostan_anbar.code_ostan='" . $_SESSION['mt_code_ostan'] . "' $showCondition ORDER BY anbar_default DESC,name_anbar ASC";
	   $res_anbar=mysql_query($q_anbar);
	   $row_anbar=mysql_fetch_assoc($res_anbar);
	   $_SESSION['mt_code_anbar']=$row_anbar['code_anbar'];
	   //نام استان مورد نظر
       $res_ostan=mysql_query("SELECT name_ostan FROM ostan WHERE code_ostan='".$_SESSION['mt_code_ostan']."'");
       $_SESSION['mt_name_ostan']=mysql_result($res_ostan, 0, 'name_ostan');
              //نام انبار موردنظر ووضعیت پیمانکار
	   $res_anbar=mysql_query("SELECT id,name_anbar,status_peymankar,situation_type,activate,chkforush,chktozin,chkwebservice,chkhavaleshow FROM list_sardkhane WHERE code_ostan='".$_SESSION['mt_code_ostan']."' AND code_anbar='".$_SESSION['mt_code_anbar']."'");
       $_SESSION['mt_id_anbar'] = mysql_result($res_anbar, 0, 'id');
	   $_SESSION["mt_name_anbar"]=mysql_result($res_anbar, 0, 'name_anbar');
       $_SESSION['mt_status_peymankar']=mysql_result($res_anbar, 0, 'status_peymankar');
	   $_SESSION['mt_situation_type']=mysql_result($res_anbar, 0, 'situation_type');
	   $_SESSION['mt_anbar_activate']=mysql_result($res_anbar, 0, 'activate');
	   $chkforush=mysql_result($res_anbar, 0, 'chkforush');
	   $chktozin = mysql_result($res_anbar, 0, 'chktozin');
	   $chkwebservice=mysql_result($res_anbar, 0, 'chkwebservice');
	   $chkhavaleshow=mysql_result($res_anbar, 0, 'chkhavaleshow');
	   //اتصال به وب سرویس
         if($chkwebservice==1) $_SESSION['mt_webservice']=1;
         else  $_SESSION['mt_webservice']=0;
	   //اتصال به سیستم فروش
	   	 if($chkforush==1) $_SESSION['mt_systemforush']=1;
         else  $_SESSION['mt_systemforush']=0;
	   //اتصال به سیستم توزین
         if ($chktozin == 1) $_SESSION['mt_systemtozin'] = 1;
         else  $_SESSION['mt_systemtozin'] = 0;
	   //مشاهده حواله ها
         if ($chkhavaleshow == 1) $_SESSION['mt_havaleshow'] = 1;
         else  $_SESSION['mt_havaleshow'] = 0;

          // else              $_SESSION['mt_systemforush']='-1';
	   // $chkforush=mysql_result($loginResult, 0, 'chkforush');
	   // if($chkforush==1) $_SESSION['mt_systemforush']=1;
       // else              $_SESSION['mt_systemforush']=0;
	   
	   	include_once 'securimage/securimage.php';
		$securimage = new Securimage();	
		if ($securimage->check($_POST['captcha_code']) == false) {	
			return false;	
		}
       return true;
	 }
	 else
       return false;
}
function PassTru()
{
	$_SESSION['mt_user_ip']=GetRealIp(); 
	if ($_SESSION['mt_SuperUser']=='a8d9e5840f2a062d4fc75a4fc2b76957/422395b58ec1bcbaf94464523183f859') return true;
    else if (isset($_SESSION['mt_user_id']) and $_SESSION['mt_userName']) return true;
    else return false;
}
function SuperUser()
{
     if ($_SESSION['mt_SuperUser']=='a8d9e5840f2a062d4fc75a4fc2b76957/422395b58ec1bcbaf94464523183f859') return true; else return false;
}
function make_pattern($mycode,$tedad_ragham)//ايجاد پترن
{
	  $count=strlen($mycode);
      for($j=1; $j<=($tedad_ragham-$count); $j++)
       $mycode='0'.$mycode;
	  return $mycode;
}
function fnValidatePassword($password)
{
   #must contain 8 characters, 1 uppercase, 1 lowercase and 1 number
   return preg_match('/^(?=^.{8,}$)((?=.*[A-Za-z0-9])(?=.*[A-Z])(?=.*[a-z]))^.*$/', $password);
}
function fnValidateUsername($username){
    #alphabet, digit, @, _ and . are allow. Minimum 6 character. Maximum 50 characters (email address may be more)
    return preg_match('/^[a-zA-Z\d_@.]{6,50}$/i', $username);
}
function fnValidateMobile($mobile){
        return preg_match('/^09[0-9]{9}$/', $mobile);
}
function justNumber($str)
{
    return (preg_match("/^[0-9,]+$/i", trim($str))) ? true : false;
}
function validFarsi($str){
    return (preg_match('/^[پچجحخهعغفقثصضشسیبلاتنمکگوئدذرزطظژؤإأءًٌٍَُِّ\s]+$/u', trim($str))) ? true : false;
}
function validAddressFarsi($Address){
      return preg_match('/^[پچجحخهعغفقثصضشسیبلاتنمکگوئدذرزطظژؤإأءًٌٍَُِّ\s\n\r\t\d\(\)\[\]\{\}.,،;\-؛]+$/', $Address);
}
function validMojavez($shomare)//عدد و دش و ستاره و اسلش
{
      return preg_match("/^[0-9\*\-\.\/]*$/",trim($shomare));
      //return preg_match("/^[0-9*-.\/]*$/",trim($shomare));
}
function fnValidateDate($date){
        #2009/12/11
        #2009-12-11
        #2009.12.11
        #09.12.11
        return preg_match('#^([0-9]?[0-9]?[0-9]{2}[- /.](0?[1-9]|1[012])[- /.](0?[1-9]|[12][0-9]|3[01]))*$#', $date);
}
function fnValidateDate2($date){
        #05/12/2109
        #05-12-0009
        #05.12.9909
        #05.12.99
        return preg_match('/^((0?[1-9]|1[012])[- /.](0?[1-9]|[12][0-9]|3[01])[- /.][0-9]?[0-9]?[0-9]{2})*$/', $date);
}
function fnValidateIRPostal($postalcode){
        #eg. 56789-01234
        return preg_match('/^([0-9]{5})(-[0-9]{5})?$/i',$postalcode);
}
function fnValidateNationalCode($national_code)//check_national_code
{
   if(!preg_match('/^[0-9]{10}$/',$national_code)) 
   {
	   return false;
   }
   for($i=0;$i<10;$i++)
       if(preg_match('/^'.$i.'{10}$/',$national_code))
	   {
         return false;
       }
   for($i=0,$sum=0;$i<9;$i++)
    $sum+=((10-$i)*intval(substr($national_code, $i,1)));

    $ret=$sum%11;

    $parity=intval(substr($national_code, 9,1));

    if(($ret<2 && $ret==$parity) || ($ret>=2 && $ret==11-$parity)) 
	{
      return  true;
    }
    return  false;
}
/*****remove_extra_minus*****/
function remove_extra_minus($mystring)
{
 $first_char=substr($mystring, 0, 1);
 if($first_char=='-')//if the first character is minus
 {
 	$name= str_replace('-','',$mystring);//remove all minus
 	$name=$first_char.$name;//concate first minus
 }
 else $name= str_replace('-','',$mystring);
 return $name;
}
//*************    Array Definitions    ************
$axarr=array(
     1=>Array("1 جداول پايه","1000"),
     2=>Array("....2 جدول استان ها","1001"),
     3=>Array("......3 ايجاد","10011*"),
     4=>Array("......4 اصلاح","10012*"),
     5=>Array("......5 حذف","10013*"),
     6=>Array("......6 جدول شهرستان ها","10014*"),
     7=>Array(".......7 ایجاد","100141*"),
     8=>Array(".......8 اصلاح","100142*"),
     9=>Array(".......9 حذف","100143*"),
    10=>Array("....10 جدول سردخانه ها","1002"),
    11=>Array("......11 ايجاد","10021*"),
    12=>Array("......12 اصلاح","10022*"),
    13=>Array("......13 ویرایش وضعیت سردخانه","10023*"),
	21=>Array("......21 ویرایش شناسه ملی سردخانه","10023*"),
	//22=>Array("......22 ویرایش وضعیت مشاهده همه حواله فروشها در حواله","10023*"),
    22=>Array("......22 ویرایش ظرفیت تخلیه و بارگیری روزانه","10023*"),
    //13=>Array("......13 حذف","10023*"),
	14=>Array("......14 جزئیات سردخانه","10024*"),
	15=>Array(".......15 ايجاد","100241*"),
    16=>Array(".......16 اصلاح","100242*"),
    17=>Array(".......17 حذف","100243*"),
	18=>Array("......18 اطلاعات صاحب سردخانه","10024*"),
	19=>Array(".......19 ايجاد","100241*"),
    20=>Array(".......20 اصلاح","100242*"),
	23=>Array("....23 جدول کشورها","1003"),
    24=>Array("......24 ايجاد","10031*"),
    25=>Array("......25 اصلاح","10032*"),
    26=>Array("......26 حذف","10033*"),
	27=>Array("....27 اطلاعات کالا","1004"),
    28=>Array("......28 جدول واحد کالا","10041*"),
    29=>Array(".......29 ايجاد","100411*"),
    30=>Array(".......30 اصلاح","100412*"),
    31=>Array(".......31 حذف","100413*"),
    32=>Array("......32 جدول نوع بسته بندی","10042*"),
    33=>Array(".......33 ايجاد","100421*"),
    34=>Array(".......34 اصلاح","100422*"),
    35=>Array(".......35 حذف","100423*"),
	36=>Array("......36 جدول گروه کالا","10043*"),
    37=>Array(".......37 ايجاد","100431*"),
    38=>Array(".......38 اصلاح","100432*"),
    39=>Array(".......39 حذف","100433*"),
    40=>Array("......40 جدول کالا","10044"),
    41=>Array(".......41 ايجاد","100441*"),
    42=>Array(".......42 اصلاح","100442*"),
    43=>Array(".......43 حذف","100443*"),
	44=>Array(".......44 جزئیات کالا","100444*"),
	45=>Array(".......45 ايجاد","1004441*"),
    46=>Array(".......46 اصلاح","1004442*"),
    47=>Array(".......47 حذف","1004443*"),
	48=>Array("....48 جدول نوع کارتن","1005"),
    49=>Array("......49 ايجاد","10051*"),
    50=>Array("......50 اصلاح","10052*"),
    51=>Array("......51 حذف","10053*"),
	52=>Array("....52 جدول تولیدکننده","1006"),
    53=>Array("......53 ايجاد","10061*"),
    54=>Array("......54 اصلاح","10062*"),
    55=>Array("......55 حذف","10063*"),
	56=>Array("....56 جدول قیمت جریمه","1007"),
    57=>Array("......57 ايجاد","10071*"),
    58=>Array("......58 اصلاح","10072*"),
    59=>Array("......59 حذف","10073*"),
    60=>Array("......60 جدول جزئیات قیمت جریمه","10074*"),
	61=>Array(".......61 ایجاد","100741*"),
    62=>Array(".......62 اصلاح","100742*"),
    63=>Array(".......63 حذف","100743*"),
	64=>Array("....64 جدول قیمت خرید","1008"),
    65=>Array("......65 ايجاد","10081*"),
    66=>Array("......66 اصلاح","10082*"),
    67=>Array("......67 حذف","10083*"),
    68=>Array("......68 جدول جزئیات قیمت خرید","10084*"),
	69=>Array(".......69 ایجاد","100841*"),
    70=>Array(".......70 اصلاح","100842*"),
    71=>Array(".......71 حذف","100843*"),
	72=>Array("....72 جداول هزینه","1009"),
	73=>Array("......73 جدول هزینه تخلیه","10091*"),
	74=>Array("........74 ايجاد","100911*"),	
    75=>Array("........75 اصلاح","100912*"),
    76=>Array("........76 حذف","100913*"),
    77=>Array("........77 جدول جزئیات هزینه تخلیه","100914*"),
	78=>Array(".........78 ایجاد","1009141*"),
    79=>Array(".........79 اصلاح","1009142*"),
    80=>Array(".........80 حذف","1009143*"),
	81=>Array("......81 جدول هزینه بارگیری","10092"),
    82=>Array("........82 ايجاد","100921*"),
    83=>Array("........83 اصلاح","100922*"),
    84=>Array("........84 حذف","100923*"),
	85=>Array("........85 جدول جزئیات هزینه بارگیری","100924*"),
	86=>Array(".........86 ایجاد","1009241*"),
    87=>Array(".........87 اصلاح","1009242*"),
    88=>Array(".........88 حذف","1009243*"),
	89=>Array("......89 جدول هزینه باسکول","10093"),
    90=>Array("........90 ايجاد","100931*"),
    91=>Array("........91 اصلاح","100932*"),
    92=>Array("........92 حذف","100933*"),
    93=>Array("........93 جدول جزئیات هزینه باسکول","100934*"),
    94=>Array(".........94 ایجاد","1009341*"),
    95=>Array(".........95 اصلاح","1009342*"),
    96=>Array(".........96 حذف","1009343*"),		
	97=>Array("....97 جدول مشتریان","1010"),
    98=>Array("......98 ايجاد","10101*"),
    99=>Array("......99 اصلاح","10102*"),
    100=>Array("......100 حذف","10103*"),
    101=>Array("....101 جدول مبادی ورودی کالا","1011*"),
    102=>Array("......102 ايجاد","10111*"),
    103=>Array("......103 اصلاح","10112*"),
    104=>Array("......104 حذف","10113*"),
    105=>Array("....105 اطلاعات فروشنده / کشتی","1012"),
    106=>Array("......106 جدول تعریف فروشنده /کشتی","10121*"),
    107=>Array("........107 ايجاد","101211*"),
    108=>Array("........108 اصلاح","101212*"),
    109=>Array("........109 حذف","101213*"),
    110=>Array("......110 جدول شماره قرارداد / سفر","10122*"),   
	111=>Array("........111 ايجاد","101221*"),
    112=>Array("........112 اصلاح","101222*"),
    113=>Array("........113 حذف","101223*"),
	114=>Array("......114 کدینگ کد مالی کشتی","10123"),
    115=>Array("........115 ايجاد","101231*"),
    116=>Array("........116 اصلاح","101232*"),
    117=>Array("........117 حذف","101233*"),
	118=>Array("....118 جدول نوع تخلیه","1013"),
    119=>Array("......119 ايجاد","10131*"),
    120=>Array("......120 اصلاح","10132*"),
    121=>Array("......121 حذف","10133*"),
	122=>Array("....122 جدول پیمانکار حمل","1014"),
    123=>Array("......123 ايجاد","10141*"),
    124=>Array("......124 اصلاح","10142*"),
    125=>Array("......125 حذف","10143*"),
    126=>Array("....126 جدول عامل پرداخت پسکرایه","1015"),
    127=>Array("......127 ايجاد","10151*"),
    128=>Array("......128 اصلاح","10152*"),
    129=>Array("......129 حذف","10153*"),
    702=>Array("....702 جدول تاریخ ماندگاری","1016"),
    703=>Array("......703 ايجاد","10161*"),
    704=>Array("......704 اصلاح","10162*"),
    705=>Array("......705 حذف","10163*"),
	130=>Array("130 اطلاعات","2000"),
    131=>Array("....131 موجودی کالا در سردخانه","2001"),
    132=>Array("......132 ايجاد","20011*"),
    133=>Array("......133 اصلاح","20012*"),
    134=>Array("......134 حذف","20013*"),	
	135=>Array("....135 جدول حواله فروش","2002"),
    136=>Array("......136 ايجاد","20021*"),
    137=>Array("......137 اصلاح","20022*"),
    138=>Array("......138  مشاهده حواله فروش","20023*"),
    139=>Array("......139 چاپ","20024*"),
    140=>Array("....140 جدول ابطال مقادیر حواله فروش","2003"),
    141=>Array("......141 ايجاد","20031*"),
    142=>Array("......142 اصلاح","20032*"),
    143=>Array("......143 حذف","20033*"),
	144=>Array(".....144 چاپ","20034*"),
	145=>Array("....145 جدول مجوز جابه جایی","2004"),
    146=>Array("......146 ايجاد","20041*"),
    147=>Array("......147 اصلاح","20042*"),
    148=>Array("......148 حذف","20043*"),
    149=>Array("......149 چاپ","20044*"),
    150=>Array("....150 جدول ابطال مقادیر مجوز جابه جایی","2005"),
    151=>Array("......151 ايجاد","20051*"),
    152=>Array("......152 اصلاح","20052*"),
    153=>Array("......153 حذف","20053*"),
	154=>Array(".....154 چاپ","20054*"),
	155=>Array("....155 جدول وارده به انبار","2006"),  
	156=>Array("......156 ايجاد","20061*"),
    157=>Array("......157 اصلاح","20062*"),
    158=>Array("......158 حذف","20063*"),
    159=>Array("......159 چاپ","20064*"),
    160=>Array("......160 ابطال رسید","20065*"),
    603=>Array("...... جواز ابطال رسید", "603"),
    601=>Array("......601 آزادکردن رسید جهت ابطال", "20067*"),	
	161=>Array("......161 تأیید ناظر","20066*"),
    162=>Array("......162 اطلاعات کالای رسید","20067*"),
	163=>Array(".......163 ایجاد","200671*"),
    164=>Array(".......164 اصلاح","200672*"),
    165=>Array(".......165 حذف","200673*"),
    166=>Array("........166 جزئیات کالای رسید","200674*"),
	167=>Array("........167 ایجاد","2006741*"),
    168=>Array("........168 اصلاح","2006742*"),
    169=>Array("........169 حذف","2006743*"),
	170=>Array("....170 جدول صادره از انبار","2007"),   
	171=>Array("......171 ايجاد","20071*"),
    172=>Array("......172 اصلاح","20072*"),
    173=>Array("......173 حذف","20073*"),
    174=>Array("......174 چاپ","20074*"),
    175=>Array("......175 ابطال حواله","20075*"),
	604=>Array("...... جواز ابطال حواله", "604"),
    602=>Array("......602 آزادکردن حواله جهت ابطال", "20077*"),
    176=>Array("......176 جزئیات کالا","20076*"),
    177=>Array(".......177 ایجاد","200761*"),
    178=>Array(".......178 اصلاح","200762*"),
    179=>Array(".......179 حذف","200763*"),
	180=>Array("....180 طرح در کمیسیون افت و کسری","2008"),
    181=>Array("......181 ايجاد","20081*"),
    182=>Array("......182 اصلاح","20082*"),
    183=>Array("......183 حذف","20083*"),
	184=>Array("......184 چاپ","20084*"),
	185=>Array("......185 ابطال","20085*"),	
	186=>Array("......186 تکمیل اطلاعات و تایید توسط ستاد مرکزی","20086*"),
    187=>Array("....187 مجوز تعدیل موجودی","2009"),
    188=>Array("......188 ايجاد","20091*"),
    189=>Array("......189 اصلاح","20092*"),
    190=>Array("......190 حذف","20093*"),
	191=>Array("......191 چاپ","20094*"),
	192=>Array("......192 ابطال","20095*"),
	193=>Array("....193 جدول تعدیل موجودی","2010"),
    194=>Array("......194 ايجاد","20101*"),
    195=>Array("......195 اصلاح","20102*"),
    196=>Array("......196 حذف","20103*"),
	197=>Array("......197 چاپ","20104*"),
	198=>Array("......198 ابطال","20105*"),
    199=>Array("....199 شمارش انبارگردانی","2011"),
    200=>Array("......200 ایجاد","20111*"),
    201=>Array("......201 اصلاح","20112*"),
    202=>Array("......202 ایجاد جزئیات انبارگردانی","20113*"),
	203=>Array("......203 ویرایش جزئیات انبارگردانی","20114*"),
    //204=>Array("......204 اصلاح مغایرت ها با ایجاد رسید و حواله","20115*"),
    204=>Array("......204 ایجاد نامه در کمیسون افت و کسری","20115*"),
	205=>Array("......205 اصلاح موجودی اول دوره سال بعد","20116*"),
	206=>Array("....206 جدول کنترل کاردکس","2012"),
	207=>Array("....207 جدول کاردکس حواله فروش","2013"),
    208=>Array("....208 جدول کاردکس مجوز جابه جایی","2014"),
	800=>Array("....800 جدول موجودی تحت کلید گمرک","2015"),
	210=>Array("210 گزارشات","3000"),
	211=>Array("....211 گزارش براساس حواله سردخانه","3001"),
	212=>Array("......212 گزارش حواله به طور کلی","30011"),
	213=>Array("......213 گزارش حواله با جزئیات کالا","30012"),
	214=>Array("....214 گزارش براساس رسید سردخانه","3002"),
	215=>Array("......215 گزارش رسید به طور کلی","30021"),
	216=>Array("......216 گزارش رسید با جزئیات کالا","30022"),
	217=>Array("....217 گزارش براساس فرم تعدیل موجودی","3003"),
	218=>Array("....218 گزارش براساس فرم ابطال حواله فروش","3004"),
	219=>Array("....219 گزارش براساس محدوده تاریخ کاردکس","3005"),
	220=>Array("....220 گزارش وضعیت موجودی سردخانه","3006"),
	221=>Array("....221 گزارش وضعیت موجودی براساس فروشندگان","3007"),
	222=>Array("....222 مانده موجودی و حواله فروش","3008"),
	223=>Array("....223 خلاصه وضعیت حواله فروش","3009"),
	224=>Array("......224 خلاصه وضعیت حواله فروش-مشتری","30091"),
	225=>Array("......225 خلاصه وضعیت حواله فروش-کالا","30092"),
	226=>Array("......226 خلاصه وضعیت حواله فروش-کالا (نسخه دوم)","30093"),
	227=>Array("......227 گزارش حواله فروش مانده دار","30094"),
	228=>Array("....228 مانده موجودی روزانه کالا","3010"),
	229=>Array("....229 سری زمانی موجودی کالا","3011"),
	230=>Array("....230 گزارش رانندگان","3012"),
	231=>Array("....231 گزارش پرداخت پسکرایه","3013"),
    232=>Array("....232 گزارش فروشندگان کالا","3014"),
    233=>Array("....233 گزارش موجودی مجاز","3015"),
	234=>Array("....234 گزارش مصرف کننده نهایی کالای وارداتی", "3016"),
	240=>Array("240 گزارشات مدیریتی","4000"),
	241=>Array("....241 گزارش وضعیت نهاده ها به تفکیک محل نگهداری","4001"),
    242=>Array("....242 گزارش مانده موجودی وحواله فروش استان ها","4002"),
	243=>Array("....243 گزارش مانده موجودی","4003"),
	715=>Array("......715 گزارش مانده موجودی کلی کالاها","40031"),
	716=>Array("......716 گزارش مانده موجودی کلی کالاها براساس مالکیت سردخانه ها و تحت کلید (مرغ و گاو و گوسفند)","40032"),
	717=>Array("......717 گزارش مانده موجودی کلی کالاها براساس مالکیت سردخانه ها و تحت کلید (مرغ و گوشت)","40033"),
	718=>Array("......718 گزارش موجودی گوشت قرمز برحسب تاریخ انقضاء","40034"),
	719=>Array("......719 گزارش موجودی مرغ برحسب تاریخ انقضاء","40035"),
    730=>Array("......730 گزارش موجودی ماهانه (گروه کالا میانی)","40036"),
	244=>Array("....244 گزارش سری زمانی","4004"),
    245=>Array("......245 گزارش سری زمانی مانده موجودی و حواله فروش روزانه کالا","40041"),
	246=>Array("......246 گزارش سری زمانی موجودی به تفکیک استان و سردخانه","40042"),
	247=>Array("....247 گزارش اطلاعات عملکرد فرآورده ها","4005"),
	248=>Array("......248 گزارش اطلاعات عملکرد فرآورده ها به طور کلی","40051"),
	249=>Array("......249 گزارش اطلاعات عملکرد فرآورده ها به تفکیک استان","40052"),
	250=>Array("......250 گزارش اطلاعات عملکرد فرآورده ها به تفکیک استان و سردخانه","40053"),
	251=>Array("....251 گزارش موجودی به تفکیک تاریخ تولید کالا","4006"),
	252=>Array("......252 به تفکیک استان (یک کالا)","40061"),
	700=>Array("......700 به تفکیک استان (چندین کالا)","40062"),
	706=>Array("......706 یه تفکیک استان (گروه کالا میانی)","40063"),
	253=>Array("......253 به تفکیک استان و سردخانه","40063"),
	254=>Array("....254 گزارش موجودی به تفکیک تاریخ تولید گروه کالا","4007"),
	255=>Array("......255 یه تفکیک استان","40071"),
	256=>Array("......256 به تفکیک استان و سردخانه","40072"),
	257=>Array("....257 گزارش مقادیر ارسالی استان ها","4008"),
	258=>Array("......258 گزارش مقادیر ارسالی استان ها به تفکیک کالا","40081"),
	259=>Array("......259 گزارش مقادیر ارسالی استان ها به تفکیک گروه کالا","40082"),
	260=>Array("......260 گزارش جزئیات مقادیر ارسالی","40083"),
	261=>Array("....261 گزارش مقادیر دریافتی استان ها","4008"),
    262=>Array("......262 گزارش مقادیر دریافتی استان ها به تفکیک کالا","40081"),
	263=>Array("......263 گزارش مقادیر دریافتی استان ها به تفکیک گروه کالا","40082"),
	264=>Array("......264 گزارش جزئیات مقادیر دریافتی","40083"),
	265=>Array("....265 گزارش وضعیت موجودی سردخانه ها","4009"),
    266=>Array("......266 گزارش موجودی و ورودی و خروجی سردخانه ها","40091"),
	291=>Array("......291 گزارش موجودی و ورودی و خروجی سردخانه ها (تحت کلید گمرک)","40092"),
	267=>Array("......267 گزارش موجودی سردخانه ها با جزئیات","40093"),
	292=>Array("......292 گزارش موجودی سردخانه ها با جزئیات (تحت کلید گمرک)","40094"),
	268=>Array("......268 گزارش موجودی مجاز استان ها","40095"),
	269=>Array("......269 گزارش موجودی مجاز سردخانه ها با جزئیات","40096"),
	287=>Array("......287 گزارش تعیین وضعیت زمان و مقدار ورود و خروج و بالترین و پایین ترین موجودی", "40097"),
	270=>Array("....270 گزارش مجوزهای جابه جایی ","4010"),
	271=>Array("......271 گزارش مجوزهای جابه جایی به سردخانه های موقت","40101"),
	272=>Array("......272 گزارش مجوزهای جابه جایی جایگزینی با بخش خصوصی","40102"),
	273=>Array("....273 گزارش نظارت وبازرسی","4011"),
	288=>Array("......288 گزارش نظارت وبازرسی حواله ها","40111"),
	289=>Array("......289 گزارش تأمین براساس خروجی مجوز فروش","40112"),
	290=>Array("......290 گزارش نظارت و بازرسی جابه جایی","40113"),
	274=>Array("....274 گزارش مدت زمان تحویل کالا","4012"),
	275=>Array("....275 گزارش انبارگردانی","4013"),
	276=>Array("....276 گزارش اطلاعات فرآورده ها مخصوص بیمه","4014"),
	713=>Array("......713 گزارش اطلاعات فرآورده ها مخصوص بیمه-سرجمع گوشت","40141"),
	714=>Array("......714 گزارش اطلاعات فرآورده ها مخصوص بیمه- تفکیک گوشت","40142"),
	277=>Array("....277 گزارش حواله فروش های مانده دار به تفکیک استان و سردخانه","4015"),
	278=>Array("....278 گزارش ظرفیت سردخانه ها","4016"),
	711=>Array("....711 گزارش ظرفیت قراردادی و موجودی سردخانه ها","40161"),
	712=>Array("....712 گزارش ظرفیت ، درصد بهره وری و فضای باقیمانده","40162"),
	721=>Array("....721 گزارش خرید/ فروش قطعی به تفکیک ماه","4017"),
	722=>Array("......722 گروه کالای اصلی", "40171"),
    723=>Array("......723 گروه کالای میانی", "40172"),
    724=>Array("....724 گزارش خرید و فروش ماهانه", "4018"),
    725=>Array("......725 گروه کالای اصلی", "40181"),
    726=>Array("......726 گروه کالای میانی", "40182"),
	727=>Array("......727 کالا", "40183"),
	701=>Array("....701 گزارش مقایسه مقادیر ارسالی و تحویلی مابین استان ها)", "4018"),
	710=>Array("....710 گزارش اطلاعات فروش قطعی ، ارسالی به سایر استانها و حواله فروش)", "4019"),
	720=>Array("....720 گزارش آمار توزیع فرآورده ها )", "4020"),
	721=>Array("....721 گزارش  طرح در کمیسیون افت و کسری )", "4021"),
	900 => Array(" گزارش فروش", "900"),
    901 => Array(".... گزارش فروش نهاده ها و فرآورده ها", "901"),
	280=>Array("280 نمودار","5000"),
    281=>Array("....281 نمودار ظرفیت اسمی و موجودی سردخانه ها","5001"),
    282=>Array("....282 نمودار ظرفیت قراردادی و موجودی سردخانه ها","5002"),
	283=>Array("....283 نمودار موجودی گروه کالاهای هر استان","5003"),
	284=>Array("....284 نمودار درصد موجودی گروه کالا در استان","5004"),
    285=>Array("....285 نقشه مانده موجودی استان ها","5005"),
	300=>Array("300 مديريت","5000"),
	301=>Array("....301 تعریف سال","5001"),
	302=>Array("......302 ايجاد","50011*"),
    303=>Array("......303 اصلاح","50012*"),
    304=>Array("......304 حذف","50013*"),
	305=>Array("....305 مدیریت کاربران","5002"),
	306=>Array("......306 تعیین نقش و حدود دسترسی","50021*"),
	307=>Array("........307 ايجاد","500211*"),
    308=>Array("........308 اصلاح","500212*"),
    309=>Array("........309 حذف","500213*"),
    310=>Array("........310 جدول دسترسی","500214*"),
    311=>Array(".........311 اصلاح","5002141*"),
	312=>Array("......312 کاربران","50022*"),
	313=>Array(".......313 ایجاد","500221*"),
    314=>Array(".......314 اصلاح","500222*"),
    315=>Array(".......315 حذف","500223*"),
	316=>Array(".......316 تعیین استان کاربر","500224*"),
    317=>Array(".......317 تعیین انبار کاربر","500225*"),
    318=>Array(".......318 تعیین نقش کاربر","500226*"),
	319=>Array("....319 امضاکنندگان اسناد","5003"),
	320=>Array("......320 پست های سازمانی","50031*"),
	321=>Array("........321 ايجاد","500311*"),
    322=>Array("........322 اصلاح","500312*"),
    323=>Array("........323 حذف","500313*"),
	324=>Array("......324 تعیین انواع فرم و امضاکنندگان","50032*"),
	325=>Array(".......325 تعیین امضاکنندگان ","500321*"),
	326=>Array("........326 ايجاد","5003211*"),
    327=>Array("........327 اصلاح","5003212*"),
    328=>Array("........328 حذف","5003213*"),
	//286=>Array(".........266 تأیید","4003211*"),
	329=>Array(".......329 تعیین توضیحات فرم ","500322*"),
	330=>Array("......330 ايجاد","5003221*"),
    331=>Array("......331 اصلاح","5003222*"),
    332=>Array("......332 حذف","5003223*"),
	333=>Array("....333 جدول نوع عملیات","5004"),
    334=>Array("......334 ايجاد","50041*"),
    335=>Array("......335 اصلاح","50042*"),
    336=>Array("......336 حذف","50043*"),
	337=>Array("....337 جدول کد بدهکار و بستانکار","5005"),
    338=>Array("......338 ايجاد","50051*"),
    339=>Array("......339 اصلاح","50052*"),
    340=>Array("......340 حذف","50053*"),
	341=>Array("....341 تعیین سقف خرید کالا","5006"),
    342=>Array("......342 ايجاد","50061*"),
    343=>Array("......343 اصلاح","50062*"),
    344=>Array("......344 حذف","50063*"),
	345=>Array("....345 سند حسابداری وارده به سردخانه","5007"),
	346=>Array(".....346 سند براساس تاریخ رسید","50071*"),
	347=>Array(".....347 سند حسابداری براساس شماره رسید","50072*"),
	348=>Array(".....348 سند حسابداری براساس خرید","50073*"),
	349=>Array("....349 سند حسابداری صادره از انبار","5008"),
    350=>Array("......350 حواله های قطعی ","50081*"),
    351=>Array("......351 حواله های مانده دار  ","50082*"),
    352=>Array("......352 حواله های جابه جایی ","50083*"),
    353=>Array("......353 سندحسابداری صادره از سردخانه با شماره حواله فروش  ","50084*"),
    354=>Array("......354 سندحسابداری صادره از سردخانه با شماره مجوز جابه جایی  ","50085*"),
    360 => Array(".... وضعیت ارسال به سامانه جامع انبارها ", "360"),
    361 => Array("......  وضعیت رسید ها ", "361"),
    362 => Array("...... وضعیت حواله ها ", "362"),
    400=>Array("400 خرید","6000"),
	401=>Array("....401 فرم ابلاغ از سوی وزیر","6001"),
	402=>Array("......402 ايجاد","60011*"),
    403=>Array("......403 اصلاح","60012*"),
    404=>Array("......404 حذف","60013*"),
    405=>Array("......405 چاپ","60014*"),
	406=>Array("....406 سهمیه بندی خرید استان ها","6002"),
	407=>Array("......407 ايجاد","60021*"),
    408=>Array("......408 اصلاح","60022*"),
    409=>Array("......409 حذف","60023*"),
    410=>Array("......410 چاپ","60024*"),
	411=>Array("....411 دستورالعمل خرید","6003"),
	412=>Array("......412 ايجاد","60031*"),
    413=>Array("......413 اصلاح","60032*"),
    414=>Array("......414 حذف","60033*"),
    415=>Array("......415 چاپ","60034*"),
    416=>Array("....416 تعیین قیمت خرید ابلاغ","6004"),
	417=>Array("......417 ايجاد","60041*"),
    418=>Array("......418 اصلاح","60042*"),
    419=>Array("......419 حذف","60043*"),
    420=>Array("......420 چاپ","60044*"),
	421=>Array("....421 قرارداد خرید","6005"),
	422=>Array("......422 ايجاد","60051*"),
    423=>Array("......423 اصلاح","60052*"),
    424=>Array("......424 حذف","60053*"),
    425=>Array("......425 چاپ","60054*"),
    426=>Array("......426 بستن قرارداد","60055*"),
	466=>Array("......466 ویرایش تاریخ اتمام قرارداد","60056*"),
    427=>Array("......427 الحاقیه قرارداد","60056*"),
	428=>Array("........428 ايجاد","600561*"),
    429=>Array("........429 اصلاح","600562*"),
    430=>Array("........430 حذف","600563*"),
    431=>Array("........431 چاپ","600564*"),
	432=>Array("......432 تأمین اعتبار قرارداد","60056*"),
	433=>Array("........433 ايجاد","600561*"),
    434=>Array("........434 اصلاح","600562*"),
    435=>Array("........435 حذف","600563*"),
    436=>Array("........436 چاپ","600564*"),
	456=>Array("........456 درخواست طرح و برنامه قرارداد","60056*"),
	457=>Array("..........457 ايجاد","600561*"),
    458=>Array("..........458 اصلاح","600562*"),
    459=>Array("..........459 حذف","600563*"),
    460=>Array("..........460 چاپ","600564*"),
    437=>Array("......437 تضامین قرارداد","60056*"),
	438=>Array("........438 ايجاد","600561*"),
    439=>Array("........439 اصلاح","600562*"),
    440=>Array("........440 حذف","600563*"),
    441=>Array("......441 تأمین اعتبار الحاقیه","60056*"),
	442=>Array("........442 ايجاد","600561*"),
    443=>Array("........443 اصلاح","600562*"),
    444=>Array("........444 حذف","600563*"),
    445=>Array("........445 چاپ","600564*"),
	461=>Array("........461 درخواست طرح و برنامه الحاقیه","60056*"),
	462=>Array("..........462 ايجاد","600561*"),
    463=>Array("..........463 اصلاح","600562*"),
    464=>Array("..........464 حذف","600563*"),
    465=>Array("..........465 چاپ","600564*"),
	446=>Array("......446 پرداختی های قرارداد","60056*"),
	447=>Array("........447 ايجاد","600561*"),
    448=>Array("........448 اصلاح","600562*"),
    449=>Array("........449 حذف","600563*"),
	450=>Array("....450 گزارش قراردادها","6006"),
	522=>Array("......522 گزارش قراردادها براساس تاریخ رسید","60061"),
	523=>Array("......523 گزارش قراردادها براساس تاریخ قرارداد","60062"),
	451=>Array("....451 گزارش خرید","6007"),
	481=>Array("....481 گزارش خرید تجمعی","6008"),
    482=>Array("....482 گزارش خرید تجمعی به تفکیک داخلی وارداتی","6009"),
	480=>Array("....480 گزارش عملکرد خرید","6010"),
	452=>Array("....452 گزارش قراردادها با آنالیز","6011"),
	453=>Array("....453 گزارش تجمعی قراردادها","6012"),
	454=>Array("....454 گزارش تجمعی قراردادها یکپارچه","6013"),
	//454=>Array("....454 گزارش خرید طی دوره ","6011"),
	455=>Array("....455 گزارش خرید طی دوره با محاسبه مابه التفاوت ","6014"),
	470=>Array("....470 گزارش خرید روزانه مرغ داخلی ","6015"),
	//471=>Array("....471 گزارش خرید ماه ","6015"),
	510=>Array("510 کنترل کیفی","8000"),
	511=>Array("....511 پایش کیفیت ذخایر فرآورده ها","8001"),
    512=>Array("........512 ايجاد","80011*"),
    513=>Array("........513 اصلاح","80012*"),
    514=>Array("........514 حذف","80013*"),
	515=>Array("........515 چاپ","80014*"),
	516=>Array("........516 جزئیات محموله","80015*"),
	517=>Array(".........517 ايجاد","800151*"),
    518=>Array(".........518 اصلاح","800152*"),
    519=>Array(".........519 حذف","800153*"),
	520=>Array(".........520 چاپ","800154*"),
    521=>Array(".........521 گزارش پایش کیفیت ذخایر فرآورده ها","8002*"),
	500=>Array("500 داشبورد","7000"),
	600=>Array("....600 مشاهده هشدار طرح در کمیسیون افت وکسری","9000"),
 );
 /*****گروه کالا*****/
 $kalagroupArr = array(
  "1"=>'گوشت گاو',
  "2"=>'گوشت گوسفند',
  "3"=>'گوشت مرغ',
  "4"=>'کنسرو مرغ',
  "5"=>'تخم مرغ خوراکی',
  "6"=>'تخم مرغ صنعتی'
  );
 /*****نوع زیرانبار*****/
 $ziranbarArr=array(
  0=>'انتخاب کنید',
  1=>'سالن',
  2=>'تحت کلید',
  3=>'امانی'
 );
 /*****نوع خودرو*****/
 $khodroArr=array(
  0=>'انتخاب کنید',
  1=>'وانت',
  4=>'خاور',
  2=>'کامیون تک',
  3=>'تریلی',
  5=>'متفرقه',
  6=>'کامیون جفت'
  );
 /*****وظایف پیمانکار*****/
 $vazayef_peymankarArr=array(
  0=>'انتخاب کنید',
  1=>'مدیریت انبار',
  2=>'تخلیه و بارگیری'
  );
 /*****وضعیت سال*****/
 $yearstatArr= array(
  0=> 'فعال',
  1=> 'غير فعال',
 );
 /*****وضعیت سال برای سوپریوزر*****/
 $SyearstatArr= array(
  0=> 'فعال',
  1=> 'غير فعال',
  2=> 'مخفی',
 );
 $activateArr=array(
  1 =>'فعال',
  2 =>'غیرفعال'
  );
 // /*****وضعیت سال برای سوپریوزر*****/
// $sysArr= array(
  // 0=> 'انبار',
  // 1=> 'فروش',
// );
 /*****نوع سند*****/
  $sanadArr = array (
  0 =>'انتخاب کنيد',
  1 =>'وارده جنسی',
  2 =>'کسری و اضافات',
  3 =>'وارده ریالی',
  4 =>'صادره جنسی',
  5 =>'صادره ریالی',
  6 =>' خرید'
  );
 /****نوع مبدأ***/
  $noe_mabdaArr = array (
  //0 =>'انتخاب کنيد',
  1 =>'عادی',
  2 =>'فی مابین'
  );
  /*****وضعیت عامل پرداخت پسکرایه*****/
  $statusAmelArr = array (
  //0 =>'انتخاب کنيد',
  1 =>'جاری',
  2 =>'غیرجاری'
  );
  /*****وضعیت فرم*****/
  $statusFormArr = array (
  -1 =>'انتخاب کنيد',
  0 =>'جاری',
  1 =>'ابطالی'
  );
  /*****نوع گروه کالا*****/
  $grouptypeArr = array (
  //0 =>'انتخاب کنيد',
  1 =>'علوفه ایی',
  2 => 'گوشتی'
  );
  /*****نوع محموله در فرم کالا*****/
  $mahmuletypeKalaArr = array (
  0 =>'انتخاب کنيد',
  1 =>'داخلی',
  2 =>'وارداتی'
  );
  /*****نوع محموله در فرم ابلاغ*****/
  $mahmuletypeArr = array (
  0 =>'انتخاب کنيد',
  1 =>'داخلی',
  2 =>'وارداتی',
  3 =>'وارداتی قرارداد استانی',
  4 =>'داخلی با آنالیز',
  5 =>'وارداتی با آنالیز'
  );
  /*****معیارآنالیز*****/
  $meyarArr = array (
  0 =>'-',
  1 =>'حداقل',
  2 =>'حداکثر'
  );
  /*****معیار*****/
  $elhaghtypeArr = array (
  0 =>'-',
  1 =>'افزایش',
  2 =>'کاهش'
  );
  /*****نوع گوشت*****/
  $goshttypeArr = array (
  0 =>'-',
  1 =>'گوسفند',
  2 =>'گاو'
  );
  /*****نوع پرداخت*****/
  $pardakhtGrArr = array (
  0 =>'انتخاب کنید',
  1 =>'بابت تحویل جاری کالا',
  2 =>'بابت مابه التفاوت تحویلی'
  );
  /*****وضعیت قرارداد*****/
  $typeGrArr = array (
  0 =>'انتخاب کنید',
  1 =>'جاری',
  2 =>'کامل شده',
  3 =>'عدم ایفای تعهدات از طرف فروشنده',
  4 =>'فسخ قرارداد از طرف خریدار',
  5 =>'تاریخ قرارداد منقضی شده',
  );
  /*****نوع کالا*****/
  $kalatypeArr = array (
  //0 =>'انتخاب کنيد',
  1 =>'علوفه ایی',
  2 => 'گوشتی'
  );
  /*****نوع انبار*****/
  $locationtypeArr = array (
  //0 =>'انتخاب کنيد',
  1 =>'انبار',
  2 =>'سردخانه'
  );
  /*****وضعیت سردخانه*****/
  $situationtypeArr = array (
  //0 =>'انتخاب کنيد',
  1 =>'حقیقی',
  2 =>'مجازی'
  );
  /*****وضعیت اتصال به سیستم توزین*****/
  $connect_tozinArr = array(
    0 => 'غیرمتصل',
    1 => 'متصل فعال',
    2 => 'متصل غیرفعال'
  );
  /*****وضعیت نمایش اطلاعات سردخانه های موقت در گزارش*****/
  $showMovaghatArr = array (
  //0 =>'انتخاب کنيد',
  1 =>'بدون اطلاعات سردخانه موقت',
  2 =>'همراه با اطلاعات سردخانه موقت',
  3 =>'فقط اطلاعات سردخانه موقت'
  );
 /*****نوع تحویل بار در فرم رسید*****/
  $tahvilbarArr = array (
  0 =>'انتخاب کنيد',
  1 =>'تخلیه در سردخانه',
  2 =>'تحویل روباری',
  3 =>'حمل با راه آهن',
  4 =>'جابه جایی بین مناطق تخلیه در سردخانه',
  5 =>'جابه جایی بین مناطق تحویل روباری',
  //6 =>'برگشت از فروش',
  //7 =>'تخلیه در سردخانه کالای امانی',
  7 =>'جابه جایی بخش خصوصی',
  8 =>'امانی بخش خصوصی',
  9 =>'تحت کلید گمرک'
  );
  /*****نوع تحویل بار در فرم رسید برای موقت ها*****/
  $tahvilbarArrMovaghat = array (
  0 =>'انتخاب کنيد',
  4 =>'جابه جایی بین مناطق تخلیه در سردخانه',
  5 =>'جابه جایی بین مناطق تحویل روباری'
  );
  /*****نوع تحویل بار در فرم حواله*****/
  $tahvilbarArr_h = array (
  0 =>'انتخاب کنيد',
  1 =>'بارگیری از سردخانه',
  2 =>'تحویل روباری',
  3 =>'حمل با راه آهن',
  4 =>'جابه جایی بین مناطق',
  5 =>'جابه جایی کالای امانی',
  6 =>'برگشت از خرید',
  7 =>'جابه جایی بخش خصوصی',
  9 =>'تحت کلید گمرک'
  );
  /*****نوع تحویل بار در فرم حواله برای موقت ها*****/
  $tahvilbarArr_h_Movaghat = array (
  0 =>'انتخاب کنيد',
  4 =>'جابه جایی بین مناطق'
  );
 /**** نوع مالکیت در جدول انبارها*****/
  $noe_malekiyatArr = array (
  //0 =>'انتخاب کنید',
  1 =>'ملکی',
  2 =>'استیجاری',
  3 =>'امانی',
  4 =>'مرکز خرید'
  //5 =>'تحت کلید گمرک'
  );
  /**** وضعیت پیمانکار*****/
  $status_peymankarArr= array(
  0 =>'-',
  1 =>'دارد',
  2 =>'ندارد',
  );
 /*****نوع حواله فروش در فرم حواله فروش*****/
  $noe_havale_forushArr = array (
  //0 =>'انتخاب کنید',
  1 =>'حواله فروش',
  2 =>'فی مابین مناطق',
  );
 /*****نوع فرم تعدیل*****/
  $tadilformArr = array (
  // 0 =>'انتخاب کنيد',
  1 =>'دائم',
  2 =>'موقت',
  );
 /*****نوع تعدیل در فرم تعدیل موجودی*****/
  $tadilArr = array (
  // 0 =>'انتخاب کنيد',
  1 =>'اضافه',
  2 =>'کسری',
  );
  /*****نوع کسری در فرم تعدیل موجودی*****/
  $tadilkasryArr = array (
  0 =>'انتخاب کنيد',
  1 =>'عادی',
  2 =>'امحاء',
  );
  /*****طریقه ایجاد فرم*****/
  $createformArr = array (
  0 =>'انتخاب کنيد',
  1 =>'توسط کاربر',  
  2 =>'سیستمی',
  );
  //meatdovom
  /*****نوع محموله*****/
  $noemahmuleArr = array (
  0 =>'انتخاب کنید',
  1 =>'داخلی',
  2 =>'خارجی'
  );
  /*****نوع قیمت گذاری*****/
  $noegheymatArr = array (
  0 =>'انتخاب کنید',
  1 =>'کشوری',
  2 =>'استانی'
  );
  /*****ماه شمسی*****/
  $mahshamsiArr = array (
  0 =>'انتخاب کنيد',
  1 =>'فروردین',
  2 =>'اردیبهشت',
  3 =>'خرداد',
  4 =>'تیر',
  5 =>'مرداد',
  6 =>'شهریور',
  7 =>'مهر',
  8 =>'آبان',
  9 =>'آذر',
  10 =>'دی',
  11 =>'بهمن',
  12 =>'اسفند'
  );
  /*****ماه میلادی*****/
  $mahmiladyArr = array (
  0 =>'انتخاب کنيد',
  1 =>'ژانویه',
  2 =>'فوریه',
  3 =>'مارس',
  4 =>'آوریل',
  5 =>'می',
  6 =>'ژوئن',
  7 =>'جولای',
  8 =>'آگوست',
  9 =>'سپتامبر',
  10 =>'اکتبر',
  11 =>'نوامبر',
  12 =>'دسامبر'
  );
  /*****انتخاب در کاردکس*****/
  $namayeshArr = array(
  //0 =>'انتخاب کنيد',
  1 =>'وزن خالص',
  2 =>'وزن ناخالص',
  3 =>'تعداد'
  );
 /**** نوع خرید*****/
  $noekharidArr = array (
  0 =>'انتخاب کنید',
  1 =>'داخلی',
  2 =>'خارجی'
  );
 /**** وضعیت پلمپ*****/
  $polompArr = array (
  0 =>'انتخاب کنید',
  1 =>'سالم',
  2 =>'ناسالم'
  );
 /**** وضعیت پلمپ*****/
 $pardakhtArr = array (
  0 =>'انتخاب کنید',
  1 =>'کرایه پس از رسید',
  2 =>'کرایه در مقصد'
  );
 /*****نوع مجوز جابه جایی*****/
  $mojavezjabejaeArr = array (
  0 =>'انتخاب کنيد',
  1 =>'فی مابین مناطق',
  2 =>'کالای امانی',
  3 =>'مرجوعی',
  4 =>'جایگزینی با بخش خصوصی',
  5 =>'آزاد سازی تحت کلید'
  );
  /*****نوع مجوز جابه جایی*****/
  $mojavezjabejaeArrMovaghat = array (
  0 =>'انتخاب کنيد',
  1 =>'فی مابین مناطق'
  );
  /*****شمارش*****/
  $shomareshArr = array (
  0 =>'انتخاب کنيد',
  1 =>'اول',
  2 =>'دوم',
  3 =>'نهایی'
  );
 /*****وضعیت خرید*****/
  $kharidTypeArr = array (
  // 0 =>'انتخاب کنيد',
  1 =>'ادامه دار',
  2 =>'اتمام',
  );
 /*****وضعیت قرارداد*****/
  $gharardadTypeArr = array (
  0 =>'انتخاب کنيد',
  1 =>'جاری',
  2 =>'بسته شده',
  );
  /*****نوع خط*****/
  $noeKhatArr = array (
  0 =>'انتخاب کنيد',
  1 =>'خط 1',
  2 =>'خط 2 (تمام اتوماتیک) ',
  3 =>'هردو '
  );
  /*****نوع چیدمان*****/
  $noechidemanArr = array (
  0 =>'انتخاب کنيد',
  1 =>'باکس پالت',
  2 =>'پالت',
  3 =>'هردو '
  );
  
  $namayesh_infoArr = array (
  0 =>'انتخاب کنيد',
  1 =>'سایر',
  2 =>'تحت کلید گمرک'
  );

//******************   php Functions    ********************
 function right($access_element)
 {
  global $db,$AccActiveYear,$g_not_operate,$axarr;
  if (SuperUser()) return True;
  //if (!$mtActiveYear) return False;
  //if ($g_not_operate) if (strstr($axarr[$access_element][1],'*')) return False;
  $q="SELECT count(*) FROM role_access WHERE role_id=(SELECT role_id FROM users WHERE user_id='".$_SESSION['mt_user_id']."')and access_element='$access_element'";
  $result=$db->query($q);
  $row = $db->fetch_row($result);
  IF (($row[0])AND($_SESSION['mt_first_login']==0))  return True;
  ELSE        return False;
 }
 /**************************Combo Box Function****************************/
function listboxMe($field__,$default__,$code__,$name__,$table__,$where__,$event__,$flag__)
 { global $db;
   if (!empty($where__)) $where__="where ".$where__;
   $q__ = "select {$code__}, {$name__} from {$table__} {$where__}";
   if ($flag__) echo $q__."<br>";
   $ret__ = $db->query( $q__) or die("populating listbox" );
   $retstr__="<select name=$field__ $event__>\n";
   //$retstr__.="  <option value=\"\">انتخاب کنيد</option>";
   while( $row = $db->fetch_array($ret__) )
   {$selected = ( trim($row[0]) == trim($default__) )?"selected":"";
    $retstr__.=" <option value=\"".($row[0])."\" $selected><b>".($row[1])."</b></option>\n";
   }
   $retstr__.="</select>\n";
   return ($retstr__);
 }
function listbox($field__,$default__,$code__,$name__,$table__,$where__,$event__,$flag__)
 { global $db;
   if (!empty($where__)) $where__="where ".$where__;
   $q__ = "select {$code__}, {$name__} from {$table__} {$where__}";
   if ($flag__) echo $q__."<br>";
   $ret__ = $db->query( $q__) or die("populating listbox" );
   $retstr__="<select name=$field__ $event__>\n";
   $retstr__.="  <option value=\"0\">انتخاب کنيد</option>";
   while( $row = $db->fetch_array($ret__) )
   {$selected = ( trim($row[0]) == trim($default__) )?"selected":"";
    $retstr__.=" <option value=\"".($row[0])."\" $selected><b>".($row[1])."</b></option>\n";
   }
   $retstr__.="</select>\n";
   return ($retstr__);
 }
 function listbox_ostan($field__,$default__,$code__,$name__,$table__,$where__,$event__,$flag__)
 { global $db;
   if (!empty($where__)) $where__="where ".$where__;
   $q__ = "select {$code__}, {$name__} from {$table__} {$where__}";
   if ($flag__) echo $q__."<br>";
   $ret__ = $db->query( $q__) or die("populating listbox" );
   $retstr__="<select name=$field__ $event__>\n";
   $retstr__.="  <option value=\"-1\">همه استانها</option>";
   while( $row = $db->fetch_array($ret__) )
   {$selected = ( trim($row[0]) == trim($default__) )?"selected":"";
    $retstr__.=" <option value=\"".($row[0])."\" $selected><b>".($row[1])."</b></option>\n";
   }
   $retstr__.="</select>\n";
   return ($retstr__);
 }

 function listbox_anbar($field__,$default__,$code__,$name__,$table__,$where__,$event__,$flag__)
 { global $db;
   if (!empty($where__)) $where__="where ".$where__;
   $q__ = "select {$code__}, {$name__} from {$table__} {$where__}";
   if ($flag__) echo $q__."<br>";
   $ret__ = $db->query( $q__) or die("populating listbox" );
   $retstr__="<select name=$field__ $event__>\n";
   $retstr__.="  <option value=\"-1\">همه سردخانه ها</option>";
   while( $row = $db->fetch_array($ret__) )
   {$selected = ( trim($row[0]) == trim($default__) )?"selected":"";
    $retstr__.=" <option value=\"".($row[0])."\" $selected><b>".($row[1])."</b></option>\n";
   }
   $retstr__.="</select>\n";
   return ($retstr__);
 }
 function listbox_ziranbar($field__,$default__,$code__,$name__,$table__,$where__,$event__,$flag__)
 { global $db;
   if (!empty($where__)) $where__="where ".$where__;
   $q__ = "select {$code__}, {$name__} from {$table__} {$where__}";
   if ($flag__) echo $q__."<br>";
   $ret__ = $db->query( $q__) or die("populating listbox" );
   $retstr__="<select name=$field__ $event__>\n";
   $retstr__.="  <option value=\"0\">همه زیرانبارها</option>";
   while( $row = $db->fetch_array($ret__) )
   {$selected = ( trim($row[0]) == trim($default__) )?"selected":"";
    $retstr__.=" <option value=\"".($row[0])."\" $selected><b>".($row[1])."</b></option>\n";
   }
   $retstr__.="</select>\n";
   return ($retstr__);
 }

function static_listbox($field__,$default__,$options__,$optype__,$event__)
 {
   $retstr__="<select name=$field__ $event__>\n";
   if (!$optype__)
   { $token = strtok ($options__, ",");
     while( $token )
     {$pos = strpos($token, ";");
      if ($pos === false)
      {$tok_value = $token;
       $tok_title = $token;
      }
      else
      {$tok_value = substr($token, 0, $pos);
       $tok_title = substr($token, $pos + 1);
      }
      if ($tok_value == $default__) $selected="selected"; else $selected="";
      $retstr__.=" <option value='$tok_value' $selected>$tok_title</option>\n";
      $token = strtok (",");
     }
   }
   else
   {global ${$options__};
    foreach (${$options__} as $tok_value =>$tok_title)
    {$selected="";
     if ($tok_value == $default__) $selected="selected";
     $retstr__.=" <option value=$tok_value $selected>$tok_title</option>\n";
    }
   }
   $retstr__.="</select>\n";
   return ($retstr__);
 }
 function newvirgul($numberr__,$seperator__)
{//اعداد را سه رقم سه رقم با ويرگول جدا ميکند
 $decpos=strpos($numberr__,'.');
 $number__=$numberr__;
 if ($decpos)
 {$numberr__=round($numberr__,$dec__);
  $number__=substr($numberr__,0,$decpos);
  $decval__=substr($numberr__,$decpos+1);
 }
 if (!$seperator__) $seperator__=",";
 $i__=strlen($number__);
 while ($i__>3)
 {$i__=$i__-3;$number__=substr_replace($number__,$seperator__,$i__,0);}
 if ($dec__ and $decval__) $number__.='.'.$decval__;
 return $number__;
}

function virgul($number__,$decimal,$seperator__)
{//اعداد را سه رقم سه رقم با ويرگول جدا ميکند
 if (!$seperator__) {$seperator__=","; return number_format($number__,$decimal);}
 $i__=strlen($number__);
 while ($i__>3)
 {$i__=$i__-3;$number__=substr_replace($number__,$seperator__,$i__,0);}
 return $number__;
}

function virgul_dovom($number__,$seperator__)
{//اعداد را سه رقم سه رقم با ويرگول جدا ميکند
 if (!$seperator__) {$seperator__=","; return number_format($number__);}
 $i__=strlen($number__);
 while ($i__>3)
 {$i__=$i__-3;$number__=substr_replace($number__,$seperator__,$i__,0);}
 return $number__;
}

$fdow_=Array(
  0 =>'يكشنبه',
  1 =>'دوشنبه',
  2 =>'سه شنبه',
  3  =>'چهارشنبه',
  4 =>'پنج شنبه',
  5 =>'جمعه',
  6 =>'شنبه'
);

 /*          بيان يک عدد با يک عبارت فارسي        */
 /* Convert an integer number to Farsi expression */
 /* Maximum number length = 15 digits             */
 /* By Nasrollah Mohammadi                        */
Function sayfnum($A_Number)
 { $A_Number=number_format($A_Number,0,'','');
   //echo $A_Number;
   $ones = Array
   ( 1=>  ' ',
     2=>  ' يك ',
     3=>  ' دو ',
     4=>  ' سه ',
     5=>  ' چهار ',
     6=>  ' پنج ',
     7=>  ' شش ',
     8=>  ' هفت ',
     9=>  ' هشت ',
     10=> ' نه '
   );
   $teens = Array
   ( 1=>  ' ده ',
     2=>  ' يازده ',
     3=>  ' دوازده ',
     4=>  ' سيزده ',
     5=>  ' چهارده ',
     6=>  ' پانزده ',
     7=>  ' شانزده ',
     8=>  ' هفده ',
     9=>  ' هجده ',
     10=> ' نوزده '
   );
   $tens = Array
   ( 1=>  ' ',
     2=>  ' ده ',
     3=>  ' بيست ',
     4=>  ' سي ',
     5=>  ' چهل ',
     6=>  ' پنجاه ',
     7=>  ' شصت ',
     8=>  ' هفتاد ',
     9=>  ' هشتاد ',
     10=> ' نود '
   );
   $hundreds = Array
   ( 1=>  ' ',
     2=>  ' يكصد ',
     3=>  ' دويست ',
     4=>  ' سيصد ',
     5=>  ' چهارصد ',
     6=>  ' پانصد ',
     7=>  ' ششصد ',
     8=>  ' هفتصد ',
     9=>  ' هشتصد ',
     10=> ' نهصد '
   );
   for($xx =strlen($A_Number); $xx <= 15; $xx++) $A_Number=' '.$A_Number;
   $NumString='';
   $xx=1;
   while ($xx<15)
   { $token=substr($A_Number,$xx,1); //hundreds position
     $c=$token;
     if (intval($token))
     { $NumString.=$hundreds[$token+1];
       if (intval(Substr($A_Number,$xx+1,2))) $NumString.=' و ';
     }
     $xx=$xx+1;
     $token=substr($A_Number,$xx,1); //tnes position
     $c.=$token;
     if ($token!=' ')
       if ($token=='1')
       { $xx=$xx+1;
         $token=substr($A_Number,$xx,1); //ones position
         $c.=$token;
         $NumString.=$teens[$token+1];
       }
       else
       { if ($token!='0')
         { $NumString.=$tens[$token+1];
           if (intval(Substr($A_Number,$xx+1,1))) $NumString.=' و ';
         }
         $xx=$xx+1;
         $token=substr($A_Number,$xx,1); //ones position
         $c.=$token;
         if (intval($token)) $NumString.=$ones[$token+1];
       }
     else
     { $xx=$xx+1;
       $token=substr($A_Number,$xx,1); //ones position
       $c.=$token;
       if (intval($token)) {$NumString.=$ones[$token+1];}
     }
     /* Three digits investigated */
     switch ($xx)
     {
      case 3:
         if (intval($c)) $NumString.=' ترليون ';
         break;
      case 6:
         if (intval($c)) $NumString.=' ميليارد ';
         break;
      case 9:
         if (intval($c)) $NumString.=' ميليون ';
         break;
      case 12:
         if (intval($c)) $NumString.=' هزار ';
         break;
     }
     if (intval(substr($A_Number,$xx+1,3)))  $NumString.=' و ';
     $xx=$xx+1;
   }
   if (Substr($NumString,0,3)==' و ') $NumString=Substr($NumString,4);
   return $NumString;
 }

$g_days_in_month = array(31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31);
$j_days_in_month = array(31, 31, 31, 31, 31, 31, 30, 30, 30, 30, 30, 29);
$j_days_name =  array("","يکم","دوم","سوم","چهارم","پنجم","ششم","هفتم","هشتم","نهم","دهم",
                      "يازدهم","دوازدهم","سيزدهم","چهاردهم","پانزدهم","شانزدهم","هفدهم","هجدهم","نوزدهم","بيستم",
                      "بيست ويکم","بيست و دوم","بيست و سوم","بيست و چهارم","بيست و پنجم","بيست و ششم","بيست و هفتم","بيست و هشتم","بيست و نهم","سي ام","سي و يکم");

$j_month_name = array("", "فروردين", "ارديبهشت", "خرداد", "تير",
                      "مرداد", "شهريور", "مهر", "آبان", "آذر",
                      "دي", "بهمن", "اسفند");
$g_month_name = array("", "January", "February", "March", "April",
                      "May", "June", "July", "August", "September",
                      "October", "November", "December");
function div($a, $b)
{
   return (int) ($a / $b);
}

  function gregorian_to_jalali($g_y, $g_m, $g_d)
 {
   global $g_days_in_month;
   global $j_days_in_month;

   $gy = $g_y-1600;
   $gm = $g_m-1;
   $gd = $g_d-1;

   $g_day_no = 365*$gy+div($gy+3,4)-div($gy+99,100)+div($gy+399,400);

   for ($i=0; $i < $gm; ++$i)
      $g_day_no += $g_days_in_month[$i];
   if ($gm>1 && (($gy%4==0 && $gy%100!=0) || ($gy%400==0)))
      /* leap and after Feb */
      ++$g_day_no;
   $g_day_no += $gd;

   $j_day_no = $g_day_no-79;

   $j_np = div($j_day_no, 12053);
   $j_day_no %= 12053;

   $jy = 979+33*$j_np+4*div($j_day_no,1461);

   $j_day_no %= 1461;

   if ($j_day_no >= 366) {
      $jy += div($j_day_no-1, 365);
      $j_day_no = ($j_day_no-1)%365;
   }

   for ($i = 0; $i < 11 && $j_day_no >= $j_days_in_month[$i]; ++$i) {
      $j_day_no -= $j_days_in_month[$i];
   }
   $jm = $i+1;
   $jd = $j_day_no+1;

   if(strlen($jm)==1)
     $jm='0'.$jm;
   if(strlen($jd)==1)
     $jd='0'.$jd;
   return array($jy, $jm, $jd);
}
//از اینترنت
function jalali_to_gregorian($j_y,$j_m,$j_d,$mod=''){
 $d_4=($j_y+1)%4;
 $doy_j=($j_m<7)?(($j_m-1)*31)+$j_d:(($j_m-7)*30)+$j_d+186;
 $d_33=(int)((($j_y-55)%132)*.0305);
 $a=($d_33!=3 and $d_4<=$d_33)?287:286;
 $b=(($d_33==1 or $d_33==2) and ($d_33==$d_4 or $d_4==1))?78:(($d_33==3 and $d_4==0)?80:79);
 if((int)(($j_y-19)/63)==20){$a--;$b++;}
 if($doy_j<=$a){
  $gy=$j_y+621; $gd=$doy_j+$b;
 }else{
  $gy=$j_y+622; $gd=$doy_j-$a;
 }
 foreach(array(0,31,($gy%4==0)?29:28,31,30,31,30,31,31,30,31,30,31) as $gm=>$v){
  if($gd<=$v)break;
  $gd-=$v;
 }
   if(strlen($gm)==1)
     $gm='0'.$gm;
   if(strlen($gd)==1)
     $gd='0'.$gd;
 return($mod=='')?array($gy,$gm,$gd):$gy.$mod.$gm.$mod.$gd;
}
function checkdatejalali($date)//صحت تاریخ شمسی
{
    // Snippets.ir
    $ndate  = explode('/', $date);
    if(count($ndate) == 3)
	{
     if(strlen($ndate[0]) == 4)
	 {
      if((strlen($ndate[1]) == 2) && $ndate[1] >= 1 && $ndate[1] <= 12)
	  {
       if((strlen($ndate[2]) == 2) && $ndate[2] >= 1 && $ndate[2] <= 31)
	   {
	    return true;
       }
       else return false;
       }
       else return false;
      }
      else return false;
    }
    else return false;
}
function farsinum($str)
{
  if (strlen($str) == 1)
      $str = "0".$str;
  $out = "";
  for ($i = 0; $i < strlen($str); ++$i) {
    $c = substr($str, $i, 1);
    $out .= pack("C*", 0xDB, 0xB0 + $c);
  }
  return $out;
}
function date__format($datestamp)
{
  $tzoffset = 0;
  list($date,$time) = explode(" ",$datestamp);
  list($year,$month,$day) = explode("-",$date);
  list($hour,$minute,$second) = explode(":",$time);
  $hour = $hour + $tzoffset;

  list($jyear, $jmonth, $jday) = gregorian_to_jalali($year,$month,$day);

  $sDate = farsinum($jyear - 1300)."/". farsinum($jmonth)."/". farsinum($jday)
           ."&nbsp;&nbsp;". farsinum($hour).":". farsinum($minute);

  return "<span lang='fa' dir='rtl'>" . $sDate . "</span>";
}
function revdate($d1)
{  if (strlen($d1)<6) return $d1;
   else
   {$d2= str_pad($d1,6," ",STR_PAD_LEFT);
    $d = substr($d2,4,2)."/".substr($d2,2,2)."/".substr($d2,0,2);
    return $d;
   }
}
function AsDate($d1)
{ if (!$d1) $d=$d1;
  else
  {
   $d = substr($d1,0,2)."/".substr($d1,2,2)."/".substr($d1,4,2);
   return $d;
  }
}
function AsLDate($d1)
{ if (!$d1) $d=$d1;
  else
  {
   $d = substr($d1,0,4)."/".substr($d1,4,2)."/".substr($d1,6,2);
   return $d;
  }
}
function AsTime($t1)
{
  $t = substr($t1,0,2).":".substr($t1,2,2);
  return $t;
}
function number_format_clean($number,$precision=0,$dec_point='.',$thousands_sep=',')
{
    RETURN trim(number_format($number,$precision,$dec_point,$thousands_sep),'0'.$dec_point);
}
/*************************توابع*********************************/
//this subroutine calc diff between to date
function calculate_date_diff($fromdate , $todate)
{
  $yearend= substr($todate,0,4) ;
  $yearstart =substr($fromdate,0,4);
  $monthend = substr($todate,5,2) ;
  $monthstart =substr($fromdate,5,2) ;
  $dayend =substr($todate,8,2);
  $daystart =substr($fromdate,8,2);
  $diffyear=0 ;
  $diffmonth=0 ;
  $diffday = 0;
  if ($daystart <= $dayend )
        $diffday = $dayend - $daystart ;
  else
  {
      if ($monthstart<=6 )
	           $diffday = 31 +$dayend - $daystart ;
	  else
	     if ($monthstart<=11 )
		      $diffday = 30 +$dayend - $daystart ;
		 else
		    if ($monthstart==12 )
   			   if (($yearstart % 33==1) ||  ($yearstart % 33==5) ||  ($yearstart % 33==9) ||  ($yearstart % 33==13) ||  ($yearstart % 33==17) ||  ($yearstart % 33==22) ||  ($yearstart % 33==26) ||  ($yearstart % 33==30))
	         	     $diffday = 30 +$dayend - $daystart ;
				else
				   $diffday = 29 +$dayend - $daystart ;
	 $monthend = $monthend -1 ;
	 }
   if ($monthstart <= $monthend)
        $diffmonth = $monthend - $monthstart    ;
   else
     {
	    $diffmonth = $monthend - $monthstart +12 ;
		$yearend = $yearend-1 ;
	}
	$diffyear = $yearend - $yearstart ;
	$diffText='';
    if ($diffyear!=0) $diffText.=$diffyear.'سال';
	if ($diffmonth!=0) $diffText.=$diffmonth.'ماه ';
	if ($diffday!=0) $diffText.=$diffday.'روز';
	return $diffText ;
	//return $diffyear.'سال'.$diffmonth.'ماه'.$diffday.'روز' ;
}

//بدست آوردن نام مشتری
function customer($c_customer)
{
  if($_SESSION['mt_systemforush']==0)$q_moshtary="SELECT name_customer FROM meat.moshtary WHERE code_customer=".$row_jabejae['code_customer']."";
  else $q_moshtary="SELECT name_customer FROM sell.dm_customer_asli WHERE code_customer=".$c_customer."";
  $res_moshtary=mysql_query($q_moshtary);
  $row_moshtary=mysql_fetch_array($res_moshtary);
  $name_customer=$row_moshtary['name_customer'];
  return $name_customer;
}
//توابع محاسبه موجودی فعلی براساس گروه کالا
//موجودی تعداد براساس گروه کالا
function mojodyGroupKarton($c_ostan='',$c_anbar='',$sal,$c_gr_kala)
{
  $Condition='';
  if($c_ostan) $Condition.=" AND code_ostan='$c_ostan'";
  if(($c_ostan)and($c_anbar)) $Condition.=" AND code_anbar='$c_anbar'";
  $q="SELECT SUM(tedad_karton_aval) FROM mojody_kala INNER JOIN kala ON mojody_kala.code_kala=kala.code_kala WHERE year=$sal AND code_group_kala_top='$c_gr_kala' AND deleted=0 $Condition";
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $tedadKartonGrAval=$row[0];
  $q_varede="SELECT SUM(tedad_karton_r_d_sub) FROM resid_kala_detail INNER JOIN kala ON resid_kala_detail.code_kala=kala.code_kala WHERE year=$sal AND code_group_kala_top='$c_gr_kala' AND resid_deleted=0 AND status=0 $Condition";
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameKartonVarede=$row_varede[0];
  $q_sadere="SELECT SUM(tedad_karton_h_d) FROM havale_detail INNER JOIN kala ON havale_detail.code_kala=kala.code_kala WHERE year=$sal AND code_group_kala_top='$c_gr_kala' AND havale_deleted=0 AND status=0 $Condition";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameKartonSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(tedad_karton_tadil) FROM tadil_mojody INNER JOIN kala ON tadil_mojody.code_kala=kala.code_kala WHERE noe_tadil=1 AND year=$sal AND code_group_kala_top='$c_gr_kala' AND status=0 AND deleted=0 $Condition";
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $kartonTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(tedad_karton_tadil) FROM tadil_mojody INNER JOIN kala ON tadil_mojody.code_kala=kala.code_kala WHERE noe_tadil=2 AND year=$sal AND code_group_kala_top='$c_gr_kala' AND status=0 AND deleted=0 $Condition";
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $kartonTadilKasry=$row_tadil_kasry[0];
  $tedadKartonGr=$tedadKartonGrAval+$jameKartonVarede-$jameKartonSadere+$kartonTadilEzafe-$kartonTadilKasry;
  return $tedadKartonGr;
}
//موجودی وزن ناخالص براساس گروه کالا
function mojodyGroupNakhales($c_ostan='',$c_anbar='',$sal,$c_gr_kala)
{
  $Condition='';
  if($c_ostan) $Condition.=" AND code_ostan='$c_ostan'";
  if(($c_ostan)and($c_anbar)) $Condition.=" AND code_anbar='$c_anbar'";
  $q="SELECT SUM(mojody_nakhales_aval) FROM mojody_kala INNER JOIN kala ON mojody_kala.code_kala=kala.code_kala WHERE year=$sal AND code_group_kala_top='$c_gr_kala' AND deleted=0 $Condition";
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $mojodyNakhalesGrAval=$row[0];
  $q_varede="SELECT SUM(vazn_nakhales_r_d_sub) FROM resid_kala_detail INNER JOIN kala ON resid_kala_detail.code_kala=kala.code_kala WHERE year=$sal AND code_group_kala_top='$c_gr_kala' AND resid_deleted=0 AND status=0 $Condition";
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameNaKhalesVarede=$row_varede[0];
  $q_sadere="SELECT SUM(vazn_nakhales_h_d) FROM havale_detail INNER JOIN kala ON havale_detail.code_kala=kala.code_kala WHERE year=$sal AND code_group_kala_top='$c_gr_kala' AND havale_deleted=0 AND status=0 $Condition";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameNaKhalesSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(meghdar_nakhales_tadil) FROM tadil_mojody INNER JOIN kala ON tadil_mojody.code_kala=kala.code_kala WHERE noe_tadil=1 AND year=$sal AND code_group_kala_top='$c_gr_kala' AND status=0 AND deleted=0 $Condition";
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $nakhalesTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(meghdar_nakhales_tadil) FROM tadil_mojody INNER JOIN kala ON tadil_mojody.code_kala=kala.code_kala WHERE noe_tadil=2 AND year=$sal AND code_group_kala_top='$c_gr_kala' AND status=0 AND deleted=0 $Condition";
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $nakhalesTadilKasry=$row_tadil_kasry[0];
  $nakhalesGr=$mojodyNakhalesGrAval+$jameNaKhalesVarede-$jameNaKhalesSadere+$nakhalesTadilEzafe-$nakhalesTadilKasry;
  return round($nakhalesGr,3);
}
//موجودی وزن خالص براساس گروه کالا
function mojodyGroupKhales($c_ostan='',$c_anbar='',$sal,$c_gr_kala)
{
  $Condition='';
  if($c_ostan) $Condition.=" AND code_ostan='$c_ostan'";
  if(($c_ostan)and($c_anbar)) $Condition.=" AND code_anbar='$c_anbar'";
  $q="SELECT SUM(mojody_khales_aval) FROM mojody_kala INNER JOIN kala ON mojody_kala.code_kala=kala.code_kala WHERE year=$sal AND code_group_kala_top='$c_gr_kala' AND deleted=0 $Condition";
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $mojodyKhalesGrAval=$row[0];
  $q_varede="SELECT SUM(vazn_khales_r_d_sub) FROM resid_kala_detail INNER JOIN kala ON resid_kala_detail.code_kala=kala.code_kala WHERE year=$sal AND code_group_kala_top='$c_gr_kala' AND resid_deleted=0 AND status=0 $Condition";
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameKhalesVadere=$row_varede[0];
  $q_sadere="SELECT SUM(vazn_khales_h_d) FROM havale_detail INNER JOIN kala ON havale_detail.code_kala=kala.code_kala WHERE year=$sal AND code_group_kala_top='$c_gr_kala' AND havale_deleted=0 AND status=0 $Condition";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameKhalesSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(meghdar_khales_tadil) FROM tadil_mojody INNER JOIN kala ON tadil_mojody.code_kala=kala.code_kala WHERE noe_tadil=1 AND year=$sal AND code_group_kala_top='$c_gr_kala' AND status=0 AND deleted=0 $Condition";
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $khalesTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(meghdar_khales_tadil) FROM tadil_mojody INNER JOIN kala ON tadil_mojody.code_kala=kala.code_kala WHERE noe_tadil=2 AND year=$sal AND code_group_kala_top='$c_gr_kala' AND status=0 AND deleted=0 $Condition";
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $khalesTadilKasry=$row_tadil_kasry[0];
  $khalesGr=$mojodyKhalesGrAval+$jameKhalesVadere-$jameKhalesSadere+$khalesTadilEzafe-$khalesTadilKasry;
  return round($khalesGr,3);
}
//موجودی کارتن
function mojodyKarton($c_ostan,$c_anbar,$sal,$c_ziranbar,$c_kala,$c_keshvar,$c_tolidkonande,$sal_tolid,$mah_tolid,$rouz_tolid,$c_karton,$c_mandegari,$noe_ziranbar='')
{
  $detailkartonCondition='';
  if($c_ziranbar) $detailkartonCondition.=" AND code_ziranbar='$c_ziranbar'";
  if($c_keshvar) $detailkartonCondition.=" AND code_keshvar='$c_keshvar'";
  if($c_tolidkonande) $detailkartonCondition.=" AND code_tolidkonande='$c_tolidkonande'";
  if($sal_tolid) $detailkartonCondition.=" AND sal_tolid_shamsi='$sal_tolid'";
  if($mah_tolid) $detailkartonCondition.=" AND mah_tolid_shamsi='$mah_tolid'";
  if($rouz_tolid) $detailkartonCondition.=" AND rouz_tolid_shamsi='$rouz_tolid'";
  if($c_karton) $detailkartonCondition.=" AND code_karton='$c_karton'";
  if($c_mandegari) $detailkartonCondition.=" AND code_mandegari='$c_mandegari'";
  IF($noe_ziranbar==2) $table_mojody='mojody_kala_gomrok';//تحت کلید گمرک
  ELSE $table_mojody='mojody_kala';
  $q="SELECT SUM(tedad_karton_aval) FROM $table_mojody WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkartonCondition AND deleted=0";
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $tedadKartonAval=$row[0];
  $q_varede="SELECT SUM(tedad_karton_r_d_sub) FROM resid_kala_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkartonCondition AND resid_deleted=0 AND status=0";
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameKartonVarede=$row_varede[0];
  $q_sadere="SELECT SUM(tedad_karton_h_d) FROM havale_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkartonCondition AND havale_deleted=0 AND status=0";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameKartonSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(tedad_karton_tadil) FROM tadil_mojody WHERE noe_tadil=1 AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkartonCondition AND status=0 AND deleted=0";
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $kartonTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(tedad_karton_tadil) FROM tadil_mojody WHERE noe_tadil=2 AND code_ostan=$c_ostan AND code_anbar=$c_anbar  AND year=$sal AND code_kala='$c_kala'  $detailkartonCondition AND status=0 AND deleted=0";
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $kartonTadilKasry=$row_tadil_kasry[0];
  $tedadKarton=$tedadKartonAval+$jameKartonVarede-$jameKartonSadere+$kartonTadilEzafe-$kartonTadilKasry;
  return $tedadKarton;
}
//موجودی ناخالص
function mojodyNakhales($c_ostan,$c_anbar,$sal,$c_ziranbar,$c_kala,$c_keshvar,$c_tolidkonande,$sal_tolid,$mah_tolid,$rouz_tolid,$c_karton,$c_mandegari,$noe_ziranbar='')
{
  $detailnakhalesCondition='';
  if($c_ziranbar) $detailnakhalesCondition.=" AND code_ziranbar='$c_ziranbar'";
  if($c_keshvar) $detailnakhalesCondition.=" AND code_keshvar='$c_keshvar'";
  if($c_tolidkonande) $detailnakhalesCondition.=" AND code_tolidkonande='$c_tolidkonande'";
  if($sal_tolid) $detailnakhalesCondition.=" AND sal_tolid_shamsi='$sal_tolid'";
  if($mah_tolid) $detailnakhalesCondition.=" AND mah_tolid_shamsi='$mah_tolid'";
  if($rouz_tolid) $detailnakhalesCondition.=" AND rouz_tolid_shamsi='$rouz_tolid'";
  if($c_karton) $detailnakhalesCondition.=" AND code_karton='$c_karton'";
  if($c_mandegari) $detailnakhalesCondition.=" AND code_mandegari='$c_mandegari'";
  IF($noe_ziranbar==2) $table_mojody='mojody_kala_gomrok';//تحت کلید گمرک
  ELSE $table_mojody='mojody_kala';
  $q="SELECT SUM(mojody_nakhales_aval) FROM $table_mojody WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailnakhalesCondition AND deleted=0";
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $mojodyNakhalesAval=$row[0];
  $q_varede="SELECT SUM(vazn_nakhales_r_d_sub) FROM resid_kala_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailnakhalesCondition AND resid_deleted=0 AND status=0";
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameNaKhalesVarede=$row_varede[0];
  $q_sadere="SELECT SUM(vazn_nakhales_h_d) FROM havale_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailnakhalesCondition AND havale_deleted=0 AND status=0";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameNaKhalesSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(meghdar_nakhales_tadil) FROM tadil_mojody WHERE noe_tadil=1 AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailnakhalesCondition AND status=0 AND deleted=0";
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $nakhalesTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(meghdar_nakhales_tadil) FROM tadil_mojody WHERE noe_tadil=2 AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailnakhalesCondition AND status=0 AND deleted=0";
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $nakhalesTadilKasry=$row_tadil_kasry[0];
  $nakhales=$mojodyNakhalesAval+$jameNaKhalesVarede-$jameNaKhalesSadere+$nakhalesTadilEzafe-$nakhalesTadilKasry;
  $nakhales=round($nakhales,3);
  return $nakhales;
}
//موجودی خالص
function mojodyKhales($c_ostan,$c_anbar,$sal,$c_ziranbar,$c_kala,$c_keshvar,$c_tolidkonande,$sal_tolid,$mah_tolid,$rouz_tolid,$c_karton,$c_mandegari,$noe_ziranbar='')
{
  $detailkhalesCondition='';
  if($c_ziranbar) $detailkhalesCondition.=" AND code_ziranbar='$c_ziranbar'";
  if($c_keshvar) $detailkhalesCondition.=" AND code_keshvar='$c_keshvar'";
  if($c_tolidkonande) $detailkhalesCondition.=" AND code_tolidkonande='$c_tolidkonande'";
  if($sal_tolid) $detailkhalesCondition.=" AND sal_tolid_shamsi='$sal_tolid'";
  if($mah_tolid) $detailkhalesCondition.=" AND mah_tolid_shamsi='$mah_tolid'";
  if($rouz_tolid) $detailkhalesCondition.=" AND rouz_tolid_shamsi='$rouz_tolid'";
  if($c_karton) $detailkhalesCondition.=" AND code_karton='$c_karton'";
  if($c_mandegari) $detailkhalesCondition.=" AND code_mandegari='$c_mandegari'";
  IF($noe_ziranbar==2) $table_mojody='mojody_kala_gomrok';//تحت کلید گمرک
  ELSE $table_mojody='mojody_kala';
  $q="SELECT SUM(mojody_khales_aval) FROM $table_mojody WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkhalesCondition AND deleted=0";
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $mojodyKhalesAval=$row[0];
  $q_varede="SELECT SUM(vazn_khales_r_d_sub) FROM resid_kala_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkhalesCondition AND resid_deleted=0 AND status=0";
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameKhalesVadere=$row_varede[0];
  $q_sadere="SELECT SUM(vazn_khales_h_d) FROM havale_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkhalesCondition  AND havale_deleted=0 AND status=0";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameKhalesSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(meghdar_khales_tadil) FROM tadil_mojody WHERE noe_tadil=1 AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkhalesCondition AND status=0 AND deleted=0";
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $khalesTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(meghdar_khales_tadil) FROM tadil_mojody WHERE noe_tadil=2 AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkhalesCondition AND status=0 AND deleted=0";
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $khalesTadilKasry=$row_tadil_kasry[0];
  $khales=$mojodyKhalesAval+$jameKhalesVadere-$jameKhalesSadere+$khalesTadilEzafe-$khalesTadilKasry;
  $khales=round($khales,3);
  return $khales;
}
//موجودی جوجه
function mojodyJoje($c_ostan,$c_anbar,$sal,$c_ziranbar,$c_kala,$c_keshvar,$c_tolidkonande,$sal_tolid,$mah_tolid,$rouz_tolid,$c_karton,$c_mandegari)
{
  $detailjojeCondition='';
  if($c_ziranbar) $detailjojeCondition.=" AND code_ziranbar='$c_ziranbar'";
  if($c_keshvar) $detailjojeCondition.=" AND code_keshvar='$c_keshvar'";
  if($c_tolidkonande) $detailjojeCondition.=" AND code_tolidkonande='$c_tolidkonande'";
  if($sal_tolid) $detailjojeCondition.=" AND sal_tolid_shamsi='$sal_tolid'";
  if($mah_tolid) $detailjojeCondition.=" AND mah_tolid_shamsi='$mah_tolid'";
  if($rouz_tolid) $detailjojeCondition.=" AND rouz_tolid_shamsi='$rouz_tolid'";
  if($c_karton) $detailjojeCondition.=" AND code_karton='$c_karton'";
  if($c_mandegari) $detailjojeCondition.=" AND code_mandegari='$c_mandegari'";
  // $q="SELECT SUM(tedad_karton_aval) FROM mojody_kala WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailjojeCondition AND deleted=0";
  // $result=mysql_query($q);
  // $row=mysql_fetch_array($result);
  // $tedadKartonAval=$row[0];
  $q_varede="SELECT SUM(tedad_joje_r_d_sub) FROM resid_kala_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailjojeCondition AND resid_deleted=0 AND status=0";
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameJojeVarede=$row_varede[0];
  $q_sadere="SELECT SUM(tedad_karton_h_d) FROM havale_detail WHERE (noe_tahvil_bar!=4 OR noe_tahvil_bar!=5) AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailjojeCondition AND havale_deleted=0 AND status=0";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameJojeSadere=$row_sadere[0];
  // $q_tadil_ezafe="SELECT SUM(tedad_joje_tadil) FROM tadil_mojody WHERE noe_tadil=1 AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailjojeCondition AND status=0 AND deleted=0";
  // $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  // $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  // $kartonTadilEzafe=$row_tadil_ezafe[0];
  // $q_tadil_kasry="SELECT SUM(tedad_joje_tadil) FROM tadil_mojody WHERE noe_tadil=2 AND code_ostan=$c_ostan AND code_anbar=$c_anbar  AND year=$sal AND code_kala='$c_kala'  $detailjojeCondition AND status=0 AND deleted=0";
  // $res_tadil_kasry=mysql_query($q_tadil_kasry);
  // $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  //$kartonTadilKasry=$row_tadil_kasry[0];
  $tedadJoje=$jameJojeVarede-$jameJojeSadere;
  return $tedadJoje;
}
//توابع محاسبه موجودی فعلی براساس کد کالا
//موجودی تعداد
function mojodyKartonAll($c_ostan='',$c_anbar='',$sal,$c_kala)
{
  $Condition='';
  if($c_ostan) $Condition.=" AND code_ostan='$c_ostan'";
  if(($c_ostan)and($c_anbar)) $Condition.=" AND code_anbar='$c_anbar'";
  $q="SELECT SUM(tedad_karton_aval) FROM mojody_kala WHERE year=$sal AND code_kala='$c_kala'  AND deleted=0 $Condition";
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $tedadKartonAval=$row[0];
  $q_varede="SELECT SUM(tedad_karton_r_d_sub) FROM resid_kala_detail WHERE year=$sal AND code_kala='$c_kala'  AND resid_deleted=0 AND status=0 $Condition";
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameKartonVarede=$row_varede[0];
  $q_sadere="SELECT SUM(tedad_karton_h_d) FROM havale_detail WHERE year=$sal AND code_kala='$c_kala'  AND havale_deleted=0 AND status=0 $Condition";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameKartonSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(tedad_karton_tadil) FROM tadil_mojody WHERE noe_tadil=1 AND year=$sal AND code_kala='$c_kala'  AND status=0 AND deleted=0 $Condition";
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $kartonTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(tedad_karton_tadil) FROM tadil_mojody WHERE noe_tadil=2 AND year=$sal AND code_kala='$c_kala'   AND status=0 AND deleted=0 $Condition";
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $kartonTadilKasry=$row_tadil_kasry[0];
  $tedadKarton=$tedadKartonAval+$jameKartonVarede-$jameKartonSadere+$kartonTadilEzafe-$kartonTadilKasry;
  return $tedadKarton;
}
//موجودی وزن ناخالص کالا
function mojodyNakhalesAll($c_ostan='',$c_anbar='',$sal,$c_kala)
{
  $Condition='';
  if($c_ostan) $Condition.=" AND code_ostan='$c_ostan'";
  if(($c_ostan)and($c_anbar)) $Condition.=" AND code_anbar='$c_anbar'";
  $q="SELECT SUM(mojody_nakhales_aval) FROM mojody_kala WHERE year=$sal AND code_kala='$c_kala' AND deleted=0 $Condition";
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $mojodyNakhalesAval=$row[0];
  $q_varede="SELECT SUM(vazn_nakhales_r_d_sub) FROM resid_kala_detail WHERE year=$sal AND code_kala='$c_kala'  AND resid_deleted=0 AND status=0 $Condition";
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameNaKhalesVarede=$row_varede[0];
  $q_sadere="SELECT SUM(vazn_nakhales_h_d) FROM havale_detail WHERE year=$sal AND code_kala='$c_kala'  AND havale_deleted=0 AND status=0 $Condition";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameNaKhalesSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(meghdar_nakhales_tadil) FROM tadil_mojody WHERE noe_tadil=1 AND year=$sal AND code_kala='$c_kala'  AND status=0 AND deleted=0 $Condition";
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $nakhalesTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(meghdar_nakhales_tadil) FROM tadil_mojody WHERE noe_tadil=2 AND year=$sal AND code_kala='$c_kala'  AND status=0 AND deleted=0 $Condition";
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $nakhalesTadilKasry=$row_tadil_kasry[0];
  $nakhales=$mojodyNakhalesAval+$jameNaKhalesVarede-$jameNaKhalesSadere+$nakhalesTadilEzafe-$nakhalesTadilKasry;
  return round($nakhales,3);
}
//موجودی وزن خالص کالا
function mojodyKhalesAll($c_ostan='',$c_anbar='',$sal,$c_kala)
{
  $Condition='';
  if($c_ostan) $Condition.=" AND code_ostan='$c_ostan'";
  if(($c_ostan)and($c_anbar)) $Condition.=" AND code_anbar='$c_anbar'";
  $q="SELECT SUM(mojody_khales_aval) FROM mojody_kala WHERE year=$sal AND code_kala='$c_kala'  AND deleted=0 $Condition";
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $mojodyKhalesAval=$row[0];
  $q_varede="SELECT SUM(vazn_khales_r_d_sub) FROM resid_kala_detail WHERE year=$sal AND code_kala='$c_kala'  AND resid_deleted=0 AND status=0 $Condition";
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameKhalesVadere=$row_varede[0];
  $q_sadere="SELECT SUM(vazn_khales_h_d) FROM havale_detail WHERE year=$sal AND code_kala='$c_kala'   AND havale_deleted=0 AND status=0 $Condition";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameKhalesSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(meghdar_khales_tadil) FROM tadil_mojody WHERE noe_tadil=1 AND year=$sal AND code_kala='$c_kala'  AND status=0 AND deleted=0 $Condition";
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $khalesTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(meghdar_khales_tadil) FROM tadil_mojody WHERE noe_tadil=2 AND year=$sal AND code_kala='$c_kala'  AND status=0 AND deleted=0 $Condition";
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $khalesTadilKasry=$row_tadil_kasry[0];
  $khales=$mojodyKhalesAval+$jameKhalesVadere-$jameKhalesSadere+$khalesTadilEzafe-$khalesTadilKasry;
  return round($khales,3);
}
//موجودی تعداد مجاز
function mojodyMojazTedad($id,$c_ostan,$c_anbar,$sal,$c_ziranbar,$c_kala,$c_keshvar,$c_tolidkonande,$sal_tolid,$mah_tolid,$rouz_tolid,$c_karton)
{     
  $detailkartonCondition='';
  if($c_ziranbar) $detailkartonCondition.=" AND code_ziranbar='$c_ziranbar'";
  if($c_keshvar) $detailkartonCondition.=" AND code_keshvar='$c_keshvar'";
  if($c_tolidkonande) $detailkartonCondition.=" AND code_tolidkonande='$c_tolidkonande'";
  if($sal_tolid) $detailkartonCondition.=" AND sal_tolid_shamsi='$sal_tolid'";
  if($mah_tolid) $detailkartonCondition.=" AND mah_tolid_shamsi='$mah_tolid'";
  if($rouz_tolid) $detailkartonCondition.=" AND rouz_tolid_shamsi='$rouz_tolid'";
  if($c_karton) $detailkartonCondition.=" AND code_karton='$c_karton'";
  $q="SELECT SUM(tedad_karton_aval) FROM meat.mojody_kala WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkartonCondition AND deleted=0";   
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $tedadKartonAval=$row[0];	
  $q_varede="SELECT SUM(tedad_karton_r_d_sub) FROM meat.resid_kala_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkartonCondition AND resid_deleted=0 AND status=0";   
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameKartonVarede=$row_varede[0]; 
  $q_sadere="SELECT SUM(tedad_karton_h_d) FROM meat.havale_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkartonCondition AND havale_deleted=0 AND status=0";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameKartonSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(tedad_karton_tadil) FROM meat.tadil_mojody WHERE noe_tadil=1 AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkartonCondition AND status=0 AND deleted=0";   
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $kartonTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(tedad_karton_tadil) FROM meat.tadil_mojody WHERE noe_tadil=2 AND code_ostan=$c_ostan AND code_anbar=$c_anbar  AND year=$sal AND code_kala='$c_kala'  $detailkartonCondition AND status=0 AND deleted=0";   
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $kartonTadilKasry=$row_tadil_kasry[0];
  $tedadKarton=$tedadKartonAval+$jameKartonVarede-$jameKartonSadere+$kartonTadilEzafe-$kartonTadilKasry;
  $q_forush_detail="SELECT SUM(dad_tedad_khanbar) FROM sell.dm_anbar_det WHERE dad_anbar_id='$id'";
  $res_forush_detail=mysql_query($q_forush_detail);
  $row_forush_detail=mysql_fetch_array($res_forush_detail);
  $jameForukhte=$row_forush_detail[0];
  $q_ebtal_detail="SELECT SUM(deh_amount) FROM sell.dm_ebtal_hdet WHERE deh_anbar_id='$id'";
  $res_ebtal_detail=mysql_query($q_ebtal_detail);
  $row_ebtal_detail=mysql_fetch_array($res_ebtal_detail);
  $jameEbtali=$row_ebtal_detail[0];
  $q_tahvily_detail="SELECT SUM(tedad_karton_h_d) FROM meat.havale_detail WHERE id_mojody='$id' AND status=0 AND dad_id!=''";
  $res_tahvily_detail=mysql_query($q_tahvily_detail);
  $row_tahvily_detail=mysql_fetch_array($res_tahvily_detail);
  $jameTahvily=$row_tahvily_detail[0];
  $mandeForush_detail=$jameForukhte-$jameEbtali-$jameTahvily;
  $tedadMojaz=$tedadKarton-$mandeForush_detail;
  return $tedadMojaz;
}
//موجودی خالص مجاز
function mojodyMojazKhales($id,$c_ostan,$c_anbar,$sal,$c_ziranbar,$c_kala,$c_keshvar,$c_tolidkonande,$sal_tolid,$mah_tolid,$rouz_tolid,$c_karton)
{     
  $detailkhalesCondition='';
  if($c_ziranbar) $detailkhalesCondition.=" AND code_ziranbar='$c_ziranbar'";
  if($c_keshvar) $detailkhalesCondition.=" AND code_keshvar='$c_keshvar'";
  if($c_tolidkonande) $detailkhalesCondition.=" AND code_tolidkonande='$c_tolidkonande'";
  if($sal_tolid) $detailkhalesCondition.=" AND sal_tolid_shamsi='$sal_tolid'";
  if($mah_tolid) $detailkhalesCondition.=" AND mah_tolid_shamsi='$mah_tolid'";
  if($rouz_tolid) $detailkhalesCondition.=" AND rouz_tolid_shamsi='$rouz_tolid'";
  if($c_karton) $detailkhalesCondition.=" AND code_karton='$c_karton'";
  $q="SELECT SUM(mojody_khales_aval) FROM meat.mojody_kala WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkhalesCondition AND deleted=0";   
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $mojodyKhalesAval=$row[0];	
  $q_varede="SELECT SUM(vazn_khales_r_d_sub) FROM meat.resid_kala_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkhalesCondition AND resid_deleted=0 AND status=0";   
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameKhalesVadere=$row_varede[0]; 
  $q_sadere="SELECT SUM(vazn_khales_h_d) FROM meat.havale_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkhalesCondition  AND havale_deleted=0 AND status=0";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameKhalesSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(meghdar_khales_tadil) FROM meat.tadil_mojody WHERE noe_tadil=1 AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkhalesCondition AND status=0 AND deleted=0";   
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $khalesTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(meghdar_khales_tadil) FROM meat.tadil_mojody WHERE noe_tadil=2 AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailkhalesCondition AND status=0 AND deleted=0";   
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $khalesTadilKasry=$row_tadil_kasry[0];
  $khales=$mojodyKhalesAval+$jameKhalesVadere-$jameKhalesSadere+$khalesTadilEzafe-$khalesTadilKasry;
  $khales=round($khales,3);
  $q_forush_detail="SELECT SUM(dad_vazn_khanbar) FROM sell.dm_anbar_det WHERE dad_anbar_id='$id'";
  $res_forush_detail=mysql_query($q_forush_detail);
  $row_forush_detail=mysql_fetch_array($res_forush_detail);
  $jameForukhte=$row_forush_detail[0];
  $q_ebtal_detail="SELECT SUM(deh_amount) FROM sell.dm_ebtal_hdet WHERE deh_anbar_id='$id'";
  $res_ebtal_detail=mysql_query($q_ebtal_detail);
  $row_ebtal_detail=mysql_fetch_array($res_ebtal_detail);
  $jameEbtali=$row_ebtal_detail[0];
  $q_tahvily_detail="SELECT SUM(vazn_khales_h_d) FROM meat.havale_detail WHERE id_mojody='$id' AND status=0 AND dad_id!=''";
  $res_tahvily_detail=mysql_query($q_tahvily_detail);
  $row_tahvily_detail=mysql_fetch_array($res_tahvily_detail);
  $jameTahvily=$row_tahvily_detail[0];
  $mandeForush_detail=$jameForukhte-$jameEbtali-$jameTahvily;
  $khalesMojaz=$khales-$mandeForush_detail;
  $khalesMojaz=round($khalesMojaz,3);
  return $khalesMojaz;
}
//موجودی شانه مجاز
function mojodyMojazShane($id,$c_ostan,$c_anbar,$sal,$c_ziranbar,$c_kala,$c_keshvar,$c_tolidkonande,$sal_tolid,$mah_tolid,$rouz_tolid,$c_karton)
{     
  $detailShaneCondition='';
  if($c_ziranbar)     $detailShaneCondition.=" AND code_ziranbar='$c_ziranbar'";
  if($c_keshvar)      $detailShaneCondition.=" AND code_keshvar='$c_keshvar'";
  if($c_tolidkonande) $detailShaneCondition.=" AND code_tolidkonande='$c_tolidkonande'";
  if($sal_tolid)      $detailShaneCondition.=" AND sal_tolid_shamsi='$sal_tolid'";
  if($mah_tolid)      $detailShaneCondition.=" AND mah_tolid_shamsi='$mah_tolid'";
  if($rouz_tolid)     $detailShaneCondition.=" AND rouz_tolid_shamsi='$rouz_tolid'";
  if($c_karton)       $detailShaneCondition.=" AND code_karton='$c_karton'";
  $q="SELECT SUM(tedad_shane_aval) FROM meat.mojody_kala WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailShaneCondition AND deleted=0";   
  $result=mysql_query($q);
  $row=mysql_fetch_array($result);
  $tedadShaneAval=$row[0];	
  $q_varede="SELECT SUM(tedad_shane_r_d_sub) FROM meat.resid_kala_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailShaneCondition AND resid_deleted=0 AND status=0";   
  $res_varede=mysql_query($q_varede);
  $row_varede=mysql_fetch_array($res_varede);
  $jameShaneVarede=$row_varede[0]; 
  $q_sadere="SELECT SUM(tedad_shane_h_d) FROM meat.havale_detail WHERE code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailShaneCondition AND havale_deleted=0 AND status=0";
  $res_sadere=mysql_query($q_sadere);
  $row_sadere=mysql_fetch_array($res_sadere);
  $jameShaneSadere=$row_sadere[0];
  $q_tadil_ezafe="SELECT SUM(tedad_shane_tadil) FROM meat.tadil_mojody WHERE noe_tadil=1 AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND code_kala='$c_kala' $detailShaneCondition AND status=0 AND deleted=0";   
  $res_tadil_ezafe=mysql_query($q_tadil_ezafe);
  $row_tadil_ezafe=mysql_fetch_array($res_tadil_ezafe);
  $ShaneTadilEzafe=$row_tadil_ezafe[0];
  $q_tadil_kasry="SELECT SUM(tedad_shane_tadil) FROM meat.tadil_mojody WHERE noe_tadil=2 AND code_ostan=$c_ostan AND code_anbar=$c_anbar  AND year=$sal AND code_kala='$c_kala'  $detailShaneCondition AND status=0 AND deleted=0";   
  $res_tadil_kasry=mysql_query($q_tadil_kasry);
  $row_tadil_kasry=mysql_fetch_array($res_tadil_kasry);
  $ShaneTadilKasry=$row_tadil_kasry[0];
  $tedadShane=$tedadShaneAval+$jameShaneVarede-$jameShaneSadere+$ShaneTadilEzafe-$ShaneTadilKasry;
  $q_forush_detail="SELECT SUM(dad_tedad_khanbar) FROM sell.dm_anbar_det WHERE dad_anbar_id='$id'";
  $res_forush_detail=mysql_query($q_forush_detail);
  $row_forush_detail=mysql_fetch_array($res_forush_detail);
  $jameForukhte=$row_forush_detail[0];
  $q_ebtal_detail="SELECT SUM(deh_amount) FROM sell.dm_ebtal_hdet WHERE deh_anbar_id='$id'";
  $res_ebtal_detail=mysql_query($q_ebtal_detail);
  $row_ebtal_detail=mysql_fetch_array($res_ebtal_detail);
  $jameEbtali=$row_ebtal_detail[0];
  $q_tahvily_detail="SELECT SUM(tedad_shane_h_d) FROM meat.havale_detail WHERE id_mojody='$id' AND status=0 AND dad_id!=''";
  $res_tahvily_detail=mysql_query($q_tahvily_detail);
  $row_tahvily_detail=mysql_fetch_array($res_tahvily_detail);
  $jameTahvily=$row_tahvily_detail[0];
  $mandeForush_detail=$jameForukhte-$jameEbtali-$jameTahvily;
  $shaneMojaz=$tedadShane-$mandeForush_detail;
  return $shaneMojaz;
}
//محاسبه مقدار فروخته شده جزئیات کالا بدون ابطال
function sold_this_id($id_mojody,$bastebandy,$c_kala)
{
 IF(($bastebandy==2)OR($c_kala==50)OR($bastebandy==6))$foruchField='dad_tedad_khanbar';
 ELSE $foruchField='dad_vazn_khanbar';
 $q="SELECT SUM($foruchField) FROM sell.dm_anbar_det WHERE dad_anbar_id=$id_mojody";
 $result=mysql_query($q);
 $row=mysql_fetch_array($result);
 $sold_this_id_without_ebtal=$row[0];
 return $sold_this_id_without_ebtal;
}
//محاسبه مقدار تحویلی جزئیات حواله فروش
function tahvily_az_forush_detail($id_mojody,$bastebandy,$c_kala)
{
 //قوطی یا دست یا عدد
 if(($bastebandy==2)OR($bastebandy==5)OR($bastebandy==6))$havaleField='tedad_karton_h_d';
 else if(($c_kala==50)OR($c_kala==54)) $havaleField='tedad_shane_h_d';
 else $havaleField='vazn_khales_h_d'; 
 $q="SELECT SUM($havaleField) FROM meat.havale_detail WHERE id_mojody=$id_mojody AND status=0 AND dad_id!=''";
 $result=mysql_query($q);
 $row=mysql_fetch_array($result);
 $meghdar_tahvily_detail=$row[0];
 return round($meghdar_tahvily_detail,3);
}
//محاسبه مقدار تحویلی حواله فروش
function tahvily_az_forush($sh_forush,$c_ostan,$c_anbar,$sal,$bastebandy,$c_kala)
{
 //قوطی یا دست یا عدد
 if(($bastebandy==2)OR($bastebandy==5)OR($bastebandy==6))$havaleField='tedad_karton_h_d';
 else if(($c_kala==50)OR($c_kala==54)) $havaleField='tedad_shane_h_d';
 else $havaleField='vazn_khales_h_d'; 
 $q="SELECT SUM($havaleField) FROM havale_detail WHERE h_code='$sh_forush' AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND havale_deleted=0 AND status=0";
 $result=mysql_query($q);
 $row=mysql_fetch_array($result);
 $meghdar_tahvily=$row[0];
 return $meghdar_tahvily;
}
//محاسبه مقدار تحویلی مجوز جابه جایی
function tahvily_az_jabejae($sh_jabejae,$c_ostan,$c_anbar,$sal,$bastebandy,$c_kala)
{
 //قوطی یا دست یا عدد
 if(($bastebandy==2)OR($bastebandy==5)OR($bastebandy==6))$havaleField='tedad_karton_h_d';
 else if(($c_kala==50)or($c_kala==54)) $havaleField='tedad_shane_h_d';
 else $havaleField='vazn_khales_h_d';
 $q="SELECT SUM($havaleField) FROM havale_detail WHERE shomare_jabejae='".$sh_jabejae."' AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND havale_deleted=0 AND status=0";
 $result=mysql_query($q);
 $row=mysql_fetch_array($result);
 $meghdar_tahvily_j=$row[0];
 return $meghdar_tahvily_j;
}
//محاسبه مقادیر باطله مجوز جابه جایی
function batele_jabejae($sh_jabejae,$c_ostan,$c_anbar,$sal)
{
 $q="SELECT SUM(meghdar_batele_j) FROM ebtal_jabejae WHERE shomare_jabejae='$sh_jabejae' AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal AND deleted=0";
 $result=mysql_query($q);
 $row=mysql_fetch_array($result);
 $meghdar_batele_j=$row[0];
 return $meghdar_batele_j;
}
//مجموع وزن ناخالص و وزن خالص و تعداد کارتن و مجموع وزن کارتن برای یک حواله
function havale_detail($sh_havale,$c_ostan,$c_anbar,$sal)
{
  $q="SELECT SUM(vazn_nakhales_h_d) sum_nakhales_h,SUM(vazn_khales_h_d) sum_khales_h,SUM(tedad_karton_h_d) sum_tedad_karton_h,SUM(sum_karton_h_d) sum_karton_h FROM havale_detail WHERE shomare_havale_anbar='$sh_havale' AND code_ostan='$c_ostan' AND code_anbar='$c_anbar' AND year='$sal' AND havale_deleted=0";
  return mysql_query($q);
}
//وزن ناخالص حواله
function nakhales_havale($sh_havale,$c_ostan,$c_anbar,$sal)
{
 $q="SELECT SUM(vazn_nakhales_h_d) FROM havale_detail WHERE shomare_havale_anbar='$sh_havale' AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal";
 $result=mysql_query($q);
 $row=mysql_fetch_array($result);
 $vazn_nakhales_r=$row[0];
 return $vazn_nakhales_r;
}
//تعداد کارتن حواله
function karton_havale($sh_havale,$c_ostan,$c_anbar,$sal)
{
 $q="SELECT SUM(tedad_karton_h_d) FROM havale_detail WHERE shomare_havale_anbar='$sh_havale' AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal";
 $result=mysql_query($q);
 $row=mysql_fetch_array($result);
 $vazn_nakhales_r=$row[0];
 return $vazn_nakhales_r;
}
//وزن ناخالص رسید
function nakhales_resid($sh_resid,$c_ostan,$c_anbar,$sal)
{
 $q="SELECT SUM(vazn_nakhales_r_d_sub) FROM resid_kala_detail WHERE shomare_resid='$sh_resid' AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal";
 $result=mysql_query($q);
 $row=mysql_fetch_array($result);
 $vazn_nakhales_r=$row[0];
 return $vazn_nakhales_r;
}
//تعداد کارتن رسید
function karton_resid($sh_resid,$c_ostan,$c_anbar,$sal)
{
 $q="SELECT SUM(tedad_karton_r_d_sub) FROM resid_kala_detail WHERE shomare_resid='$sh_resid' AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal";
 $result=mysql_query($q);
 $row=mysql_fetch_array($result);
 $tedad_karton_r=$row[0];
 return $tedad_karton_r;
}
function resid_detail($sh_resid,$c_ostan,$c_anbar,$sal)
{
    $q1="SELECT *,
	    (SELECT count(*) FROM resid_detail r_d WHERE r_d.shomare_resid=T.shomare_resid AND r_d.code_ostan=T.code_ostan AND r_d.code_anbar=T.code_anbar AND r_d.year=T.year) detailcount,
		(SELECT SUM(vazn_nakhales_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.shomare_resid=T.shomare_resid AND r_k_d.code_ostan=T.code_ostan AND r_k_d.code_anbar=T.code_anbar AND r_k_d.year=T.year) vazn_nakhales_r,				  
		(SELECT SUM(tedad_karton_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.shomare_resid=T.shomare_resid AND r_k_d.code_ostan=T.code_ostan AND r_k_d.code_anbar=T.code_anbar AND r_k_d.year=T.year) tedad_karton_r
		From $TableName T WHERE 1=1 ".$_SESSION['sard_search_resid']." AND code_ostan=$mt_gl_code_ostan AND code_anbar=$mt_gl_code_anbar AND year=$mtActiveYear AND deleted=0 order by $order $Limit";
    $allResid = $db->query($q1);
    while($row1=$db->fetch_assoc($allResid))
	{
	 //resid_detail اطلاعات از
	  $q_d="SELECT *,
          (SELECT SUM(vazn_nakhales_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.code_kala=r_d.code_kala AND r_k_d.code_keshvar=r_d.code_keshvar AND r_k_d.shomare_resid=r_d.shomare_resid AND r_k_d.code_ostan=r_d.code_ostan AND r_k_d.code_anbar=r_d.code_anbar AND r_k_d.year=r_d.year) vazn_nakhales_r_d,				  
          (SELECT SUM(tedad_karton_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.code_kala=r_d.code_kala AND r_k_d.code_keshvar=r_d.code_keshvar AND r_k_d.shomare_resid=r_d.shomare_resid AND r_k_d.code_ostan=r_d.code_ostan AND r_k_d.code_anbar=r_d.code_anbar AND r_k_d.year=r_d.year) tedad_karton_r_d		
	      From resid_detail r_d WHERE r_d.shomare_resid='".$row1['shomare_resid']."' AND r_d.code_ostan=$mt_gl_code_ostan AND r_d.code_anbar=$mt_gl_code_anbar AND r_d.year=$mtActiveYear";
	   $res_d = $db->query($q_d);
       while($row_d=$db->fetch_assoc($res_d))
	   {
	    $sum_karton_r_d=$row_d['tedad_karton_r_d']*$row_d['vazn_karton_this'];//مجموع وزن کارتن ها
	    $sum_karton_r+=$sum_karton_r_d;
	    $vazn_khales_r_d=$row_d['vazn_nakhales_r_d']-$sum_karton_r_d;//وزن خالص
	    $vazn_khales_r+=$vazn_khales_r_d;
	   }
	}
}
//محاسبه مبلغ پرداختی
function paskeraye($sh_resid,$c_ostan,$c_anbar,$sal)
{
 $query1="SELECT noe_tahvil_bar,noe_pardakht,mablagh_kerayemabda,mablagh_haghetavaghof,vazn_khales_r FROM resid WHERE shomare_resid='$sh_resid' AND code_ostan=$c_ostan AND code_anbar=$c_anbar AND year=$sal";
 $result1=mysql_query($query1);
 $row1=mysql_fetch_assoc($result1);
 //مبلغ باسکول
 $q_baskul="SELECT nerkh_baskul FROM hazine_baskul WHERE az_vazn<=".$row1['vazn_khales_r']." AND ta_vazn>=".$row1['vazn_khales_r']."";
 $res_baskul=mysql_query($q_baskul);
 $row_baskul=mysql_fetch_assoc($res_baskul);
 if($row1['vazn_khales_r']<=0) $$mablagh_baskul_r=0;
 else  $mablagh_baskul_r=$row_baskul['nerkh_baskul'];
 $q_d="SELECT *,
      (SELECT SUM(vazn_nakhales_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.code_kala=r_d.code_kala AND r_k_d.code_keshvar=r_d.code_keshvar AND r_k_d.code_tolidkonande=r_d.code_tolidkonande AND r_k_d.shomare_resid=r_d.shomare_resid AND r_k_d.code_ostan=r_d.code_ostan AND r_k_d.code_anbar=r_d.code_anbar AND r_k_d.year=r_d.year) vazn_nakhales_r_d,				  
      (SELECT SUM(tedad_karton_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.code_kala=r_d.code_kala AND r_k_d.code_keshvar=r_d.code_keshvar AND r_k_d.code_tolidkonande=r_d.code_tolidkonande AND r_k_d.shomare_resid=r_d.shomare_resid AND r_k_d.code_ostan=r_d.code_ostan AND r_k_d.code_anbar=r_d.code_anbar AND r_k_d.year=r_d.year) tedad_karton_r_d,		
      (SELECT SUM(sum_karton_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.code_kala=r_d.code_kala AND r_k_d.code_keshvar=r_d.code_keshvar AND r_k_d.code_tolidkonande=r_d.code_tolidkonande AND r_k_d.shomare_resid=r_d.shomare_resid AND r_k_d.code_ostan=r_d.code_ostan AND r_k_d.code_anbar=r_d.code_anbar AND r_k_d.year=r_d.year) sum_karton_r_d		
      From resid_detail r_d WHERE r_d.shomare_resid='$sh_resid' AND r_d.code_ostan=$c_ostan AND r_d.code_anbar=$c_anbar AND r_d.year=$sal AND r_d.resid_deleted=0 AND r_d.status=0";
 $res_d=mysql_query($q_d);
 while($row_d=mysql_fetch_assoc($res_d))
 {
  $kasry_kol_r_d=$row_d['vazn_mabda_r_d']-$row_d['vazn_nakhales_r_d'];//کل کسری این کالا
  if($kasry_kol_r_d<0) $kasry_kol_r_d=0;//اگر جواب منفی شد
  if($kasry_kol_r_d==$row_d['vazn_mabda_r_d'])//اگر هنوز وزن ناخالص را ثبت نکرده ایم
  {
	 $kasry_kol_r_d=0;
	 $kasry_gheyremojaz_r_d=0;
  }
  $kasry_gheyremojaz_r_d=$kasry_kol_r_d-$row_d['kasry_mojaz_r_d'];//کسری غیرمجاز این کالا
  if($kasry_gheyremojaz_r_d<0) $kasry_gheyremojaz_r_d=0;//اگر جواب منفی شد
  $mablagh_jarimekasry_r_d=$kasry_gheyremojaz_r_d*$row_d['fee_this'];//مبلغ جریمه کسری
  $mablagh_takhlie_r_d=$row_d['nerkh_takhlie_this'];//مبلغ تخلیه
  if(($row1['noe_tahvil_bar']!=2)and($row1['noe_tahvil_bar']!=5))
  {
	 $kasry_kol_r+=$kasry_kol_r_d;
	 $kasry_mojaz_r+=$row_d['kasry_mojaz_r_d'];
	 $kasry_gheyremojaz_r+=$kasry_gheyremojaz_r_d;
	 $vazn_ezafe_r+=$vazn_ezafe_r_d;
	 if($row1['noe_pardakht']==2)//اگر نوع پرداخت کرایه در مقصد بود
     {
	  $mablagh_jarimekasry_r+=$mablagh_jarimekasry_r_d;
	  $mablagh_takhlie_r+=$mablagh_takhlie_r_d;
     }
  }
 }
 //$mablagh_pardakhty=$row1['mablagh_kerayemabda']-$mablagh_jarimekasry_r+$row1['mablagh_haghetavaghof']-$mablagh_baskul_r-$mablagh_takhlie_r;
 $mablagh_pardakhty=$row1['mablagh_kerayemabda']-$mablagh_jarimekasry_r+$row1['mablagh_haghetavaghof']-$mablagh_takhlie_r;
 if($mablagh_pardakhty<0) $mablagh_pardakhty=0;
return $mablagh_pardakhty;
}
//محاسبه کل کسری
function kasryKol($sh_resid,$c_ostan,$c_anbar,$sal)
{
    $kasry_kol_r = 0;
    $q_d ="SELECT *,
	    (SELECT code_bastebandy FROM kala WHERE code_kala=r_d.code_kala) code_bastebandy, 
        (SELECT SUM(vazn_nakhales_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.code_kala=r_d.code_kala AND r_k_d.code_keshvar=r_d.code_keshvar AND r_k_d.code_tolidkonande=r_d.code_tolidkonande AND r_k_d.shomare_resid=r_d.shomare_resid AND r_k_d.code_ostan=r_d.code_ostan AND r_k_d.code_anbar=r_d.code_anbar AND r_k_d.year=r_d.year) vazn_nakhales_r_d,                  
        (SELECT SUM(vazn_khales_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.code_kala=r_d.code_kala AND r_k_d.code_keshvar=r_d.code_keshvar AND r_k_d.code_tolidkonande=r_d.code_tolidkonande AND r_k_d.shomare_resid=r_d.shomare_resid AND r_k_d.code_ostan=r_d.code_ostan AND r_k_d.code_anbar=r_d.code_anbar AND r_k_d.year=r_d.year) vazn_khales_r_d        
         From resid_detail r_d WHERE r_d.shomare_resid='$sh_resid' AND r_d.code_ostan=$c_ostan AND r_d.code_anbar=$c_anbar AND r_d.year=$sal";
    $res_d = mysql_query($q_d);
    while($row_d = mysql_fetch_assoc($res_d)){
        if(($row_d['code_bastebandy']==2)or($row_d['code_bastebandy']==3))$kasry_kol_r_d = $row_d['vazn_mabda_r_d'] - $row_d['vazn_khales_r_d'];//کل کسری این کالا
		else $kasry_kol_r_d = $row_d['vazn_mabda_r_d'] - $row_d['vazn_nakhales_r_d'];//کل کسری این کالا
        if($kasry_kol_r_d < 0) $kasry_kol_r_d = 0;//اگر جواب منفی شد
        if($kasry_kol_r_d == $row_d['vazn_mabda_r_d'])//اگر هنوز وزن ناخالص را ثبت نکرده ایم
        {
            $kasry_kol_r_d = 0;
        }
        $kasry_kol_r += $kasry_kol_r_d;
    }
    return round($kasry_kol_r,3);
}
//محاسبه وزن اضافه
function vaznEzafe($sh_resid,$c_ostan,$c_anbar,$sal)
{
    $vazn_ezafe_r=0;
    $q_d = "SELECT *,
        (SELECT code_bastebandy FROM kala WHERE code_kala=r_d.code_kala) code_bastebandy, 
		(SELECT SUM(vazn_nakhales_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.code_kala=r_d.code_kala AND r_k_d.code_keshvar=r_d.code_keshvar AND r_k_d.code_tolidkonande=r_d.code_tolidkonande AND r_k_d.shomare_resid=r_d.shomare_resid AND r_k_d.code_ostan=r_d.code_ostan AND r_k_d.code_anbar=r_d.code_anbar AND r_k_d.year=r_d.year) vazn_nakhales_r_d,                  
        (SELECT SUM(vazn_khales_r_d_sub) FROM resid_kala_detail r_k_d WHERE r_k_d.code_kala=r_d.code_kala AND r_k_d.code_keshvar=r_d.code_keshvar AND r_k_d.code_tolidkonande=r_d.code_tolidkonande AND r_k_d.shomare_resid=r_d.shomare_resid AND r_k_d.code_ostan=r_d.code_ostan AND r_k_d.code_anbar=r_d.code_anbar AND r_k_d.year=r_d.year) vazn_khales_r_d                 From resid_detail r_d WHERE r_d.shomare_resid='$sh_resid' AND r_d.code_ostan=$c_ostan AND r_d.code_anbar=$c_anbar AND r_d.year=$sal";
    $res_d = mysql_query($q_d);
    while($row_d = mysql_fetch_assoc($res_d)){
		if($row_d['code_bastebandy']==2)$kasry_kol_r_d = $row_d['vazn_khales_r_d'] - $row_d['vazn_mabda_r_d'];//کل کسری این کالا
		else $vazn_ezafe_r_d=$row_d['vazn_nakhales_r_d']-$row_d['vazn_mabda_r_d'];//وزن اضافه
		if($vazn_ezafe_r_d < 0) $vazn_ezafe_r_d = 0;//اگر جواب منفی شد
        $vazn_ezafe_r += $vazn_ezafe_r_d;
    }
    return $vazn_ezafe_r;
}
//محاسبه مبلغ ریالی کالا برای جزئیات رسید
function mablaghRiali_detail($gd_id,$vazn_khales)
{
    $mablagh_detail = 0;
	$q = "SELECT Gd_Fee FROM mt_gheymat_detail WHERE Gd_ID=$gd_id";
    $res = mysql_query($q);
    $row = mysql_fetch_assoc($res);
    $mablagh_detail=round($vazn_khales*$row['Gd_Fee']);
    return $mablagh_detail;
}
//محاسبه مبلغ ریالی کالا برای رسید
function mablaghRiali($sh_resid,$c_ostan,$c_anbar,$sal)
{
    $mablagh = 0;
	$q_d = "SELECT Re_GheymatDetailID,vazn_khales_r_d From resid_detail r_d WHERE r_d.shomare_resid='$sh_resid' AND r_d.code_ostan=$c_ostan AND r_d.code_anbar=$c_anbar AND r_d.year=$sal";
    $res_d = mysql_query($q_d);
    while($row_d = mysql_fetch_assoc($res_d))
	{
 	 $mablagh_det=mablaghRiali_detail($row_d['Re_GheymatDetailID'],$row_d['vazn_khales_r_d']);
     $mablagh += $mablagh_det;
    }
    return $mablagh;
}
function compute_gheymat_gharardad($id_gharardad,$db)
{
        $sql_gharardad="select * from gharardad_kharid where id_gharardad='".$id_gharardad."' and deleted=0 ";
		$res_gharardad=$db->query($sql_gharardad);
		$row_gharardad=$db->fetch_assoc($res_gharardad);
		$gheymat_har_kilo =$row_gharardad['gheymat_har_kilo'];
		$last_price = $row_gharardad['gheymat_har_kilo'];   
		$meghdar_gharardad=$row_gharardad['meghdar_gharardad_avaliye'];
		IF($row_gharardad['gheymat_har_kilo']=='0')
        {
		   $gheymat_har_kilo=$db->get_from_where("gheymat_kharid","gheymat_kharid","id_dastorolamal='".$row_gharardad['id_dastorolamal']."' AND deleted=0 ");
		}
		$shomare_gharardad=$row_gharardad['shomare_gharardad'];
		$exist_elhaghie=$db->get_from_where("COUNT(*)","elhaghie_kharid","id_gharardad='".$id_gharardad."' AND (meghdar_type<>0 or gheymat_type<>0)  AND deleted=0 ");
        if($exist_elhaghie>0)//اگر الحاقیه دارد
		{
		 $price_array=array();
		 $array_row = array();
		//ابتدا اطلاعات قرارداد اولیه را در آرایه قرار می دهیم
		   $array_row['id_dastorolamal']=$row_gharardad['id_dastorolamal'];
		   $id_dastorolamal=$row_gharardad['id_dastorolamal'];
		   $array_row['start_date']=$db->get_from_where("tarikh_shoro_etebar","dastorolamal_kharid","id_dastorolamal='$id_dastorolamal' and deleted=0");
		   $array_row['gheymat']=$gheymat_har_kilo;
		   $array_row['end_date']="";
		   $array_row['meghdar']=$meghdar_gharardad;
		   $array_row['mizan_asar']=$row_gharardad['mizan_asar'];
		   $price_array[] = $array_row;
		   //افزودن الحاقیه ها
		   $sql_elhaghie="select * from elhaghie_kharid where id_gharardad='$id_gharardad'  AND (meghdar_type<>0 or gheymat_type<>0)  AND deleted=0  order by tarikh_elhaghie,id_elhaghie ";
		   $res_elhaghie=$db->query($sql_elhaghie);
		   $id_dastorolamal="";
		   while($row=$db->fetch_assoc($res_elhaghie))
		   {
 
               $array_row = array();
			   $array_row['id_dastorolamal']=$row['id_dastorolamal'];
			   $id_dastorolamal=$row['id_dastorolamal'];
    		   $array_row['start_date']=$db->get_from_where("tarikh_shoro_etebar","dastorolamal_kharid","id_dastorolamal='$id_dastorolamal' and deleted=0");
			   $array_row['gheymat']=$row['gheymat_elhaghie'];
			   $array_row['end_date']="";
			   $array_row['meghdar']="";
			   if ($row['meghdar_type']==1)
		           $array_row['meghdar']=$row['meghdar_elhaghie'];
			   if ($row['meghdar_type']==2)	   
		          $array_row['meghdar']=-$row['meghdar_elhaghie'];
				$array_row['mizan_asar']=$row['mizan_asar'];  
			   $price_array[] = $array_row;	  
				  
			}
			
			
			
			 if (count($price_array)> 1)
		        for ($k=0; $k<count($price_array)-1 ; $k++)
			 	  $price_array[$k]['end_date']=$price_array[$k+1]['start_date'];
			
            //print_r($price_array);
			
			
		     $sum_vazn_gharardad = 0;
             foreach ($price_array as $item) 
                  $sum_vazn_gharardad += $item['meghdar'];
				
				
			
				
              $sum_mizan_asar = 0;
              $vazn_mizan_asar=0;
			  foreach ($price_array as $item) 
			  {
			      $vazn_mizan_asar+=$item['mizan_asar'];
                  $sum_mizan_asar += $item['mizan_asar']*$item['gheymat'];
				  }
				  
			
             $gheymat_elhaghie=$db->get_from_where("gheymat_elhaghie","elhaghie_kharid","id_gharardad='$id_gharardad' AND gheymat_elhaghie>0 AND deleted=0 ORDER BY tarikh_elhaghie desc,id_elhaghie desc "); 
            if (!is_null($gheymat_elhaghie))
		                   $last_price=$gheymat_elhaghie;
		    return round($sum_mizan_asar+($sum_vazn_gharardad-$vazn_mizan_asar)*$last_price);
	    	   
		}	  
		
		else
		 // اگر الحاقیه ندارد 
		 {
		   return round($gheymat_har_kilo * $meghdar_gharardad);
		 }
		
}
function compute_ghardad_payment($id_gharardad,$db)
{
        $sql_gharardad="select * from gharardad_kharid where id_gharardad='".$id_gharardad."' and deleted=0 ";
	
		$res_gharardad=$db->query($sql_gharardad);
		$row_gharardad=$db->fetch_assoc($res_gharardad);
		$gheymat_har_kilo =$row_gharardad['gheymat_har_kilo'];
		$code_skk =$row_gharardad['code_skk'];
		$shomare_gharardad=$row_gharardad['shomare_gharardad'];

		
		IF($row_gharardad['gheymat_har_kilo']=='0')
   	   {
	  
	       
		   $gheymat_har_kilo=$db->get_from_where("gheymat_kharid","gheymat_kharid","id_dastorolamal='".$row_gharardad['id_dastorolamal']."' AND deleted=0 ");
		    
	       
		}

		 
	       
	    $exist_elhaghie=$db->get_from_where("COUNT(*)","elhaghie_kharid","id_gharardad='".$id_gharardad."' AND gheymat_elhaghie>0  AND deleted=0 ");
		
	       
        if($exist_elhaghie>0)//اگر الحاقیه دارد
        {
		 $price_array=array();
		 $array_row = array();
		//ابتدا اطلاعات قرارداد اولیه را در آرایه قرار می دهیم
		   $array_row['id_dastorolamal']=$row_gharardad['id_dastorolamal'];
		   $id_dastorolamal=$row_gharardad['id_dastorolamal'];
		   $array_row['start_date']=$db->get_from_where("tarikh_shoro_etebar","dastorolamal_kharid","id_dastorolamal='$id_dastorolamal' and deleted=0");
		   $array_row['gheymat']=$gheymat_har_kilo;
		   $array_row['end_date']="";
		   $array_row['meghdar']=$row_gharardad['meghdar_gharardad_avalyie'];
		   $array_row['mizan_asar']=$row_gharardad['mizan_asar'];
		   $price_array[] = $array_row;
		  // حالا رکوردهای الحاقیه را در آرایه اضافه می کنیم  
	       
           $sql_elhaghie="select * from elhaghie_kharid where id_gharardad='$id_gharardad'  AND ( gheymat_type<>0)  AND deleted=0  order by tarikh_elhaghie,id_elhaghie ";
		   $res_elhaghie=$db->query($sql_elhaghie);
		   $id_dastorolamal="";
		   while($row=$db->fetch_assoc($res_elhaghie))
		   {
 
               $array_row = array();
			   $array_row['id_dastorolamal']=$row['id_dastorolamal'];
			   $id_dastorolamal=$row['id_dastorolamal'];
    		   $array_row['start_date']=$db->get_from_where("tarikh_shoro_etebar","dastorolamal_kharid","id_dastorolamal='$id_dastorolamal' and deleted=0");
			   $array_row['gheymat']=$row['gheymat_elhaghie'];
			   $array_row['end_date']="";
			   $array_row['meghdar']="";
			   if ($row['meghdar_type']==1)
		           $array_row['meghdar']=$row['meghdar_elhaghie'];
			   if ($row['meghdar_type']==2)	   
		          $array_row['meghdar']=-$row['meghdar_elhaghie'];
				$array_row['mizan_asar']=$row['mizan_asar'];  
			   $price_array[] = $array_row;	  
				  
			}
			 if (count($price_array)> 1)
		        for ($k=0; $k<count($price_array)-1 ; $k++)
			 	  $price_array[$k]['end_date']=$price_array[$k+1]['start_date'];
  
			
			
		   //محاسبه رسیدها در بازه های مختلف 
		  $sum=0 ;
          $sum_vazn=0;	
		 
		  for ($k=0; $k<=count($price_array)-1 ; $k++)
		  {
		    if ($price_array[$k]['end_date']=="")
			   $condition_date = "tarikh_resid >='".$price_array[$k]['start_date']."'";
			else
			   $condition_date = "tarikh_resid >='".$price_array[$k]['start_date']."' and tarikh_resid<'".$price_array[$k]['end_date']."'";
			
			
			
		   $sql_resid ="select sum(vazn_khales_r_d_sub) as total_vazn_resid_shode
		   from shomare_safar
            inner join
            resid  using (id_safar)
            inner join 
            resid_kala_detail
            on 
              resid_kala_detail.shomare_resid =resid.shomare_resid  
              and  resid_kala_detail.code_ostan=resid.code_ostan
              and  resid_kala_detail.code_anbar=resid.code_anbar
              and  resid_kala_detail.year=resid.year
              and  resid_kala_detail.status=0
              and resid.status=0
			  and sabt_nahayi=1 and noe_tahvil_bar <>8 
			  where shomare_safar='$shomare_gharardad' and shomare_safar.code_skk='$code_skk'
			  and $condition_date ";

			$res_resid=$db->query($sql_resid);  
	 		$row_resid=$db->fetch_assoc($res_resid);
			$price_array[$k]['resid_tahvily']=round($row_resid['total_vazn_resid_shode'],3);
			
			}
			//محاسبه کل رسیدهای دریافت شده برای این قرارداد
			$kol_resid_daryaft_shode =$db->get_from_where("sum(vazn_khales_r_d_sub) as total_vazn_resid_shode",
			"
		    shomare_safar
            inner join
            resid  using (id_safar)
            inner join 
            resid_kala_detail
            on 
              resid_kala_detail.shomare_resid =resid.shomare_resid  
              and  resid_kala_detail.code_ostan=resid.code_ostan
              and  resid_kala_detail.code_anbar=resid.code_anbar
              and  resid_kala_detail.year=resid.year
              and  resid_kala_detail.status=0
              and resid.status=0
			  and sabt_nahayi=1 and noe_tahvil_bar<>8 ",
			  " shomare_safar='$shomare_gharardad' and shomare_safar.code_skk='$code_skk'");
			  
			
			
			$mande_resid=round($kol_resid_daryaft_shode,3);
			
			
			
			
			for ($k=0; $k<=count($price_array)-1 ; $k++)
		    {
			  
			   if ($price_array[$k]['mizan_asar'] == 0  and  $price_array[$k]['resid_tahvily']==0) 
			   {
			     
			     continue ;
				 }
			   if ($price_array[$k]['mizan_asar'] <> 0  and $price_array[$k]['resid_tahvily']==0)
			   {
			       if ($mande_resid >=$price_array[$k]['mizan_asar'] )
				   {
				     
				     $sum=$sum + $price_array[$k]['mizan_asar']*$price_array[$k]['gheymat'];
					 $sum_vazn+= $price_array[$k]['mizan_asar'] ;
				     $mande_resid-=$price_array[$k]['mizan_asar'] ;
					 
					 
					 
					}
					continue;
			   }
			   if ($price_array[$k]['mizan_asar'] >=$price_array[$k]['resid_tahvily'])
			   
			   if ($mande_resid >=$price_array[$k]['mizan_asar'] )
				  {
				    $sum=$sum + $price_array[$k]['mizan_asar']*$price_array[$k]['gheymat'];
					$sum_vazn+= $price_array[$k]['mizan_asar'] ;
				    $mande_resid-=$price_array[$k]['mizan_asar'] ;
				  }	
				  
				if ($price_array[$k]['mizan_asar']==0 and  $price_array[$k]['resid_tahvily']<>0 )
                {    
				     
					 if ( $k<count($price_array)-1 )
					 {
					  if ($mande_resid >=$price_array[$k]['resid_tahvily']) 
					  
					   {
					     $sum=$sum + $price_array[$k]['resid_tahvily']*$price_array[$k]['gheymat'];
				    	 $sum_vazn+= $price_array[$k]['resid_tahvily'];
				         $mande_resid-=$price_array[$k]['resid_tahvily'];
					   }
					 }
					 else
					 {
					 
					 
					     $sum=$sum + $mande_resid*$price_array[$k]['gheymat'];
				    	 $sum_vazn+= $mande_resid;
				         $mande_resid=0;
					 
					 }
					   
				}	
					     

               
                    
			   
			
			 }
			   
			 return array(round($sum_vazn,3), round($sum,3));  

			
			
           
    
       } 	 
       else//اگر الحاقیه ندارد
       {
	     
		 $slq_resid_befor_elhaghie="
		   select sum(vazn_khales_r_d_sub) as total_vazn_resid_shode
		   from shomare_safar
            inner join
            resid  using (id_safar)
            inner join 
            resid_kala_detail
            on 
              resid_kala_detail.shomare_resid =resid.shomare_resid  
              and  resid_kala_detail.code_ostan=resid.code_ostan
              and  resid_kala_detail.code_anbar=resid.code_anbar
              and  resid_kala_detail.year=resid.year
              and  resid_kala_detail.status=0
              and resid.status=0
			  and sabt_nahayi=1 and noe_tahvil_bar <> 8
			  where shomare_safar='$shomare_gharardad' and shomare_safar.code_skk='$code_skk'";
			  
		   $res_resid_befor_elhaghie=$db->query($slq_resid_befor_elhaghie);  
		   $row_resid_befor_elhaghie=$db->fetch_assoc($res_resid_befor_elhaghie);
           $sum_vazn+=round($row_resid_befor_elhaghie['total_vazn_resid_shode'],3);
           $sum+=round($row_resid_befor_elhaghie['total_vazn_resid_shode'],3)*$gheymat_har_kilo;		   
        }   
    return array(round($sum_vazn,3), round($sum,3));
}
//محاسبه قیمت قرارداد
function compute_resid_price($tarikh_resid ,$id_gharardad, $db)
{
  $sql_gharardad="select * from gharardad_kharid where id_gharardad='".$id_gharardad."' and deleted=0 ";
  $res_gharardad=$db->query($sql_gharardad);
  $row_gharardad=$db->fetch_assoc($res_gharardad);
  $gheymat_har_kilo =$row_gharardad['gheymat_har_kilo'];
  $code_skk =$row_gharardad['code_skk'];
  $shomare_gharardad=$row_gharardad['shomare_gharardad'];
  if($row_gharardad['gheymat_har_kilo']=='0')
   		   $gheymat_har_kilo=$db->get_from_where("gheymat_kharid","gheymat_kharid","id_dastorolamal='".$row_gharardad['id_dastorolamal']."' AND deleted=0 ");
    
  $exist_elhaghie=$db->get_from_where("COUNT(*)","elhaghie_kharid","id_gharardad='".$id_gharardad."' AND gheymat_elhaghie>0  AND deleted=0 ");
  if($exist_elhaghie>0)//اگر الحاقیه دارد
  {
    $price_array=array();
	$array_row = array();
	//ابتدا اطلاعات قرارداد اولیه را در آرایه قرار می دهیم
	$array_row['id_dastorolamal']=$row_gharardad['id_dastorolamal'];
	$id_dastorolamal=$row_gharardad['id_dastorolamal'];
	$array_row['start_date']=$db->get_from_where("tarikh_shoro_etebar","dastorolamal_kharid","id_dastorolamal='$id_dastorolamal' and deleted=0");
	$array_row['gheymat']=$gheymat_har_kilo;
	$array_row['end_date']="";
	$array_row['meghdar']=$row_gharardad['meghdar_gharardad_avalyie'];
	$array_row['mizan_asar']=$row_gharardad['mizan_asar'];
	$price_array[] = $array_row;
	// حالا رکوردهای الحاقیه را در آرایه اضافه می کنیم  
	       
    $sql_elhaghie="select * from elhaghie_kharid where id_gharardad='$id_gharardad'  AND ( gheymat_type<>0)  AND deleted=0  order by tarikh_elhaghie,id_elhaghie ";
	$res_elhaghie=$db->query($sql_elhaghie);
	$id_dastorolamal="";
	while($row=$db->fetch_assoc($res_elhaghie))
	{
      $array_row = array();
      $array_row['id_dastorolamal']=$row['id_dastorolamal'];
	  $id_dastorolamal=$row['id_dastorolamal'];
      $array_row['start_date']=$db->get_from_where("tarikh_shoro_etebar","dastorolamal_kharid","id_dastorolamal='$id_dastorolamal' and deleted=0");
	  $array_row['gheymat']=$row['gheymat_elhaghie'];
	  $array_row['end_date']="";
	  $array_row['meghdar']="";
	  if ($row['meghdar_type']==1)
	       $array_row['meghdar']=$row['meghdar_elhaghie'];
	  if ($row['meghdar_type']==2)	   
	       $array_row['meghdar']=-$row['meghdar_elhaghie'];
	  $array_row['mizan_asar']=$row['mizan_asar'];  
	  $price_array[] = $array_row;	  
		  
	}
	if (count($price_array)> 1)
	    for ($k=0; $k<count($price_array)-1 ; $k++)
		 	  $price_array[$k]['end_date']=$price_array[$k+1]['start_date'];
		  
    $price=0;
	
	for ($k=0;$k<=count($price_array)-1 ;$k++)
	{
	   
	   if ($price_array[$k]['end_date']=="")
	   {
	     
	     if ($tarikh_resid >= $price_array[$k]['start_date']) ;
		 {
		        $price= $price_array[$k]['gheymat'];
				break;
				
		  }
       }
	   else
	     if ($tarikh_resid >=$price_array[$k]['start_date'] && $tarikh_resid<$price_array[$k]['end_date'])
		 {
			    $price= $price_array[$k]['gheymat'];
				break;
		  }		
	}
	return $price;
			 
  }
  else return $gheymat_har_kilo;
}

function compute_resid_price_test($tarikh_resid ,$id_gharardad, $db)
{
  $sql_gharardad="select * from gharardad_kharid where id_gharardad='".$id_gharardad."' and deleted=0 ";
  $res_gharardad=$db->query($sql_gharardad);
  $row_gharardad=$db->fetch_assoc($res_gharardad);
  $gheymat_har_kilo =$row_gharardad['gheymat_har_kilo'];
  $code_skk =$row_gharardad['code_skk'];
  $shomare_gharardad=$row_gharardad['shomare_gharardad'];
  if($row_gharardad['gheymat_har_kilo']=='0')
   		   $gheymat_har_kilo=$db->get_from_where("gheymat_kharid","gheymat_kharid","id_dastorolamal='".$row_gharardad['id_dastorolamal']."' AND deleted=0 ");
    
  $exist_elhaghie=$db->get_from_where("COUNT(*)","elhaghie_kharid","id_gharardad='".$id_gharardad."' AND gheymat_elhaghie>0  AND deleted=0 ");
  if($exist_elhaghie>0)//اگر الحاقیه دارد
  {
    $price_array=array();
	$array_row = array();
	//ابتدا اطلاعات قرارداد اولیه را در آرایه قرار می دهیم
	$array_row['id_dastorolamal']=$row_gharardad['id_dastorolamal'];
	$id_dastorolamal=$row_gharardad['id_dastorolamal'];
	$array_row['start_date']=$db->get_from_where("tarikh_shoro_etebar","dastorolamal_kharid","id_dastorolamal='$id_dastorolamal' and deleted=0");
	$array_row['gheymat']=$gheymat_har_kilo;
	$array_row['end_date']="";
	$array_row['meghdar']=$row_gharardad['meghdar_gharardad_avalyie'];
	$array_row['mizan_asar']=$row_gharardad['mizan_asar'];
	$price_array[] = $array_row;
	// حالا رکوردهای الحاقیه را در آرایه اضافه می کنیم  
	       
    $sql_elhaghie="select * from elhaghie_kharid where id_gharardad='$id_gharardad'  AND ( gheymat_type<>0)  AND deleted=0  order by tarikh_elhaghie,id_elhaghie ";
	$res_elhaghie=$db->query($sql_elhaghie);
	$id_dastorolamal="";
	
	while($row=$db->fetch_assoc($res_elhaghie))
	{
      $array_row = array();
      $array_row['id_dastorolamal']=$row['id_dastorolamal'];
	  $id_dastorolamal=$row['id_dastorolamal'];
      $array_row['start_date']=$db->get_from_where("tarikh_shoro_etebar","dastorolamal_kharid","id_dastorolamal='$id_dastorolamal' and deleted=0");
	  $array_row['gheymat']=$row['gheymat_elhaghie'];
	  $array_row['end_date']="";
	  $array_row['meghdar']="";
	  if ($row['meghdar_type']==1)
	       $array_row['meghdar']=$row['meghdar_elhaghie'];
	  if ($row['meghdar_type']==2)	   
	       $array_row['meghdar']=-$row['meghdar_elhaghie'];
	  $array_row['mizan_asar']=$row['mizan_asar'];  
	  $price_array[] = $array_row;	  
	  	  
	}
	if (count($price_array)> 1)
	    for ($k=0; $k<count($price_array)-1 ; $k++)
		 	  $price_array[$k]['end_date']=$price_array[$k+1]['start_date'];
	

	print_r($price_array);
    $price=0;
	
	for ($k=0;$k<=count($price_array)-1 ;$k++)
	{
	   
	   if ($price_array[$k]['end_date']=="")
	   {
	     
	     if ($tarikh_resid >= $price_array[$k]['start_date']) ;
		 {
		        $price= $price_array[$k]['gheymat'];
				break;
				
		  }
       }
	   else
	     if ($tarikh_resid >=$price_array[$k]['start_date'] && $tarikh_resid<$price_array[$k]['end_date'])
		 {
			    $price= $price_array[$k]['gheymat'];
				break;
		  }		
	}
	return $price;
			 
  }
  else return $gheymat_har_kilo;
}
/******************مقدار تحویلی از قرارداد*******************/
//function tahvily_az_gharardad($sh_gharardad,$c_ostan,$sal,$c_kala,$bastebandy)
// function tahvily_az_gharardad($sh_gharardad,$sal,$bastebandy)
// {
 // $q_gharardad="SELECT meghdar_gharardad FROM gharardad_kharid WHERE shomare_gharardad='$sh_gharardad";
 // $res_gharardad=mysql_query($q_gharardad);
 // $meghdar_gharardad= mysql_result($res_gharardad, 0, 'meghdar_gharardad');
  // //قوطی
  // if($bastebandy==2)
  // {
   // //if($bastebandy==2) $sum_tahvily_gharardad=$db->get_from_where("SUM(tedad_karton_r_d_sub)","meat.resid_kala_detail r_k_d INNER JOIN meat.resid r ON r_k_d.shomare_resid=r.shomare_resid AND r_k_d.code_ostan=r.code_ostan AND r_k_d.code_anbar=r.code_anbar AND r_k_d.year=r.year","r.id_safar=(SELECT id_safar FROM shomare_safar WHERE shomare_safar='".$sh_gharardad."') AND r.noe_tahvil_bar!=4 AND r.noe_tahvil_bar!=5 AND r.noe_tahvil_bar!=6 AND r_k_d.year='$sal' AND r_k_d.code_kala=".$row1['code_kala']." AND r_k_d.code_ostan=".$row1['code_ostan']." AND r_k_d.resid_deleted=0 AND r_k_d.status=0 AND r.status=0");
   // $q_tahvily="SELECT SUM(tedad_karton_r_d_sub) FROM meat.resid_kala_detail r_k_d INNER JOIN meat.resid r ON r_k_d.shomare_resid=r.shomare_resid AND r_k_d.code_ostan=r.code_ostan AND r_k_d.code_anbar=r.code_anbar AND r_k_d.year=r.year WHERE r.id_safar=(SELECT id_safar FROM shomare_safar WHERE shomare_safar='".$sh_gharardad."') AND r.noe_tahvil_bar!=4 AND r.noe_tahvil_bar!=5 AND r.noe_tahvil_bar!=6 AND r_k_d.year='$sal' AND r_k_d.resid_deleted=0 AND r_k_d.status=0 AND r.status=0"

  // }
  // //کارتن یا لاشه
  // else $sum_tahvily_gharardad=$db->get_from_where("SUM(vazn_khales_r_d_sub)","meat.resid_kala_detail r_k_d INNER JOIN meat.resid r ON r_k_d.shomare_resid=r.shomare_resid AND r_k_d.code_ostan=r.code_ostan AND r_k_d.code_anbar=r.code_anbar AND r_k_d.year=r.year","r.id_safar=(SELECT id_safar FROM shomare_safar WHERE shomare_safar='".$sh_gharardad."') AND r.noe_tahvil_bar!=4 AND r.noe_tahvil_bar!=5 AND r.noe_tahvil_bar!=6 AND r_k_d.year='$sal' AND r_k_d.resid_deleted=0 AND r_k_d.status=0 AND r.status=0");
  // if($sum_tahvily_gharardad=='')$sum_tahvily_gharardad=0;
  // return $sum_tahvily_gharardad;
// }
/***********************************************************************************/
// Auto Sanad to Acc
function add2acc($file, $sep, $user, $org, $year, $pre_code, $desc){
    // var_dump($file,$sep,$user,$org,$year,$pre_code);
    $db = mysql_connect('localhost', 'user', 'xlsdj@#@aHdF');
    mysql_select_db('mali', $db) or die("Opps some thing went wrong");

    $result = mysql_query("select start_from,end_to from acc_docs where org=$org and year=$year;");

    $row = mysql_fetch_array($result);
    $start_from = $row[0];
    $end_to = $row[1];

    $art_no = 0;
    $fh = fopen($file, 'r');
    $doc_date = 1;


    while (!feof($fh)) {
        $st = fgets($fh);

        if ($st > '') {
            $token = explode($sep, $st);
            $tdoc_date = $token[0];
            if ($start_from <= $tdoc_date and $tdoc_date <= $end_to and $token[2] + $token[3] > 0) {
				// dd("asfafas");
                if ($art_no == 0) {
                    $art_no++;

                    $result = mysql_query("select max(tmpdoc_no) from acc_cover where org=$org and year=$year and cut_code=$pre_code;");
                    $row = mysql_fetch_array($result);
                    $wtmpdoc_no = $row[0] + 1;


                    $result = mysql_query("select max(cover_id) from acc_cover where org=$org and year=$year;");
                    $row = mysql_fetch_array($result);
                    $cover_id = $row[0] + 1;


                    $result = mysql_query("insert into acc_cover (org,year,cover_id,segment,cut_code,tmpdoc_no,doc_date,user_id,doc_descr)
                                             values ($org,$year,$cover_id,1,$pre_code,$wtmpdoc_no,$tdoc_date,$user,'".$desc."');");
                }

                $cut_code = $pre_code;
                $doc_no = $wtmpdoc_no;
                $doc_date = (isset($doc_date) && $token[0] > $doc_date) ? $token[0] : $doc_date ;
                $code = $token[1];
                $rls1 = round($token[2]);
                $rls2 = round($token[3]);
                $credit = $token[4];
                $description = $token[5]; // $description=iconv("windows-1256", "utf-8",$description); $description=str_replace('?','ي',$description);
                $ref_kind = $token[6];
                $ref_no = $token[7];
                $ref_date = $token[8];
                $ref_qty = $token[9];
                $totrls1 += $rls1;
                $totrls2 += $rls2;
                $sub3 = substr(str_pad($code, 30, 0), 6, 6);
                $sub4 = substr(str_pad($code, 30, 0), 12, 6);
                $sub5 = substr(str_pad($code, 30, 0), 18, 6);
                $sub6 = substr(str_pad($code, 30, 0), 24, 6);
                $sub7 = 0;
                $sub8 = 0;

                $result = mysql_query("select max(id) from acc_mali where org=$org and year=$year;");
                $row = mysql_fetch_array($result);
                $id = $row[0] + 1;

                $result = mysql_query("insert into acc_mali (org,year,cover_id,id,art_no,code,sub3,sub4,sub5,sub6,sub7,sub8,description,credit,rls1,rls2,ref_kind,ref_date,ref_qty,ref_no)
                                             values ($org,$year,$cover_id,$id,$art_no,$code,$sub3,$sub4,$sub5,$sub6,$sub7,$sub8,'$description',$credit,$rls1,$rls2,$ref_kind,$ref_date,$ref_qty,$ref_no);");
            }
        }
    }
    if ($art_no > 0) $result = mysql_query("update acc_cover set rls1=$totrls1,rls2=$totrls2,doc_date=$doc_date where org=$org and year=$year and cover_id=$cover_id;");

    $db_close = mysql_close();
    unlink($file);
    return $wtmpdoc_no;
}

function pdo_execute($connection, $query)
{
    $stmt = $connection->prepare($query);
    $stmt->execute();
    return $stmt->fetchAll(PDO::FETCH_OBJ);
}

function dd($var)
{
    print_r($var);
    die;
}

function removeSixZeroFromLastString($string){
	$sixLast = substr($string, -6);

	if ($sixLast != "000000"){
		return $string;
	}

	$string = substr($string, 0, -6);
	return removeSixZeroFromLastString($string);
}

function set_flag_sanad($connection, $queryForSetSanad, $status, $code_ostan, $code_sardkhane, $sanadNo)
{
	if ($status == 'varede' || $status == 'gharardad')
		$table = 'resid';
	else
		$table = 'havale';

	if ($status == 'gharardadXXX') $fld="_kharid";

    $shomare_resid = pdo_execute($connection, $queryForSetSanad);

	foreach ($shomare_resid as $key => $value) {
		$temp[] = $value->id;
	}

	$shomare_resid = implode(',', $temp);

	$query = "UPDATE $table SET set_sanad$fld = $sanadNo
              WHERE code_ostan = $code_ostan
              AND code_anbar = $code_sardkhane
              AND id IN ($shomare_resid)";

    # if (SuperUser()) echo $query;

	pdo_execute($connection, $query);
}

/*************************شروع سند حسابداری*********************************/
function set_sanad($code_ostan, $code_sardkhane, $status)
{
	$level4 = "";
	//$code_ostan = $code_ostan < 0 ? 0 : $code_ostan;
    $file = fopen(__DIR__ . '/sanad/' . $code_ostan . 'tmp.csv', 'w');

    $year = $_SESSION['mtActiveYear'];

    if(isset($_POST['date_from'])){ // Agar sanad bar asase entekhabe tarikh resid bashad

        $date_from_asli = $_POST['date_from']; // 1393/03/03
        $date_to_asli = $_POST['date_to'];

    }else if(isset($_POST['resid_from'])){ // Agar sanad bar asase entekhabe shomare resid bashad

        $resid_from = str_pad($_POST['resid_from'], 5, '0', STR_PAD_LEFT);
        $resid_to = str_pad($_POST['resid_to'], 5, '0', STR_PAD_LEFT);
        $setResidNumber = true;

    }

//  $pdo = new PDO("mysql:host=localhost;dbname=meatdovom", "root", "123");
    $pdo = new PDO("mysql:host=localhost;dbname=meat", "user", "xlsdj@#@aHdF");
    $stmt = $pdo->prepare("SET character_set_results = 'utf8', character_set_client = 'utf8', character_set_connection = 'utf8', character_set_database = 'utf8', character_set_server = 'utf8'");
    $stmt->execute();

    // tabdile code_acc be code_anbar
    $query = "SELECT * FROM list_sardkhane WHERE code_anbar=" . $code_sardkhane . " AND code_ostan=" . $code_ostan;
    $stat = pdo_execute($pdo, $query);
    $code_acc = $stat[0]->code_acc;

    if ($status == 'varede') {
		$desc = "وارده";
        $query_status_peymankar = "SELECT status_peymankar FROM list_sardkhane WHERE code_ostan=" . $code_ostan . " AND code_anbar=" . $code_sardkhane . " LIMIT 1";
        $status_peymankar = pdo_execute($pdo, $query_status_peymankar);

        $query = "SELECT * FROM bedehkar_bestankar WHERE noe_sanad=1 AND status_peymankar=" . $status_peymankar[0]->status_peymankar;
        $stat = pdo_execute($pdo, $query);

                    /* SELECT *,
                      SUM(vazn_nakhales_r) sum_vazn_nakhales_r,
                      SUM(vazn_mabda_r_d) sum_vazn_mabda_r_d,
                      SUM(tedad_karton_r_d_sub) sum_tedad_karton FROM
                    ( */

        /* Resid Jensi-Bedehkar */
        $query = "SELECT resid.mablagh_kerayemabda,
                     resid.vazn_nakhales_r,
                     SUM(resid_kala_detail.vazn_nakhales_r_d_sub) sum_vazn_nakhales_r,
                     resid_detail.vazn_mabda_r_d sum_vazn_mabda_r_d,
                     resid.noe_tahvil_bar,
                     resid.code_ostan_mabda,
                     resid.code_skk,
                     kala.code_group_kala,
                     kala.code_nerkh_standard,
                     resid.shomare_resid,
                     kala.nerkh_standard,
                     max(resid.tarikh_resid) tarikh_resid,
                     kala.name_kala,
                     tedad_karton_r_d_sub sum_tedad_karton
                FROM resid
                    INNER JOIN resid_kala_detail 
                        ON resid.shomare_resid = resid_kala_detail.shomare_resid 
                        AND resid.code_ostan = resid_kala_detail.code_ostan 
                        AND resid.code_anbar = resid_kala_detail.code_anbar 
                        AND resid.year = resid_kala_detail.year 
                      INNER JOIN resid_detail 
                        ON resid_detail.shomare_resid = resid.shomare_resid 
                        AND resid.code_ostan = resid_detail.code_ostan 
                        AND resid.code_anbar = resid_detail.code_anbar 
                        AND resid.year = resid_detail.year 
                    INNER JOIN kala ON kala.code_kala = resid_kala_detail.code_kala
                WHERE ";
                if(isset($setResidNumber)){
                    $query .= "resid.shomare_resid BETWEEN '{$resid_from}' AND '{$resid_to}'";
                }else{
                    $query .= "tarikh_resid BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'";
                }
                    $query .= " AND resid.code_ostan={$code_ostan}
                    AND resid.noe_tahvil_bar != 9
                    AND resid_detail.code_ostan={$code_ostan}  
                    AND resid_kala_detail.code_ostan={$code_ostan}  
                    AND resid.code_anbar={$code_sardkhane} 
                    AND resid_detail.code_anbar = {$code_sardkhane} 
                    AND resid_kala_detail.code_anbar = {$code_sardkhane} 
                    AND resid.year = {$year}
                    AND resid_detail.year = {$year}
                    AND resid_kala_detail.year = {$year}
                    AND resid.deleted=0 
                    AND resid.status=0
                    AND resid_kala_detail.status = 0 
                    AND resid_detail.status = 0 ";
                    if(!SuperUser())
						$query .= "AND set_sanad = 0 ";
                $query .= "GROUP BY shomare_resid, kala.code_kala;";
				
        // dd($query);
        $result = pdo_execute($pdo, $query);

        // query for set sanad
        $queryForSetSanad = "SELECT resid.id
                            FROM resid
                                INNER JOIN resid_kala_detail 
                                    ON resid.shomare_resid = resid_kala_detail.shomare_resid 
                                    AND resid.code_ostan = resid_kala_detail.code_ostan 
                                    AND resid.code_anbar = resid_kala_detail.code_anbar 
                                    AND resid.year = resid_kala_detail.year 
                                  INNER JOIN resid_detail 
                                    ON resid_detail.shomare_resid = resid.shomare_resid 
                                    AND resid.code_ostan = resid_detail.code_ostan 
                                    AND resid.code_anbar = resid_detail.code_anbar 
                                    AND resid.year = resid_detail.year 
                                INNER JOIN kala ON kala.code_kala = resid_kala_detail.code_kala
                            WHERE ";
                            if(isset($setResidNumber)){
                                $queryForSetSanad .= "resid.shomare_resid BETWEEN '{$resid_from}' AND '{$resid_to}'";
                            }else{
                                $queryForSetSanad .= "tarikh_resid BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'";
                            }
                                $queryForSetSanad .= " AND resid.code_ostan={$code_ostan}
                                AND resid.noe_tahvil_bar != 9
                                AND resid_detail.code_ostan={$code_ostan}  
                                AND resid_kala_detail.code_ostan={$code_ostan}  
                                AND resid.code_anbar={$code_sardkhane} 
                                AND resid_detail.code_anbar = {$code_sardkhane} 
                                AND resid_kala_detail.code_anbar = {$code_sardkhane}
                                AND resid.year = {$year}
								AND resid_detail.year = {$year}
								AND resid_kala_detail.year = {$year}
                                AND resid.deleted=0 
                                AND resid.status=0
                                AND resid_kala_detail.status = 0 
                                AND resid_detail.status = 0 ";
								if(!SuperUser())
									$queryForSetSanad .= "AND set_sanad = 0";


        $tarikh_old = 0;
        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_resid) {
                $tarikh = substr($value->tarikh_resid, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_resid);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bedehkar);
            $sharh = str_replace("(تعداد)", $value->tedad_kala, $sharh);
            $sharh = str_replace("(نام کالا)", $value->name_kala, $sharh);
            $sharh = str_replace("(وزن کالا)", (($value->code_group_kala == 2049) ? $value->sum_tedad_karton : $value->sum_vazn_nakhales_r), $sharh);
            $sharh = str_replace("وزن", (($value->code_group_kala == 2049) ? 'تعداد' : 'وزن'), $sharh);
            $sharh = str_replace("کيلوگرم", (($value->code_group_kala == 2049) ? '' : 'کيلوگرم'), $sharh);
            $sharh = str_replace("ی", "ي", $sharh);

            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};";
            $echo .= removeSixZeroFromLastString($stat[0]->code_bedehkar . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . str_pad($value->code_nerkh_standard, 6, '0', STR_PAD_LEFT) . str_pad($code_acc, 6, '0', STR_PAD_LEFT) . $level4) . ";";
            $echo .= (($value->code_group_kala == 2049) ? $value->nerkh_standard * $value->sum_tedad_karton : $value->nerkh_standard * $value->sum_vazn_nakhales_r) . ";0;2;";
            $echo .= $sharh;
            $echo .= ";0;";
            $echo .= "0;";
            $echo .= "0;";
            $echo .= "{$value->sum_vazn_nakhales_r}";
            $echo .= "\r\n";
            fwrite($file, $echo);

            $tarikh_old = $value->tarikh_resid;
        } /* end foreach */

                    /* SELECT *,
                        SUM(vazn_nakhales_r) sum_vazn_nakhales_r,
                        SUM(vazn_mabda_r_d) sum_vazn_mabda_r_d,
                        SUM(tedad_karton_r) sum_tedad_karton
                    FROM ( */

        /* Resid Jensi-Bestankar */
        $query = "SELECT 
					    resid.vazn_nakhales_r,
					    resid.vazn_khales_r,
                        tedad_karton_r_d_sub sum_tedad_karton,
                        resid.tedad_karton_r,
                        resid_detail.vazn_mabda_r_d sum_vazn_mabda_r_d,
                        SUM(resid_kala_detail.vazn_nakhales_r_d_sub) sum_vazn_nakhales_r,
                        resid.noe_tahvil_bar,
                        resid.code_ostan_mabda,
                        resid.code_skk,
                        kala.code_group_kala,
                        kala.code_nerkh_standard,
                        kala.mahmule_type,
                        resid.shomare_resid,
                        kala.nerkh_standard,
                        MAX(resid.tarikh_resid) tarikh_resid,
                        kala.name_kala,
                        mt_skk.name_skk,
                        ostan.name_ostan,
                        cmk.code_mali_keshty
					FROM resid
                        INNER JOIN resid_kala_detail
                            ON resid.shomare_resid = resid_kala_detail.shomare_resid
                            AND resid.code_ostan = resid_kala_detail.code_ostan
                            AND resid.code_anbar = resid_kala_detail.code_anbar
                            AND resid.year = resid_kala_detail.year
						INNER JOIN resid_detail 
							ON resid_detail.shomare_resid = resid.shomare_resid 
							AND resid.code_ostan = resid_detail.code_ostan 
							AND resid.code_anbar = resid_detail.code_anbar 
							AND resid.year = resid_detail.year
						INNER JOIN kala ON kala.code_kala = resid_detail.code_kala
						LEFT JOIN mt_skk ON resid.code_skk=mt_skk.code_skk
						LEFT JOIN coding_mali_keshty cmk ON resid.code_skk=cmk.code_skk
						LEFT JOIN ostan ON ostan.code_ostan=resid.code_ostan_mabda
					WHERE ";
                    if(isset($setResidNumber)){
                        $query .= "resid.shomare_resid BETWEEN '{$resid_from}' AND '{$resid_to}'";
                    }else{
                        $query .= "tarikh_resid BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'";
                    }
                        $query .= " AND resid.code_ostan={$code_ostan}
                        AND resid.noe_tahvil_bar != 9
						AND resid_detail.code_ostan={$code_ostan}  
						AND resid.code_anbar={$code_sardkhane} 
						AND resid_detail.code_anbar = {$code_sardkhane} 
						AND resid.year = {$year}
						AND resid_detail.year = {$year}
						AND resid.deleted=0 
						AND resid.status=0
						AND resid_detail.status = 0 ";
						if(!SuperUser())
							$query .= "AND set_sanad = 0 ";
						$query .= "GROUP BY kala.code_kala, shomare_resid, noe_tahvil_bar,code_ostan_mabda,code_skk,code_group_kala";

// dd($query);
        $result = pdo_execute($pdo, $query);
		
        $queryForSetSanad = "SELECT resid.id
                                FROM resid
                                    INNER JOIN resid_kala_detail 
                                        ON resid.shomare_resid = resid_kala_detail.shomare_resid 
                                        AND resid.code_ostan = resid_kala_detail.code_ostan 
                                        AND resid.code_anbar = resid_kala_detail.code_anbar 
                                        AND resid.year = resid_kala_detail.year 
                                      INNER JOIN resid_detail 
                                        ON resid_detail.shomare_resid = resid.shomare_resid 
                                        AND resid.code_ostan = resid_detail.code_ostan 
                                        AND resid.code_anbar = resid_detail.code_anbar 
                                        AND resid.year = resid_detail.year 
                                    INNER JOIN kala ON kala.code_kala = resid_kala_detail.code_kala
                                    LEFT JOIN mt_skk ON resid.code_skk=mt_skk.code_skk
                                    LEFT JOIN coding_mali_keshty cmk ON resid.code_skk=cmk.code_skk
                                    LEFT JOIN ostan ON ostan.code_ostan=resid.code_ostan_mabda
                                WHERE ";
                                if(isset($setResidNumber)){
                                    $queryForSetSanad .= "resid.shomare_resid BETWEEN '{$resid_from}' AND '{$resid_to}'";
                                }else{
                                    $queryForSetSanad .= "tarikh_resid BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'";
                                }
                                    $queryForSetSanad .= " AND resid.code_ostan={$code_ostan}
                                    AND resid.noe_tahvil_bar != 9
                                    AND resid_detail.code_ostan={$code_ostan}  
                                    AND resid_kala_detail.code_ostan={$code_ostan}  
                                    AND resid.code_anbar={$code_sardkhane} 
                                    AND resid_detail.code_anbar = {$code_sardkhane} 
                                    AND resid_kala_detail.code_anbar = {$code_sardkhane} 
                                    AND resid.year = {$year}
									AND resid_detail.year = {$year}
									AND resid_kala_detail.year = {$year}
                                    AND resid.deleted=0 
                                    AND resid.status=0
                                    AND resid_kala_detail.status = 0 
                                    AND resid_detail.status = 0 ";
                                    if(!SuperUser())
                    					$queryForSetSanad .= "AND set_sanad = 0 ";


        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_resid) {
                $tarikh = substr($value->tarikh_resid, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_resid);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            if ($value->noe_tahvil_bar == 4 || $value->noe_tahvil_bar == 5) {
                $sharh = str_replace("ی", "ي", $stat[1]->sharh_bestankar);
                $sharh = str_replace("(نام کالا)", $value->name_kala, $sharh);
                $sharh = str_replace("(وزن کالا)", (($value->code_group_kala == 2049) ? $value->sum_tedad_karton : $value->sum_vazn_mabda_r_d), $sharh);
                $sharh = str_replace("وزن", (($value->code_group_kala == 2049) ? 'تعداد' : 'وزن'), $sharh);
                $sharh = str_replace("کيلوگرم", (($value->code_group_kala == 2049) ? '' : 'کيلوگرم'), $sharh);
                $sharh = str_replace("(نام استان)", $value->name_ostan, $sharh);
                $sharh = str_replace("ی", "ي", $sharh);

                #echo  = "100;"{$tarikh_nesfe};";
                $echo  = "{$tarikh_kamel};";
                $echo .= removeSixZeroFromLastString($stat[1]->code_bestankar . str_pad($value->code_ostan_mabda, 3, '0', STR_PAD_LEFT) . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . "000000000000" . $level4) . ";";
                $echo .= "0;" . (($value->code_group_kala == 2049) ? $value->nerkh_standard * $value->sum_tedad_karton : $value->nerkh_standard * $value->sum_vazn_mabda_r_d) . ";1;";
                $echo .= $sharh;
                $echo .= ";0;";
                $echo .= "0;";
                $echo .= "0;";
                $echo .= "{$value->sum_vazn_mabda_r_d}";
                $echo .= "\r\n";
                fwrite($file, $echo);

            } else {
                $sharh = str_replace("ی", "ي", ($value->mahmule_type == 2 ? $stat[0]->sharh_bestankar : $stat[2]->sharh_bestankar));
                $sharh = str_replace("(نام کالا)", $value->name_kala, $sharh);
                $sharh = str_replace("(وزن کالا)", (($value->code_group_kala == 2049) ? $value->sum_tedad_karton : $value->sum_vazn_mabda_r_d), $sharh);
                $sharh = str_replace(($value->mahmule_type == 2 ? "(نام کشتي)" : "(نام شرکت)"), $value->name_skk, $sharh);
                $sharh = str_replace("وزن", (($value->code_group_kala == 2049) ? 'تعداد' : 'وزن'), $sharh);
                $sharh = str_replace("کيلوگرم", (($value->code_group_kala == 2049) ? '' : 'کيلوگرم'), $sharh);
                $sharh = str_replace("ی", "ي", $sharh);

                #echo  = "100;"{$tarikh_nesfe};";
                $echo  = "{$tarikh_kamel};";
                if ($value->mahmule_type == 2)
                    $echo .= removeSixZeroFromLastString($stat[0]->code_bestankar . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . str_pad($value->code_mali_keshty, 6, '0', STR_PAD_LEFT) . "000000" . $level4) . ";";
                else
                    $echo .= removeSixZeroFromLastString($stat[2]->code_bestankar . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . str_pad($value->code_mali_keshty, 6, '0', STR_PAD_LEFT) . "000000" . $level4) . ";";

				if ($value->noe_tahvil_bar != 2) {
                    $echo .= "0;" . (($value->code_group_kala == 2049) ? $value->nerkh_standard * $value->sum_tedad_karton : $value->nerkh_standard * $value->sum_vazn_mabda_r_d) . ";1;";
                } else {
                    $echo .= "0;" . (($value->code_group_kala == 2049) ? $value->nerkh_standard * $value->sum_tedad_karton : $value->nerkh_standard * $value->sum_vazn_khales_r) . ";1;";
                }
                $echo .= $sharh;
                $echo .= ";0;";
                $echo .= "0;";
                $echo .= "0;";
                if ($value->noe_tahvil_bar != 2) {
                    $echo .= "{$value->sum_vazn_mabda_r_d}";
                } else {
                    $echo .= "{$value->sum_vazn_khales_r}";
                }
                $echo .= "\r\n";
                fwrite($file, $echo);

            } /* end else */
            $tarikh_old = $value->tarikh_resid;
        } /* end foreach */

        /* Resid Jensi-Kasri */
        $query = "SELECT resid.vazn_nakhales_r,
                     resid_detail.vazn_mabda_r_d,
                     resid.year,
                     resid.noe_tahvil_bar,
                     resid.code_ostan_mabda,
                     resid.code_skk,
                     kala.code_group_kala,
                     kala.code_nerkh_standard,
                     kala.mahmule_type,
                     resid.shomare_resid,
                     SUM(resid_kala_detail.sum_karton_r_d_sub) AS sum_karton_r_d_sub,
                     kala.nerkh_standard,
                     resid.tarikh_resid,
                     kala.name_kala,
                     cmk.code_mali_keshty
                FROM resid
                    INNER JOIN resid_kala_detail ON resid.shomare_resid=resid_kala_detail.shomare_resid
                    INNER JOIN resid_detail ON resid_detail.shomare_resid=resid.shomare_resid
                    INNER JOIN kala ON kala.code_kala = resid_kala_detail.code_kala
                    LEFT JOIN coding_mali_keshty cmk ON resid.code_skk=cmk.code_skk
                WHERE ";
                if(isset($setResidNumber)){
                    $query .= "resid.shomare_resid BETWEEN '{$resid_from}' AND '{$resid_to}'";
                }else{
                    $query .= "tarikh_resid BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'";
                }
                    $query .= " AND resid.code_ostan={$code_ostan}
                    AND resid.noe_tahvil_bar != 9
                    AND resid_detail.code_ostan={$code_ostan}  
                    AND resid_kala_detail.code_ostan={$code_ostan}  
                    AND resid.code_anbar={$code_sardkhane} 
                    AND resid_detail.code_anbar = {$code_sardkhane} 
                    AND resid_kala_detail.code_anbar = {$code_sardkhane} 
                    AND resid.year = {$year}
                    AND resid_detail.year = {$year}
                    AND resid_kala_detail.year = {$year}
                    AND resid.deleted=0 
                    AND resid.status=0
                    AND resid_kala_detail.status = 0 
                    AND resid_detail.status = 0 ";
                    if(!SuperUser())
                    	$query .= "AND set_sanad = 0 ";
					$query .= "GROUP BY shomare_resid";
// dd($query);
        $result = pdo_execute($pdo, $query);

        $query = "SELECT * FROM bedehkar_bestankar WHERE noe_sanad=2 AND status_peymankar=1";
        $stat = pdo_execute($pdo, $query);

        foreach ($result as $key => $value) {
			if($value->code_group_kala != 2049) {
				$kasryKolTemp = kasryKol($value->shomare_resid, $code_ostan, $code_sardkhane, $value->year);
				if ($kasryKolTemp > 0) {
					$kasryKol[$value->code_group_kala] = isset($kasryKol[$value->code_group_kala]) ? $kasryKol[$value->code_group_kala] + $kasryKolTemp : $kasryKolTemp;
					$resultTemp[$value->code_group_kala] = $value;
				}
				$vaznEzafeTemp = vaznEzafe($value->shomare_resid, $code_ostan, $code_sardkhane, $value->year);
				if ($vaznEzafeTemp > 0) {
					$vaznEzafe[$value->code_group_kala] = isset($vaznEzafe[$value->code_group_kala]) ? $vaznEzafe[$value->code_group_kala] + $vaznEzafeTemp : $vaznEzafeTemp;
					$resultEzafeTemp[$value->code_group_kala] = $value;
				}
			}
        }

        $result = $resultTemp;
        $resultEzafe = $resultEzafeTemp;

        foreach ($result as $key => $value) {
            if ($tarikh_old != $value->tarikh_resid) {
                $tarikh = substr($value->tarikh_resid, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_resid);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh_kasry = str_replace("ی", "ي", $stat[0]->sharh_bedehkar);
            $sharh_kasry = str_replace("(نام کالا)", $value->name_kala, $sharh_kasry);
			$sharh_kasry = str_replace("(وزن)", $kasryKol[$key], $sharh_kasry);
			$sharh_kasry = str_replace("(وزن کالا)", $kasryKol[$key], $sharh_kasry);
            $sharh_kasry = str_replace("ی", "ي", $sharh_kasry);
            $sharh_kasry = $sharh_kasry;

            if ($value->noe_tahvil_bar == 4) {

             #echo  = "100;"{$tarikh_nesfe};";
             $echo  = "{$tarikh_kamel};"
                    . removeSixZeroFromLastString($stat[1]->code_bedehkar . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . "000000" . str_pad($code_acc, 6, '0', STR_PAD_LEFT) . $level4) . ";"
                    . $value->nerkh_standard * $kasryKol[$key] . ";0;2;"
                    . $sharh_kasry
                    . ";0;"
                    . "0;"
                    . "0;"
                    . $kasryKol[$key]
                    . "\r\n";
                fwrite($file, $echo);
            } else {
             #echo  = "100;"{$tarikh_nesfe};";
             $echo  = "{$tarikh_kamel};"
                    . removeSixZeroFromLastString(($value->mahmule_type == 2 ? $stat[0]->code_bedehkar : $stat[2]->code_bedehkar) . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . "000000" . str_pad($value->code_mali_keshty, 6, '0', STR_PAD_LEFT) . $level4) . ";"
                    . $value->nerkh_standard * $kasryKol[$key] . ";0;2;"
                    . $sharh_kasry
                    . ";0;"
                    . "0;"
                    . "0;"
                    . $kasryKol[$key]
                    . "\r\n";
                fwrite($file, $echo);
            } /* end else */

            $tarikh_old = $value->tarikh_resid;
        } /* end foreach */

        foreach ($resultEzafe as $key => $value) {
			
            if ($tarikh_old != $value->tarikh_resid) {
                $tarikh = substr($value->tarikh_resid, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_resid);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh_kasry = str_replace("ی", "ي", $stat[0]->sharh_bestankar);
            $sharh_kasry = str_replace("(نام کالا)", $value->name_kala, $sharh_kasry);
            $sharh_kasry = str_replace("(وزن کالا)", $vaznEzafe[$key], $sharh_kasry);
            $sharh_kasry = str_replace("ی", "ي", $sharh_kasry);
            $sharh_kasry = $sharh_kasry;

            if ($value->noe_tahvil_bar == 4) {

             #echo  = "100;"{$tarikh_nesfe};";
             $echo  = "{$tarikh_kamel};"
                    . removeSixZeroFromLastString($stat[1]->code_bestankar . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . "000000" . str_pad($code_acc, 6, '0', STR_PAD_LEFT) . $level4) . ";"
                    . "0;".$value->nerkh_standard * $vaznEzafe[$key] . ";1;"
                    . $sharh_kasry
                    . ";0;"
                    . "0;"
                    . "0;"
                    . $vaznEzafe[$key]
                    . "\r\n";
                fwrite($file, $echo);
            } else {
             #echo  = "100;"{$tarikh_nesfe};";
             $echo  = "{$tarikh_kamel};"
                    . removeSixZeroFromLastString(($value->mahmule_type == 2 ? $stat[0]->code_bestankar : $stat[2]->code_bestankar) . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . "000000" . str_pad($value->code_mali_keshty, 6, '0', STR_PAD_LEFT) . $level4) . ";"
                    . "0;".$value->nerkh_standard * $vaznEzafe[$key] . ";1;"
                    . $sharh_kasry
                    . ";0;"
                    . "0;"
                    . "0;"
                    . $vaznEzafe[$key]
                    . "\r\n";
                fwrite($file, $echo);
            } /* end else */
            $tarikh_old = $value->tarikh_resid;
        } /* end foreach */
/*************************************/
    if ($status == 'gharardad' || true) {

        $query = "SELECT * FROM bedehkar_bestankar WHERE noe_sanad=6";
        $stat = pdo_execute($pdo, $query);

        /* gharardad-Bedehkar */
        $query = "SELECT
  *,SUM(allin.vazn_khales_r) sum_vazn
FROM
  (SELECT
    r.shomare_resid,
    r.tarikh_resid,
    r.vazn_khales_r,
    gk.shomare_gharardad,
    gk.code_skk,
    gk.gheymat_har_kilo,
    skk.name_skk,
    k.code_group_kala,
    gr.name_group_kala,
    ghk.code_kh_mali,
    amd.code
 FROM gharardad_kharid gk
    INNER JOIN shomare_safar ss
      ON ss.`shomare_safar` = gk.`shomare_gharardad`
    INNER JOIN resid r
      ON r.id_safar = ss.`id_safar`
    INNER JOIN mt_skk skk
      ON skk.`code_skk` = gk.`code_skk`
    INNER JOIN dastorolamal_kharid dk
      ON dk.`id_dastorolamal` = gk.`id_dastorolamal`
    INNER JOIN gheymat_kharid ghk
      ON ghk.`id_dastorolamal` = dk.`id_dastorolamal`
    INNER JOIN kala k
      ON k.code_kala = ghk.`code_kala`
    INNER JOIN group_kala gr
      ON gr.`code_group_kala` = k.`code_group_kala`
    INNER JOIN mali.acc_mofaser_detail amd on amd.name LIKE concat('%',gk.shomare_gharardad,'%')
  WHERE r.deleted = 0
    AND r.status = 0 AND "
    .(isset($setResidNumber) ? "r.shomare_resid BETWEEN '{$resid_from}' AND '{$resid_to}'" : "r.tarikh_resid BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'")
    ." AND mk = 29
       AND r.code_ostan={$code_ostan}
       AND r.code_anbar={$code_sardkhane} 
       AND r.noe_tahvil_bar in (1,2)
     GROUP BY shomare_safar) allin;";

$query="SELECT r.shomare_resid, 
               r.tarikh_resid, 
               SUM(r.vazn_khales_r) sum_vazn, 
               gk.shomare_gharardad, 
               gk.code_skk, 
               gk.gheymat_har_kilo, 
               skk.name_skk,
               gk.code_kala,
               k.code_group_kala, 
               gr.name_group_kala, 
               ghk.code_kh_mali, amd.code 
          FROM resid r
          LEFT JOIN shomare_safar ss USING(id_safar)
          LEFT JOIN gharardad_kharid gk  ON ss.shomare_safar = gk.`shomare_gharardad` 
          LEFT JOIN mt_skk skk ON skk.`code_skk` = r.`code_skk` 
          LEFT JOIN dastorolamal_kharid dk ON dk.`id_dastorolamal` = gk.`id_dastorolamal` 
          LEFT JOIN gheymat_kharid ghk ON ghk.`id_dastorolamal` = dk.`id_dastorolamal`
          LEFT JOIN kala k ON k.code_kala = ghk.`code_kala` 
          LEFT JOIN group_kala gr ON gr.`code_group_kala` = k.`code_group_kala` 
          LEFT JOIN mali.acc_mofaser_detail amd ON amd.name LIKE CONCAT('%',gk.shomare_gharardad,'%')
          WHERE r.deleted = 0
            AND r.status = 0
            AND r.set_sanad = 0
            AND r.code_ostan={$code_ostan} AND r.code_anbar={$code_sardkhane} 
            AND r.year={$year}
            AND r.noe_tahvil_bar IN (1,2) AND "
          .(isset($setResidNumber) ? "r.shomare_resid BETWEEN '{$resid_from}' AND '{$resid_to}' " : "r.tarikh_resid BETWEEN '{$date_from_asli}' AND '{$date_to_asli}' ")
          ."AND gk.year=r.year
            AND gk.code_kala=k.code_kala
            AND mk = 29
          GROUP BY shomare_gharardad;";

        if(SuperUser()) $query = str_replace("AND r.set_sanad = 0","",$query);

        $queryForSetSanadXXX = "SELECT r.id
                                FROM gharardad_kharid gk
                                    INNER JOIN shomare_safar ss ON ss.`shomare_safar` = gk.`shomare_gharardad`
                                    INNER JOIN resid r ON r.id_safar = ss.`id_safar`
                                WHERE r.deleted = 0
                                    AND r.status = 0
                                    AND r.set_sanad_kharid=0
                                    AND gk.`shomare_gharardad` = '$_POST[shomare_gharardad]';";

        if(SuperUser()) $queryForSetSanadXXX = str_replace("AND r.set_sanad_kharid=0","",$queryForSetSanad);

        $result = pdo_execute($pdo, $query);
    
        $tarikh_old = 0;
        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_resid) {
                $tarikh = substr($value->tarikh_resid, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_resid);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bedehkar);
            $sharh = str_replace("(گروه کالا)", $value->name_group_kala, $sharh);
            $sharh = str_replace("(وزن)", $value->sum_vazn, $sharh);
            $sharh = str_replace("(مشتري)", $value->name_skk, $sharh);
            $sharh = str_replace("(قرارداد)", $value->shomare_gharardad, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);

            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};";
            $echo .= removeSixZeroFromLastString($stat[0]->code_bedehkar . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) /*. str_pad($value->code_kh_mali, 6, '0', STR_PAD_LEFT)*/ . str_pad($value->code_skk, 6, '0', STR_PAD_LEFT) .str_pad($value->code, 6, '0', STR_PAD_LEFT). $level4) . ";";
            $echo .= $value->sum_vazn*$value->gheymat_har_kilo . ";0;2;";
            $echo .= $sharh;
            $echo .= ";0;";
            $echo .= "0;";
            $echo .= "0;";
            $echo .= "{$value->sum_vazn}";
            $echo .= "\r\n";
            fwrite($file, $echo);

            $tarikh_old = $value->tarikh_resid;
        } /* end foreach */


        /* Bestankar */
        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_resid) {
                $tarikh = substr($value->tarikh_resid, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_resid);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bestankar);
            $sharh = str_replace("(گروه کالا)", $value->name_group_kala, $sharh);
            $sharh = str_replace("(قيمت)", $value->sum_vazn*$value->gheymat_har_kilo, $sharh);
            $sharh = str_replace("(وزن)", $value->sum_vazn, $sharh);
            $sharh = str_replace("(مشنري)", $value->name_skk, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);

            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};";
            $echo .= removeSixZeroFromLastString($stat[0]->code_bestankar . str_pad($value->code_skk, 6, '0', STR_PAD_LEFT) . str_pad($value->code, 6, '0', STR_PAD_LEFT) . "000000" . $level4) . ";";
            $echo .= '0;';
            $echo .= $value->sum_vazn*$value->gheymat_har_kilo . ";1;";
            $echo .= $sharh;
            $echo .= ";0;";
            $echo .= "0;";
            $echo .= "0;";
            $echo .= "{$value->sum_vazn}";
            $echo .= "\r\n";
            fwrite($file, $echo);

            $tarikh_old = $value->tarikh_resid;
        } /* end foreach */
    }
/*******************************/
    } /* end if varede */

    if ($status == 'sadere_ghatei') {
		$desc = "حواله قطعی";

        $date_from_split = explode('/', $date_from_asli);
        $date_to_split = explode('/', $date_to_asli);
        $date_from_miladi = implode('-', jalali_to_gregorian($date_from_split[0], $date_from_split[1], $date_from_split[2]));
        $date_to_miladi = implode('-', jalali_to_gregorian($date_to_split[0], $date_to_split[1], $date_to_split[2]));

        $query_status_peymankar = "SELECT status_peymankar FROM list_sardkhane WHERE code_ostan=" . $code_ostan . " AND code_anbar=" . $code_sardkhane . " LIMIT 1";
        $stmt = $pdo->prepare($query_status_peymankar);
        $stmt->execute();
        $status_peymankar = $stmt->fetchAll(PDO::FETCH_OBJ);


        $sell = new PDO("mysql:host=localhost;dbname=sell", "user", "xlsdj@#@aHdF");
        $stmt = $sell->prepare("SET character_set_results = 'utf8', character_set_client = 'utf8', character_set_connection = 'utf8', character_set_database = 'utf8', character_set_server = 'utf8'");
        $stmt->execute();

        $mainQuery = "SELECT 
                          h_p_priceh,
                          havale.h_code,
                          sefr_shode.h_op_code,
                          sefr_shode.h_price_code,
                          dm_customer_asli.name_customer,
                          havale.code_customer,
                          ROUND(SUM(havale_detail.vazn_khales_h_d), 3) AS sum_vazn_khales,
                          ROUND(SUM(havale_detail.vazn_nakhales_h_d), 3) AS sum_vazn_nakhales,
                          ROUND(SUM(havale_detail.sum_karton_h_d),3) AS sum_vazn_karton,
                          ROUND(SUM(havale_detail.tedad_karton_h_d),3) AS sum_tedad_karton,
                          havale.code_anbar,
                          havale.code_ostan,
                          MAX(havale.tarikh_havale_anbar) AS tarikh_havale_anbar,
                          kala.code_nerkh_standard,
                          kala.nerkh_standard,
                          kala.name_kala,
                          kala.code_kala,
                          kala.code_group_kala 
                    FROM
                      meat.havale 
                      INNER JOIN meat.kala 
                        ON kala.code_kala = havale.code_kala 
                      INNER JOIN sell.dm_customer_asli 
                        ON dm_customer_asli.code_customer = havale.code_customer 
                      INNER JOIN meat.havale_detail 
                        ON havale_detail.shomare_havale_anbar = havale.shomare_havale_anbar 
                        AND havale_detail.code_ostan = havale.code_ostan 
                        AND havale_detail.code_anbar = havale.code_anbar 
                        AND havale_detail.year = havale.year 
                      INNER JOIN 
                        (SELECT 
                          dm_havale.h_code,
                          h_p_priceh,
                          dm_havale.h_op_code,
                          dm_havale.h_price_code
                        FROM
                          sell.dm_havale
                          INNER JOIN 
                            (SELECT 
                              MAX(tarikh_havale_anbar) AS tarikh,
                              h_code
                            FROM
                              meat.havale 
                            WHERE code_ostan = {$code_ostan}
                              AND havale.code_anbar = {$code_sardkhane}
                              AND havale.status = 0 
                              AND havale.deleted = 0 
                            GROUP BY h_code) AS max_tarikh 
                            ON max_tarikh.h_code = dm_havale.h_code 
                        WHERE h_id_province = {$code_ostan} 
                          AND h_mande_havale = 0 ";
							if(isset($_POST['h_code'])){
								$mainQuery .= "AND max_tarikh.h_code = " . $_POST['h_code'] ." ) AS sefr_shode";
							}else{
								$mainQuery .= "AND max_tarikh.tarikh BETWEEN '{$date_from_asli}' AND '{$date_to_asli}') AS sefr_shode";
							}
                          $mainQuery .= " ON sefr_shode.h_code = havale.h_code 
                    WHERE havale.code_ostan = {$code_ostan} 
                          AND havale.noe_tahvil_bar != 9
                          AND havale.code_anbar = {$code_sardkhane} 
                          AND havale.status = 0 
                          AND havale.deleted = 0 
                          AND havale.status = 0 
                          AND havale.deleted = 0 
                          AND havale_detail.havale_deleted = 0 
                          AND havale_detail.status = 0 ";
						  if(!SuperUser())
                          	$mainQuery .= "AND set_sanad = 0 ";


		$queryForSetSanad = "SELECT havale.id
                    FROM
                      meat.havale 
                      INNER JOIN meat.kala 
                        ON kala.code_kala = havale.code_kala 
                      INNER JOIN sell.dm_customer_asli 
                        ON dm_customer_asli.code_customer = havale.code_customer 
                      INNER JOIN meat.havale_detail 
                        ON havale_detail.shomare_havale_anbar = havale.shomare_havale_anbar 
                        AND havale_detail.code_ostan = havale.code_ostan 
                        AND havale_detail.code_anbar = havale.code_anbar 
                        AND havale_detail.year = havale.year 
                      INNER JOIN 
                        (SELECT 
                          dm_havale.h_code,
                          h_p_priceh,
                          dm_havale.h_op_code,
                          dm_havale.h_price_code
                        FROM
                          sell.dm_havale
                          INNER JOIN 
                            (SELECT 
                              MAX(tarikh_havale_anbar) AS tarikh,
                              h_code
                            FROM
                              meat.havale 
                            WHERE code_ostan = {$code_ostan}
                              AND havale.code_anbar = {$code_sardkhane}
                              AND havale.deleted = 0 
                            GROUP BY h_code) AS max_tarikh 
                            ON max_tarikh.h_code = dm_havale.h_code 
                        WHERE h_id_province = {$code_ostan} 
                          AND h_mande_havale = 0 ";
							if(isset($_POST['h_code'])){
								$queryForSetSanad .= "AND max_tarikh.h_code = " . $_POST['h_code'] ." ) AS sefr_shode";
							}else{
								$queryForSetSanad .= "AND max_tarikh.tarikh BETWEEN '{$date_from_asli}' AND '{$date_to_asli}') AS sefr_shode";
							}
						$queryForSetSanad .= " ON sefr_shode.h_code = havale.h_code 
						WHERE havale.code_ostan = {$code_ostan} 
                          AND havale.noe_tahvil_bar != 9
                          AND havale.code_anbar = {$code_sardkhane} 
                          AND havale.status = 0 
                          AND havale.deleted = 0 
                          AND havale.status = 0 
                          AND havale.deleted = 0 
                          AND havale_detail.havale_deleted = 0 
                          AND havale_detail.status = 0 ";
						  if(!SuperUser())
							  $queryForSetSanad .= "AND set_sanad = 0";

        $query = $mainQuery . "GROUP BY code_nerkh_standard, code_group_kala";


        $resultJensi = pdo_execute($sell, $query);

		/* Havale Jensi-Bedehkar */
		$query = "SELECT * FROM bedehkar_bestankar WHERE noe_sanad=4 AND status_peymankar=" . $status_peymankar[0]->status_peymankar;
		$stat = pdo_execute($pdo, $query);

		$tarikh_old = 0;
        foreach ($resultJensi as $key => $value) {

            if ($tarikh_old != $value->tarikh_havale_anbar) {
                $tarikh = substr($value->tarikh_havale_anbar, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_havale_anbar);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bedehkar);
            $sharh = str_replace("(وزن کالا)", (($value->code_kala == 406 || $value->code_kala == 407) ? $value->sum_tedad_karton : $value->sum_vazn_khales), $sharh);
            $sharh = str_replace("(نام کالا)", $value->name_kala, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);

            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};"
                . removeSixZeroFromLastString($stat[0]->code_bedehkar . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . str_pad($value->code_nerkh_standard, 6, '0', STR_PAD_LEFT) . "000000" . $level4) . ";"
                . $value->nerkh_standard * (($value->code_kala == 406 || $value->code_kala == 407) ? $value->sum_tedad_karton : $value->sum_vazn_khales)
                . ";0;2;"
                . $sharh
                . ";0;"
                . str_pad($code_ostan, 2, '0', STR_PAD_LEFT)
                . "{$code_sardkhane}00000;0;"
                . ($value->code_kala == 406 || $value->code_kala == 407 ? $value->sum_tedad_karton : $value->sum_vazn_khales) . "\r\n";
            fwrite($file, $echo);
            $tarikh_old = $value->tarikh_havale_anbar;
        }

        /* Havale Jensi-Bestankar */
        foreach ($resultJensi as $key => $value) {

            if ($tarikh_old != $value->tarikh_havale_anbar) {
                $tarikh = substr($value->tarikh_havale_anbar, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_havale_anbar);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bestankar);
            $sharh = str_replace("(وزن کالا)", (($value->code_kala == 406 || $value->code_kala == 407) ? $value->sum_tedad_karton : $value->sum_vazn_nakhales), $sharh);
            $sharh = str_replace("(نام کالا)", $value->name_kala, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);


            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};"
                . removeSixZeroFromLastString($stat[0]->code_bestankar.str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT).str_pad($value->code_nerkh_standard, 6, '0', STR_PAD_LEFT).str_pad($code_acc, 6, '0', STR_PAD_LEFT).$level4) . ";0;"
                . ($value->nerkh_standard * (($value->code_kala == 406 || $value->code_kala == 407) ? $value->sum_tedad_karton : $value->sum_vazn_nakhales))
                . ";1;$sharh;0;"
                . str_pad($code_ostan, 2, '0', STR_PAD_LEFT)
                . "{$code_sardkhane}00000;0;"
                . ($value->code_kala == 406 || $value->code_kala == 407 ? $value->sum_tedad_karton : $value->sum_vazn_nakhales) . "\r\n";
            fwrite($file, $echo);
            $tarikh_old = $value->tarikh_havale_anbar;
        }


        /* Havale Jensi-Kasri */
        $query = "SELECT * FROM bedehkar_bestankar WHERE noe_sanad=2 AND status_peymankar=2";
        $stat = pdo_execute($pdo, $query);

        foreach ($resultJensi as $key => $value) {
            if ($tarikh_old != $value->tarikh_havale_anbar) {
                $tarikh = substr($value->tarikh_havale_anbar, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_havale_anbar);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh_kasry = str_replace("ی", "ي", $stat[0]->sharh_bedehkar);
            $sharh_kasry = str_replace("(وزن کارتن)", $value->sum_vazn_karton, $sharh_kasry);
            $sharh_kasry = str_replace("(نام کالا)", $value->name_kala, $sharh_kasry);

            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};"
                . removeSixZeroFromLastString($stat[0]->code_bedehkar . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . "000000" . str_pad($code_acc, 6, '0', STR_PAD_LEFT) . $level4) . ";"
                . $value->nerkh_standard * $value->sum_vazn_karton . ";0;2;"
                . $sharh_kasry . ';'
                . "0;"
                . "0;0;"
                . $value->sum_vazn_karton
                . "\r\n";
            fwrite($file, $echo);

            $tarikh_old = $value->tarikh_resid;
        } /* end foreach */

        /* Havale Riali */
        if ($_SESSION['bz_systemforush'] == 0)//اطلاعات حواله فروش از سیستم انبار
        {
            $query = "SELECT * FROM havale_forush WHERE mande_az_forush=0";
        }
        if ($_SESSION['bz_systemforush'] == 1)//اطلاعات حواله فروش از سیستم فروش
        {
            $sell = new PDO("mysql:host=localhost;dbname=sell", "user", "xlsdj@#@aHdF");
            $stmt = $sell->prepare("SET character_set_results = 'utf8', character_set_client = 'utf8', character_set_connection = 'utf8', character_set_database = 'utf8', character_set_server = 'utf8'");
            $stmt->execute();

        }

        $query = $mainQuery . "GROUP BY havale.h_code,code_nerkh_standard";
        $result = pdo_execute($pdo, $query);

        $query = "SELECT * FROM bedehkar_bestankar WHERE noe_sanad=5";
        $stat = pdo_execute($pdo, $query);

        /* Havale Riali-Bedehkar */
        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_havale_anbar) {
                $tarikh = substr($value->tarikh_havale_anbar, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_havale_anbar);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bestankar);
            $sharh = str_replace("(وزن کالا)", (($value->code_kala == 406 || $value->code_kala == 407) ? $value->sum_tedad_karton : $value->sum_vazn_khales), $sharh);
            $sharh = str_replace("(نام مشتري)", $value->name_customer, $sharh);
            $sharh = str_replace("(شماره حواله)", $value->h_code, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);


            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};"
                . removeSixZeroFromLastString($stat[0]->code_bedehkar
                . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT)
                . str_pad($value->h_price_code, 6, '0', STR_PAD_LEFT)
                . str_pad($value->code_customer, 6, '0', STR_PAD_LEFT)
				. $level4) . ";"
                . ($value->h_p_priceh * (($value->code_kala == 406 || $value->code_kala == 407) ? $value->sum_tedad_karton : $value->sum_vazn_khales))
                . ";0;2;$sharh;12;"
                . "{$value->h_code};0;" . (($value->code_kala == 406 || $value->code_kala == 407) ? $value->sum_tedad_karton : $value->sum_vazn_khales) . "\r\n";
            fwrite($file, $echo);
        }

        /* Havale Riali-Bestankar */
        foreach ($result as $key => $value) {
            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bestankar);
            $sharh = str_replace("(وزن کالا)", (($value->code_kala == 406 || $value->code_kala == 407) ? $value->sum_tedad_karton : $value->sum_vazn_khales), $sharh);
            $sharh = str_replace("(نام مشتري)", $value->name_customer, $sharh);
            $sharh = str_replace("(شماره حواله)", $value->h_code, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);


            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};"
                . removeSixZeroFromLastString($stat[0]->code_bestankar
                . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT)
                . str_pad($value->h_price_code, 6, '0', STR_PAD_LEFT)
                . str_pad($value->code_customer, 6, '0', STR_PAD_LEFT)
				. $level4) . ";0;"
                . ($value->h_p_priceh * (($value->code_kala == 406 || $value->code_kala == 407) ? $value->sum_tedad_karton : $value->sum_vazn_khales))
                . ";1;$sharh;24;"
                . "{$value->h_code};0;" . (($value->code_kala == 406 || $value->code_kala == 407) ? $value->sum_tedad_karton : $value->sum_vazn_khales) . "\r\n";
            fwrite($file, $echo);
        }
    }

    // mande dar va ghatei shod 1394/03/24
    if ($status == 'sadere_mande') {
		$desc = "حواله مانده دار";

        $date_from_split = explode('/', $date_from_asli);
        $date_to_split = explode('/', $date_to_asli);
        $date_from_miladi = implode('-', jalali_to_gregorian($date_from_split[0], $date_from_split[1], $date_from_split[2]));
        $date_to_miladi = implode('-', jalali_to_gregorian($date_to_split[0], $date_to_split[1], $date_to_split[2]));

        $query_status_peymankar = "SELECT status_peymankar FROM list_sardkhane WHERE code_ostan=" . $code_ostan . " AND code_anbar=" . $code_sardkhane . " LIMIT 1";
        $status_peymankar = pdo_execute($pdo, $query_status_peymankar);

        $sell = new PDO("mysql:host=localhost;dbname=sell", "user", "xlsdj@#@aHdF");
        $stmt = $sell->prepare("SET character_set_results = 'utf8', character_set_client = 'utf8', character_set_connection = 'utf8', character_set_database = 'utf8', character_set_server = 'utf8'");
        $stmt->execute();

        $query = "SELECT dm_havale.h_price_code,
                       dm_havale.h_p_priceh,
                       dm_havale.h_code,
                       dm_havale.h_op_code,
                       SUM(dm_havale.h_amount) h_amounts,
                       dm_customer_asli.name_customer,
                       havale.code_customer,
                       havale.code_anbar,
                       havale.code_ostan,
                       havale.shomare_havale_anbar,
                       SUM(havale.vazn_khales_h) sum_vazn_khales_h,
                       kala.nerkh_standard,
                       kala.code_group_kala,
                       kala.code_nerkh_standard,
                       kala.name_kala,
                       max(havale.tarikh_havale_anbar) tarikh_havale_anbar
                FROM sell.dm_havale
                     INNER JOIN meat.havale ON havale.h_code = dm_havale.h_code
                     INNER JOIN meat.kala ON havale.code_kala = kala.code_kala
                     INNER JOIN sell.dm_customer_asli ON dm_customer_asli.code_customer = havale.code_customer
                WHERE havale.tarikh_havale_anbar BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'
                     AND havale.noe_tahvil_bar != 9
                     AND havale.code_ostan = {$code_ostan}
                     AND dm_havale.h_id_province = {$code_ostan}
                     AND havale.code_anbar = {$code_sardkhane}
                     AND havale.status = 0
                     AND havale.deleted = 0 ";
					 if(!SuperUser())
						 $query .= "AND set_sanad = 0
                GROUP BY kala.code_nerkh_standard";

		$queryForSetSanad = "SELECT havale.id
					FROM sell.dm_havale
						 INNER JOIN meat.havale ON havale.h_code = dm_havale.h_code
						 INNER JOIN meat.kala ON havale.code_kala = kala.code_kala
						 INNER JOIN sell.dm_customer_asli ON dm_customer_asli.code_customer = havale.code_customer
					WHERE havale.tarikh_havale_anbar BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'
                         AND havale.noe_tahvil_bar != 9
						 AND havale.code_ostan = {$code_ostan}
						 AND dm_havale.h_id_province = {$code_ostan}
						 AND havale.code_anbar = {$code_sardkhane}
						 AND havale.status = 0
						 AND havale.deleted = 0 ";
						 if(!SuperUser())
							 $queryForSetSanad .= "AND set_sanad = 0 ";

        $result = pdo_execute($sell, $query);

        /* Havale Jensi-Bedehkar */
        $query = "SELECT * FROM bedehkar_bestankar WHERE noe_sanad=4 AND status_peymankar=" . $status_peymankar[0]->status_peymankar;
        $stat = pdo_execute($pdo, $query);

        $tarikh_old = 0;
        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_havale_anbar) {
                $tarikh = substr($value->tarikh_havale_anbar, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_havale_anbar);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bedehkar);
            $sharh = str_replace("(وزن کالا)", $value->sum_vazn_khales_h, $sharh);
            $sharh = str_replace("(نام کالا)", $value->name_kala, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);


            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};"
                . removeSixZeroFromLastString($stat[0]->code_bedehkar . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . str_pad($value->code_nerkh_standard, 6, '0', STR_PAD_LEFT) . "000000" . $level4) . ";"
                . $value->nerkh_standard * $value->sum_vazn_khales_h
                . ";0;2;"
                . $sharh
                . ";0;"
                . "00000;0;{$value->sum_vazn_khales_h}\r\n";
            fwrite($file, $echo);
            $tarikh_old = $value->tarikh_havale_anbar;
        }

        /* Havale Jensi-Bestankar */
        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_havale_anbar) {
                $tarikh = substr($value->tarikh_havale_anbar, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_havale_anbar);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bestankar);
            $sharh = str_replace("(وزن کالا)", $value->sum_vazn_khales_h, $sharh);
            $sharh = str_replace("(نام کالا)", $value->name_kala, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);


            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};"
                . removeSixZeroFromLastString($stat[0]->code_bestankar
                . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT)
                . str_pad($value->code_nerkh_standard, 6, '0', STR_PAD_LEFT)
                . str_pad($code_acc, 6, '0', STR_PAD_LEFT)
                . $level4) . ";0;"
                . ($value->nerkh_standard * $value->sum_vazn_khales_h)
                . ";1;$sharh;0;"
                . "00000;0;{$value->sum_vazn_khales_h}\r\n";
            fwrite($file, $echo);
            $tarikh_old = $value->tarikh_havale_anbar;
        }

        /* Havale Riali */
        if ($_SESSION['bz_systemforush'] == 0)//اطلاعات حواله فروش از سیستم انبار
        {
            $query = "SELECT h_price_code, h_code FROM havale_forush WHERE mande_az_forush=0";
        }
        if ($_SESSION['bz_systemforush'] == 1)//اطلاعات حواله فروش از سیستم فروش
        {
            $sell = new PDO("mysql:host=localhost;dbname=sell", "user", "xlsdj@#@aHdF");
            $stmt = $sell->prepare("SET character_set_results = 'utf8', character_set_client = 'utf8', character_set_connection = 'utf8', character_set_database = 'utf8', character_set_server = 'utf8'");
            $stmt->execute();
            $query = "SELECT dm_havale.h_price_code,
                       dm_havale.h_p_priceh,
                       dm_havale.h_code,
                       dm_havale.h_op_code,
                       dm_customer_asli.name_customer,
                       dm_customer_asli.code_customer,
                       havale.code_anbar,
                       havale.code_ostan,
                       havale.shomare_havale_anbar,
                       SUM(havale.vazn_khales_h) sum_vazn_khales_h,
                       kala.nerkh_standard,
                       kala.code_group_kala,
                       kala.code_nerkh_standard,
                       max(havale.tarikh_havale_anbar) tarikh_havale_anbar
                FROM sell.dm_havale
                     INNER JOIN meat.havale ON havale.h_code = dm_havale.h_code
                     INNER JOIN sell.dm_customer_asli ON dm_customer_asli.code_customer = havale.code_customer
                     INNER JOIN meat.kala ON havale.code_kala = kala.code_kala
                WHERE havale.tarikh_havale_anbar BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'
                     AND havale.noe_tahvil_bar != 9
                     AND havale.code_ostan = {$code_ostan}
                     AND havale.code_anbar = {$code_sardkhane}
                     AND dm_havale.h_id_province = {$code_ostan}
                     AND havale.status = 0
                     AND havale.deleted = 0 ";
					 if(!SuperUser())
						 $query .= "AND set_sanad = 0
                GROUP BY h_code,kala.code_nerkh_standard";
        }
        $result = pdo_execute($sell, $query);

        $query = "SELECT * FROM bedehkar_bestankar WHERE noe_sanad=5";
        $stat = pdo_execute($pdo, $query);

        /* Havale Riali-Bedehkar */
        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_havale_anbar) {
                $tarikh = substr($value->tarikh_havale_anbar, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_havale_anbar);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bestankar);
            $sharh = str_replace("(وزن کالا)", $value->sum_vazn_khales_h, $sharh);
            $sharh = str_replace("(نام کالا)", $value->name_kala, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);


            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bestankar);
            $sharh = str_replace("(وزن کالا)", $value->sum_vazn_khales_h, $sharh);
            $sharh = str_replace("(نام مشتري)", $value->name_customer, $sharh);
            $sharh = str_replace("(شماره حواله)", $value->h_code, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);


            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};"
                . removeSixZeroFromLastString($stat[0]->code_bedehkar
                . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT)
                . str_pad($value->h_price_code, 6, '0', STR_PAD_LEFT)
                . str_pad($value->code_customer, 6, '0', STR_PAD_LEFT)
				. $level4) . ";"
                . ($value->h_p_priceh * $value->sum_vazn_khales_h)
                . ";0;2;$sharh;12;"
                . "{$value->h_code};0;{$value->sum_vazn_khales_h}\r\n";
            fwrite($file, $echo);
            $tarikh_old = $value->tarikh_havale_anbar;
        }

        /* Havale Riali-Bestankar */
        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_havale_anbar) {
                $tarikh = substr($value->tarikh_havale_anbar, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_havale_anbar);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bestankar);
            $sharh = str_replace("(وزن کالا)", $value->sum_vazn_khales_h, $sharh);
            $sharh = str_replace("(نام مشتري)", $value->name_customer, $sharh);
            $sharh = str_replace("(شماره حواله)", $value->h_code, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);


            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};"
                . removeSixZeroFromLastString($stat[0]->code_bestankar
                . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT)
                . str_pad($value->h_price_code, 6, '0', STR_PAD_LEFT)
                . str_pad($value->code_customer, 6, '0', STR_PAD_LEFT)
				. $level4) . ";0;"
                . ($value->h_p_priceh * $value->sum_vazn_khales_h)
                . ";1;$sharh;24;"
                . "{$value->h_code};0;{$value->sum_vazn_khales_h}\r\n";
            fwrite($file, $echo);
            $tarikh_old = $value->tarikh_havale_anbar;
        }

    }

    if ($status == 'sadere_jabejaei') {
		$desc = "حواله جابجایی";
        $sell = new PDO("mysql:host=localhost;dbname=sell", "user", "xlsdj@#@aHdF");
        $stmt = $sell->prepare("SET character_set_results = 'utf8', character_set_client = 'utf8', character_set_connection = 'utf8', character_set_database = 'utf8', character_set_server = 'utf8'");
        $stmt->execute();

        $query_status_peymankar = "SELECT status_peymankar FROM list_sardkhane WHERE code_ostan=" . $code_ostan . " AND code_anbar=" . $code_sardkhane . " LIMIT 1";
        $status_peymankar = pdo_execute($pdo, $query_status_peymankar);


        $query = "SELECT * FROM bedehkar_bestankar WHERE noe_sanad=4 AND status_peymankar=" . $status_peymankar[0]->status_peymankar . " AND noe_mabda = 2";
        $stat = pdo_execute($pdo, $query);


        /* Havale Jensi-Bestankar */
        $query = "SELECT 
                    MAX(havale.tarikh_havale_anbar) AS tarikh_havale_anbar,
                    SUM(havale_detail.tedad_karton_h_d) AS sum_tedad_karton,
                    SUM(havale_detail.vazn_nakhales_h_d) AS sum_vazn_nakhales_h,
                    havale.noe_tahvil_bar,
                    kala.code_group_kala,
                    kala.code_nerkh_standard,
                    kala.nerkh_standard,
                    kala.name_kala,
                    ostan.name_ostan
                  FROM
                    havale 
                    INNER JOIN havale_detail 
                      ON havale_detail.shomare_havale_anbar = havale.shomare_havale_anbar 
                      AND havale.code_ostan = havale_detail.code_ostan 
                      AND havale.code_anbar = havale_detail.code_anbar 
                      AND havale.year = havale_detail.year 
                    INNER JOIN kala 
                      ON kala.code_kala = havale_detail.code_kala 
                    LEFT JOIN ostan 
                      ON ostan.code_ostan = havale.code_ostan ";
						if(isset($_POST['shomare_jabejae'])){
                            $query .= "WHERE havale.shomare_jabejae = '".$_POST['shomare_jabejae']."' ";
						}else{
							$query .= "WHERE tarikh_havale_anbar BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'";
						}
                    $query .= "AND havale.noe_tahvil_bar = 4 
                    AND havale.code_ostan = {$code_ostan}  
                    AND havale_detail.code_ostan = {$code_ostan}  
                    AND havale.code_anbar = {$code_sardkhane} 
                    AND havale_detail.code_anbar = {$code_sardkhane} 
                    AND havale.deleted = 0 
                    AND havale.status = 0 
                    AND havale_detail.status = 0 ";
					if(!SuperUser())
						$query .= "AND set_sanad = 0
                  GROUP BY code_nerkh_standard";


		$queryForSetSanad = "SELECT havale.id
								  FROM
									havale 
									INNER JOIN havale_detail 
									  ON havale_detail.shomare_havale_anbar = havale.shomare_havale_anbar 
									  AND havale.code_ostan = havale_detail.code_ostan 
									  AND havale.code_anbar = havale_detail.code_anbar 
									  AND havale.year = havale_detail.year 
									INNER JOIN kala 
									  ON kala.code_kala = havale_detail.code_kala 
									LEFT JOIN ostan 
									  ON ostan.code_ostan = havale.code_ostan ";
                                        if(isset($_POST['shomare_jabejae'])){
                                            $queryForSetSanad .= "WHERE havale.shomare_jabejae = '".$_POST['shomare_jabejae']."' ";
                                        }else{
                                            $queryForSetSanad .= "WHERE tarikh_havale_anbar BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'";
                                        }
                                    $queryForSetSanad .= "AND havale.noe_tahvil_bar = 4 
									AND havale.code_ostan = {$code_ostan}  
									AND havale_detail.code_ostan = {$code_ostan}  
									AND havale.code_anbar = {$code_sardkhane} 
									AND havale_detail.code_anbar = {$code_sardkhane} 
									AND havale.deleted = 0 
									AND havale.status = 0 
									AND havale_detail.status = 0 ";
									if (!SuperUser()) $queryForSetSanad .= "AND set_sanad = 0 ";

        $result = pdo_execute($pdo, $query);

        $tarikh_old = 0;
        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_havale_anbar) {
                $tarikh = substr($value->tarikh_havale_anbar, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_havale_anbar);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bestankar);
            $sharh = str_replace("(نام کالا)", $value->name_kala, $sharh);
            $sharh = str_replace("(نام استان)", $value->name_ostan, $sharh);
            $sharh = str_replace("(وزن کالا)", (($value->code_group_kala == 2049) ? $value->sum_tedad_karton : $value->sum_vazn_nakhales_h), $sharh);
            $sharh = str_replace("ی", "ي", $sharh);

            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};";
            $echo .= removeSixZeroFromLastString($stat[0]->code_bestankar . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . str_pad($value->code_nerkh_standard, 6, '0', STR_PAD_LEFT) . str_pad($code_acc, 6, '0', STR_PAD_LEFT) . $level4) . ";";
            $echo .= '0;';
            $echo .= (($value->code_group_kala == 2049) ? $value->nerkh_standard * $value->sum_tedad_karton : $value->nerkh_standard * $value->sum_vazn_nakhales_h) . ";1;";
            $echo .= $sharh;
            $echo .= ";0;";
            $echo .= "0;";
            $echo .= "0;";
            $echo .= "{$value->sum_vazn_nakhales_h}";
            $echo .= "\r\n";
            fwrite($file, $echo);

            $tarikh_old = $value->tarikh_resid;
        } /* end foreach */

        $query = "SELECT 
                    MAX(havale.tarikh_havale_anbar) AS tarikh_havale_anbar,
                    SUM(havale_detail.tedad_karton_h_d) AS sum_tedad_karton,
                    SUM(havale_detail.vazn_nakhales_h_d) AS sum_vazn_nakhales_h,
                    havale.noe_tahvil_bar,
                    kala.code_group_kala,
                    kala.code_nerkh_standard,
                    kala.nerkh_standard,
                    kala.name_kala,
                    ostan.name_ostan,
                    mojavez_jabejae.code_ostan_maghsad_j as code_ostan
                  FROM
                    havale 
                    INNER JOIN havale_detail 
                      ON havale_detail.shomare_havale_anbar = havale.shomare_havale_anbar 
                      AND havale.code_ostan = havale_detail.code_ostan 
                      AND havale.code_anbar = havale_detail.code_anbar 
                      AND havale.year = havale_detail.year 
                    INNER JOIN kala 
                      ON kala.code_kala = havale_detail.code_kala
                    INNER JOIN mojavez_jabejae 
                      ON mojavez_jabejae.shomare_jabejae = havale.shomare_jabejae  
                    LEFT JOIN ostan 
                      ON ostan.code_ostan = mojavez_jabejae.code_ostan_maghsad_j ";
                        if(isset($_POST['shomare_jabejae'])){
                            $query .= "WHERE havale.shomare_jabejae = '".$_POST['shomare_jabejae']."' ";
                        }else{
                            $query .= "WHERE tarikh_havale_anbar BETWEEN '{$date_from_asli}' AND '{$date_to_asli}'";
                        }
                    $query .= "AND havale.noe_tahvil_bar = 4 
                    AND havale.code_ostan = {$code_ostan}  
                    AND havale_detail.code_ostan = {$code_ostan}  
                    AND havale.code_anbar = {$code_sardkhane} 
                    AND havale_detail.code_anbar = {$code_sardkhane} 
                    AND mojavez_jabejae.year = {$year}  
                    AND mojavez_jabejae.code_ostan = {$code_ostan}  
                    AND mojavez_jabejae.code_anbar = {$code_sardkhane} 
                    AND havale.deleted = 0 
                    AND havale.status = 0 
                    AND havale_detail.status = 0 ";
					if(!SuperUser())
						$query .= "AND set_sanad = 0
                GROUP BY code_nerkh_standard, code_ostan";

        $result = pdo_execute($pdo, $query);

        foreach ($result as $key => $value) {

            if ($tarikh_old != $value->tarikh_resid) {
                $tarikh = substr($value->tarikh_resid, 2);
                $tarikh = explode("/", $tarikh);
                $tarikh_kamel = str_replace("/","",$value->tarikh_resid);
                array_pop($tarikh);
                $tarikh_nesfe = implode("", $tarikh);
            }

            $sharh = str_replace("ی", "ي", $stat[0]->sharh_bedehkar);
            $sharh = str_replace("(نام کالا)", $value->name_kala, $sharh);
            $sharh = str_replace("(وزن کالا)", (($value->code_group_kala == 2049) ? $value->sum_tedad_karton : $value->sum_vazn_nakhales_h), $sharh);
            $sharh = str_replace("(نام استان)", $value->name_ostan, $sharh);
            $sharh = str_replace("ی", "ي", $sharh);

            #echo  = "100;"{$tarikh_nesfe};";
            $echo  = "{$tarikh_kamel};";
            $echo .= removeSixZeroFromLastString($stat[0]->code_bedehkar . str_pad($value->code_ostan, 3, '0', STR_PAD_LEFT) . str_pad($value->code_group_kala, 6, '0', STR_PAD_LEFT) . "000000000000" . $level4) . ";";
            $echo .= (($value->code_group_kala == 2049) ? $value->nerkh_standard * $value->sum_tedad_karton : $value->nerkh_standard * $value->sum_vazn_nakhales_h) . ";0;2;";
            $echo .= $sharh;
            $echo .= ";0;";
            $echo .= "0;";
            $echo .= "0;";
            $echo .= "{$value->sum_vazn_nakhales_h}";
            $echo .= "\r\n";
            fwrite($file, $echo);

            $tarikh_old = $value->tarikh_resid;
        } /* end foreach */
    }

    if(isset($_POST['date_from'])){
        $dateExplode = explode('/', $date_from_asli);
    }else{
		$dateExplode = [$_SESSION['mtActiveYear'],1,1];
    }
	
	$desc .= "-" . $_SESSION['mt_name_anbar'];
	$user_id = 97;
	$pishSanad = $status == 'gharardad' ? 96 : 97;
	//dd(__DIR__ . '/sanad/' . $code_ostan . 'tmp.csv');
	//dd($_SESSION);
    $sanadNo = add2acc(__DIR__ . '/sanad/' . $code_ostan . 'tmp.csv', ';', $user_id, $code_ostan, $dateExplode[0], $pishSanad, $desc);
    if ($sanadNo > 0) {
		echo '<div style="color:#006633;width:100%;padding:30px;font-family:tahoma;font-size:25px;background-color:#99ffcc;;text-align:center;" >سند حسابداری با شماره ' . $pishSanad . '/' . $sanadNo . ' با موفقیت وارد سیستم مالی شد</div>';
		if (!SuperUser())
			set_flag_sanad($pdo, $queryForSetSanad, $status, $code_ostan, $code_sardkhane, $sanadNo);
	}else
        echo '<div style="color:#800000;width:100%;padding:30px;font-family:tahoma;font-size:25px;background-color:#ff9999;;text-align:center;" >سند حسابداری ثبت نشد </div>';
}

?>